-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- 主机： 127.0.0.1
-- 生成日期： 2025-08-03 16:52:37
-- 服务器版本： 10.4.32-MariaDB
-- PHP 版本： 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 数据库： `foodmanager`
--
CREATE DATABASE IF NOT EXISTS `foodmanager` DEFAULT CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci;
USE `foodmanager`;

-- --------------------------------------------------------

--
-- 表的结构 `calorie_records`
--
-- 创建时间： 2025-08-02 05:53:20
-- 最后更新： 2025-08-03 14:47:55
--

DROP TABLE IF EXISTS `calorie_records`;
CREATE TABLE `calorie_records` (
  `id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `record_date` date NOT NULL,
  `food_name` varchar(255) NOT NULL,
  `quantity` int(11) NOT NULL DEFAULT 1,
  `calorie` float NOT NULL,
  `source` enum('nutrition_facts','openai','manual') NOT NULL,
  `created_at` datetime DEFAULT current_timestamp(),
  `protein` float DEFAULT 0,
  `fat` float DEFAULT 0,
  `carb` float DEFAULT 0,
  `fiber` float DEFAULT 0,
  `vitamin` text DEFAULT NULL,
  `mineral` text DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 插入之前先把表清空（truncate） `calorie_records`
--

TRUNCATE TABLE `calorie_records`;
--
-- 转存表中的数据 `calorie_records`
--

INSERT INTO `calorie_records` (`id`, `user_id`, `record_date`, `food_name`, `quantity`, `calorie`, `source`, `created_at`, `protein`, `fat`, `carb`, `fiber`, `vitamin`, `mineral`) VALUES
(74, 1, '2025-07-21', '黑森林蛋糕', 2, 553.4, 'manual', '2025-07-21 23:10:14', 0, 0, 0, 0, NULL, NULL),
(84, 1, '2025-08-02', '清燉牛肉麵', 1, 430, 'manual', '2025-08-02 15:15:35', 30, 15, 50, 4, '維生素B群、維生素A', '鐵、鋅、鈉'),
(85, 1, '2025-08-03', '清燉牛肉麵', 1, 430, 'manual', '2025-08-03 17:49:34', 30, 15, 60, 4, '維生素B群、維生素A', '鐵、鈣、鋅'),
(86, 1, '2025-08-03', '黑森林蛋糕', 2, 553.4, 'manual', '2025-08-03 17:49:48', 8, 30, 70, 4, '維生素A、維生素B群', '鈣、鐵、鎂'),
(87, 1, '2025-08-03', '起司蛋餅', 1, 270, 'manual', '2025-08-03 17:50:15', 12, 15, 30, 2, '維生素A、維生素B群', '鈣、磷、鈉'),
(88, 1, '2025-08-03', '冰紅茶', 1, 27.5, 'manual', '2025-08-03 17:50:26', 0, 0, 22, 0, '維生素C', '鉀'),
(91, 1, '2025-08-03', '烤雞胸肉配藜麥和綜合蔬菜', 1, 750, 'manual', '2025-08-03 22:45:21', 40, 6, 35, 8, '維生素A、維生素C、維生素B群', '鉀、鎂、鐵');

-- --------------------------------------------------------

--
-- 表的结构 `family`
--
-- 创建时间： 2025-07-13 15:11:07
--

DROP TABLE IF EXISTS `family`;
CREATE TABLE `family` (
  `familyId` int(11) NOT NULL,
  `familyName` varchar(50) NOT NULL,
  `createdBy` int(11) NOT NULL,
  `createdAt` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 插入之前先把表清空（truncate） `family`
--

TRUNCATE TABLE `family`;
-- --------------------------------------------------------

--
-- 表的结构 `family_member`
--
-- 创建时间： 2025-07-13 15:11:07
--

DROP TABLE IF EXISTS `family_member`;
CREATE TABLE `family_member` (
  `id` int(11) NOT NULL,
  `uId` int(11) NOT NULL,
  `familyId` int(11) NOT NULL,
  `role` varchar(50) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 插入之前先把表清空（truncate） `family_member`
--

TRUNCATE TABLE `family_member`;
-- --------------------------------------------------------

--
-- 表的结构 `family_roles`
--
-- 创建时间： 2025-07-13 15:11:04
--

DROP TABLE IF EXISTS `family_roles`;
CREATE TABLE `family_roles` (
  `id` int(11) NOT NULL,
  `role_name` varchar(50) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 插入之前先把表清空（truncate） `family_roles`
--

TRUNCATE TABLE `family_roles`;
--
-- 转存表中的数据 `family_roles`
--

INSERT INTO `family_roles` (`id`, `role_name`) VALUES
(3, '哥哥'),
(9, '外公'),
(10, '外婆'),
(8, '奶奶'),
(6, '妹妹'),
(4, '姐姐'),
(2, '媽媽'),
(5, '弟弟'),
(1, '爸爸'),
(7, '爺爺');

-- --------------------------------------------------------

--
-- 表的结构 `ingredient`
--
-- 创建时间： 2025-07-13 15:11:07
--

DROP TABLE IF EXISTS `ingredient`;
CREATE TABLE `ingredient` (
  `IngredientId` int(11) NOT NULL,
  `uId` int(11) NOT NULL,
  `IName` varchar(50) NOT NULL,
  `Quantity` int(11) DEFAULT NULL,
  `ExpireDate` date DEFAULT NULL,
  `StoreType` varchar(20) DEFAULT NULL,
  `Unit` varchar(20) DEFAULT NULL,
  `PurchaseDate` date DEFAULT NULL,
  `ConsumedDate` date DEFAULT NULL,
  `Role` varchar(50) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 插入之前先把表清空（truncate） `ingredient`
--

TRUNCATE TABLE `ingredient`;
--
-- 转存表中的数据 `ingredient`
--

INSERT INTO `ingredient` (`IngredientId`, `uId`, `IName`, `Quantity`, `ExpireDate`, `StoreType`, `Unit`, `PurchaseDate`, `ConsumedDate`, `Role`) VALUES
(2, 1, '牛奶', 0, '2025-03-30', '冷藏', '個', '2025-01-03', '2025-04-22', NULL),
(3, 1, '米', 4, NULL, '常溫', 'kg', '2025-01-03', '2025-04-22', NULL),
(4, 1, '牛肉', NULL, '2025-04-01', '冷凍', 'g', '2025-01-03', '2025-04-22', NULL),
(12, 1, '青菜', 49, '2025-04-29', '冷藏', NULL, '2025-04-22', NULL, NULL),
(13, 1, '牛奶', 3, '2025-05-15', '冷藏', NULL, '2025-04-30', NULL, NULL),
(15, 1, '菜', 45, '2025-06-02', '常溫', 'g', '2025-05-27', NULL, NULL),
(16, 1, '蘋果汁', 10, '2025-06-21', '冷藏', '瓶', '2025-05-27', NULL, NULL),
(17, 1, '菜', NULL, NULL, NULL, '', NULL, NULL, NULL),
(19, 1, '蛋', 5, '2025-06-05', '常溫', '顆', '2025-05-28', NULL, NULL),
(20, 1, '高麗菜', 2, '2025-07-10', '冷藏', '個', '2025-07-02', NULL, '媽媽'),
(21, 1, '水餃', 10, '2025-07-06', '冷藏', '個', '2025-07-03', NULL, '弟弟'),
(22, 6, '水餃', 7, '2025-07-06', '冷藏', '個', '2025-07-03', NULL, '未指定'),
(23, 6, '12', 1, '2025-07-22', '冷凍', '克', '2025-07-03', NULL, '未指定'),
(24, 6, '2145', 4, '2025-07-06', '冷藏', '包', '2025-07-03', NULL, '未指定'),
(25, 6, '42401', 4, '2025-07-09', '冷凍', '毫升', '2025-07-03', NULL, '未指定'),
(26, 6, '542414245', 4, '2025-07-15', '冷凍', '公斤', '2025-07-03', NULL, '未指定'),
(27, 6, '54254', 4, '2025-07-22', '冷藏', '毫升', '2025-07-03', NULL, '未指定'),
(28, 6, '524156', 1, '2025-07-28', '冷凍', '毫升', '2025-07-03', NULL, '未指定'),
(29, 6, 'zxczx', 54, '2025-07-14', '冷凍', '克', '2025-07-03', NULL, '弟弟'),
(30, 6, '7448', 8, '2025-07-15', '冷凍', '包', '2025-07-03', NULL, '弟弟'),
(31, 6, '875875', 6, '2025-07-23', '常溫', '克', '2025-07-03', NULL, '弟弟'),
(32, 6, '45784', 5, '2025-07-08', NULL, '克', '2025-07-03', NULL, '弟弟'),
(33, 6, '23', NULL, NULL, NULL, '', '2025-07-03', NULL, '弟弟');

-- --------------------------------------------------------

--
-- 表的结构 `ingredientusage`
--
-- 创建时间： 2025-07-13 15:11:07
--

DROP TABLE IF EXISTS `ingredientusage`;
CREATE TABLE `ingredientusage` (
  `UsageId` int(11) NOT NULL,
  `IngredientId` int(11) NOT NULL,
  `uId` int(11) NOT NULL,
  `UsedQuantity` int(11) NOT NULL,
  `Unit` varchar(50) DEFAULT NULL,
  `UsageDate` date NOT NULL,
  `Note` varchar(255) DEFAULT NULL,
  `Role` varchar(50) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 插入之前先把表清空（truncate） `ingredientusage`
--

TRUNCATE TABLE `ingredientusage`;
--
-- 转存表中的数据 `ingredientusage`
--

INSERT INTO `ingredientusage` (`UsageId`, `IngredientId`, `uId`, `UsedQuantity`, `Unit`, `UsageDate`, `Note`, `Role`) VALUES
(1, 2, 1, 2, '瓶', '2025-04-30', '過期 丟掉', NULL),
(2, 3, 1, 1, 'g', '2025-05-27', '', NULL),
(4, 15, 1, 1, 'kg', '2025-05-30', '', NULL),
(5, 15, 1, 1, 'g', '2025-05-30', '', NULL),
(6, 16, 1, 1, '瓶', '2025-05-30', '', NULL);

-- --------------------------------------------------------

--
-- 表的结构 `notifications`
--
-- 创建时间： 2025-07-13 15:11:08
--

DROP TABLE IF EXISTS `notifications`;
CREATE TABLE `notifications` (
  `id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `type` varchar(50) NOT NULL,
  `content` varchar(255) NOT NULL,
  `item_id` int(11) DEFAULT NULL,
  `item_name` varchar(100) NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `is_read` tinyint(1) NOT NULL DEFAULT 0,
  `role` varchar(50) DEFAULT '未指定'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 插入之前先把表清空（truncate） `notifications`
--

TRUNCATE TABLE `notifications`;
--
-- 转存表中的数据 `notifications`
--

INSERT INTO `notifications` (`id`, `user_id`, `type`, `content`, `item_id`, `item_name`, `created_at`, `is_read`, `role`) VALUES
(1, 6, 'ingredient', '新增了食材', 28, '524156', '2025-07-03 04:46:47', 1, '未指定'),
(2, 6, 'ingredient', '新增了食材', 29, 'zxczx', '2025-07-03 05:16:02', 1, '弟弟'),
(3, 6, 'ingredient', '新增了食材', 30, '7448', '2025-07-03 05:19:36', 1, '弟弟'),
(4, 6, 'ingredient', '新增了食材', 31, '875875', '2025-07-03 05:19:51', 1, '弟弟'),
(5, 6, 'ingredient', '新增了食材', 32, '45784', '2025-07-03 05:20:02', 1, '弟弟'),
(6, 6, 'ingredient', '新增了食材', 33, '23', '2025-07-03 05:20:04', 1, '弟弟');

-- --------------------------------------------------------

--
-- 表的结构 `nutrition_facts`
--
-- 创建时间： 2025-07-13 15:11:04
--

DROP TABLE IF EXISTS `nutrition_facts`;
CREATE TABLE `nutrition_facts` (
  `id` int(11) NOT NULL,
  `food_category` varchar(255) DEFAULT NULL,
  `sample_name` varchar(255) DEFAULT NULL,
  `content_description` text DEFAULT NULL,
  `alias` varchar(255) DEFAULT NULL,
  `kcal` float DEFAULT NULL,
  `protein` float DEFAULT NULL,
  `fat` float DEFAULT NULL,
  `saturated_fat` float DEFAULT NULL,
  `carbohydrate` float DEFAULT NULL,
  `fiber` float DEFAULT NULL,
  `total_sugar` float DEFAULT NULL,
  `sodium` float DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 插入之前先把表清空（truncate） `nutrition_facts`
--

TRUNCATE TABLE `nutrition_facts`;
--
-- 转存表中的数据 `nutrition_facts`
--

INSERT INTO `nutrition_facts` (`id`, `food_category`, `sample_name`, `content_description`, `alias`, `kcal`, `protein`, `fat`, `saturated_fat`, `carbohydrate`, `fiber`, `total_sugar`, `sodium`) VALUES
(1, '穀物類', '大麥仁', '樣品狀態:生,已去殼; 前處理描述:混合均勻磨碎', '小薏仁,洋薏仁,珍珠薏仁', 364.623, 8.5578, 1.5935, 0.4673, 77.1418, 8.4591, 0.425, 12.6115),
(2, '穀物類', '大麥片', '樣品狀態:生; 前處理描述:混合均勻打碎', NULL, 364.616, 8.636, 1.79, 0.4558, 76.6666, 5.9987, NULL, 7.185),
(3, '穀物類', '大麥仁粉', '樣品狀態:烘烤過; 前處理描述:混合均勻', '小薏仁粉,洋薏仁粉,珍珠薏仁粉', 388.848, 7.118, 1.3142, 0.3678, 84.9554, 7.2048, 0, 9.83),
(4, '穀物類', '小米', '樣品狀態:生,已去殼; 前處理描述:混合均勻磨碎', NULL, 370.194, 11.3135, 3.655, 0.4416, 71.6907, 2.2226, NULL, 1),
(5, '穀物類', '糯小米', '樣品狀態:生; 前處理描述:混合均勻磨碎', NULL, 360.197, 12.465, 1.5164, 0.2565, 72.5162, 1.4293, 0, 1.206),
(6, '穀物類', '小麥', '樣品狀態:生,已去殼; 前處理描述:混合均勻磨碎', NULL, 361.642, 14.118, 2.565, 0.4667, 69.1678, 11.2724, NULL, 1.37),
(7, '穀物類', '小麥胚芽', '樣品狀態:生; 前處理描述:混合均勻打碎', NULL, 417.003, 31.362, 11.585, 1.7347, 47.9154, 9.98, NULL, 3.115),
(8, '穀物類', '去筋麵粉', '前處理描述:混合均勻', '澄粉', 354.949, 0.181, 0.1165, 0, 85.7443, 0.4484, 0, 28.606),
(9, '穀物類', '低筋麵粉', '前處理描述:混合均勻', NULL, 363.608, 8.0855, 1.175, 0.2458, 78.1938, 1.9804, NULL, 1.43),
(10, '穀物類', '中筋麵粉', '前處理描述:混合均勻', NULL, 361.028, 11.4535, 1.31, 0.2763, 74.0972, 1.8165, NULL, 3.65),
(11, '穀物類', '高筋麵粉', '前處理描述:混合均勻', NULL, 361.577, 12.945, 1.19, 0.2538, 73.0587, 1.881, NULL, 0.8),
(12, '穀物類', '高筋麵粉(2021年取樣)', '前處理描述:混合均勻', '強力粉', 362.205, 13.805, 1.2755, 0.4902, 72.2213, 2.4611, 0.333, 0.98),
(13, '穀物類', '全麥麵粉', '前處理描述:混合均勻(高筋麵粉,麩皮等)', NULL, 359.272, 12.968, 1.706, 0.3209, 71.429, 8.0093, 0.3445, 1.6383),
(14, '穀物類', '雜糧中筋麵粉', '前處理描述:混合均勻(中筋麵粉,全麥麵粉,裸麥,小黑麥,燕麥,玉米,大豆,糙米,小米,亞麻籽等)', NULL, 360.943, 13.113, 2.2865, 0.6377, 71.978, 5.6845, 0.835, 1.906),
(15, '穀物類', '雜糧高筋麵粉', '前處理描述:混合均勻(高筋麵粉,麩皮,葵花籽,燕麥,玉米,大麥,米粉,小米,亞麻籽,蕎麥,香菜籽等)', NULL, 360.297, 14.288, 2.7543, 0.7869, 69.589, 5.3205, 1.054, 2.3),
(16, '穀物類', '白玉米', '樣品狀態:生; 前處理描述:取玉米粒,混合均均打碎', NULL, 65.8248, 3.4, 0.64, NULL, 11.45, 3.7, NULL, 5),
(17, '穀物類', '紫玉米', '樣品狀態:生; 前處理描述:取玉米粒,混合均勻打碎', NULL, 167.894, 4.461, 1.032, 0.286, 34.4208, 4.9285, NULL, 0.9235),
(18, '穀物類', '甜玉米', '樣品狀態:生; 前處理描述:取玉米粒,混合均勻打碎', '玉米,黃玉米', 106.903, 3.25, 2.4772, 0.7305, 17.8305, 4.7079, 6.954, 1.8639),
(19, '穀物類', '雙色水果玉米', '樣品狀態:生(黃白雙色品種); 前處理描述:取玉米粒,混合均勻打碎', '玉米,黃玉米', 105.403, 3.104, 2.5503, 0.7307, 17.4564, 4.0294, 7.795, 0.212),
(20, '穀物類', '糯玉米', '樣品狀態:生,每根均混有紫皮與黃皮(已去部分外葉); 前處理描述:取玉米粒混合均勻打碎', NULL, 172.18, 4.727, 1.898, 0.5357, 33.4494, 3.4869, 1.0849, 1.17),
(21, '穀物類', '冷凍玉米粒', '樣品狀態:冷凍製品; 前處理描述:混合均勻打碎', NULL, 173.579, 3.1, 8.2, NULL, 22.53, 3.1, NULL, 8),
(22, '穀物類', '乾玉米粒', '樣品狀態:乾貨; 前處理描述:混合均勻磨碎', NULL, 373.018, 10.8765, 3.9421, 0.6193, 72.2077, 12.8104, 0.504, 0.744),
(23, '穀物類', '玉米胚芽', '樣品狀態:生; 前處理描述:混合均勻打碎', '玉米仁,珍珠米', 365.885, 7.035, 0.8954, 0.1276, 80.3116, 5.6572, 0, 1.3895),
(24, '穀物類', '玉米粉', '前處理描述:混合均勻', NULL, 368.578, 0.323, 0.4163, 0.0752, 88.3084, 0.1896, 0, 13.778),
(25, '穀物類', '秈米平均值', '樣品狀態:生; 前處理描述:混合均勻磨碎', '在來米,長米', 356.564, 7.823, 0.8554, 0.3541, 77.3827, 0.5512, 0, 1.8395),
(26, '穀物類', '秈米(台中在來2號)', '樣品狀態:生,白秈米; 前處理描述:混合均勻磨碎', '在來米,長米', 354.788, 8.2, 1, NULL, 76.3, 0.5, NULL, 2),
(27, '穀物類', '秈米(台中秈10號)', '樣品狀態:生,白秈米; 前處理描述:混合均勻磨碎', '在來米,長米', 358.34, 7.446, 0.7108, 0.2943, 78.4653, 0.6023, 0, 1.679),
(28, '穀物類', '秈米(台中秈10號)(2024年取樣)', '樣品狀態:生,白秈米; 前處理描述:混合均勻磨碎', '在來米,長米', 357.392, 6.114, 0.56, 0.2207, 79.8055, 0.7475, 0.149, 0),
(29, '穀物類', '稉米平均值', '樣品狀態:生; 前處理描述:混合均勻磨碎', '蓬萊米,圓米', 353.952, 7.0319, 0.6964, 0.2078, 77.8224, 0.692, 0.0868, 2.0019),
(30, '穀物類', '稉米(台中189號)', '樣品狀態:生,白稉米; 前處理描述:混合均勻磨碎', '蓬萊米,圓米', 355.615, 7.5, 0.56, 0.1211, 78.0588, 0.34, NULL, 2.76),
(31, '穀物類', '稉米(台南11號)', '樣品狀態:生,白稉米; 前處理描述:混合均勻磨碎', '蓬萊米,圓米', 348.347, 6.741, 0.4819, 0.1903, 77.1738, 0.7578, 0, 2.107),
(32, '穀物類', '稉米(台稉2號)', '樣品狀態:生,白稉米; 前處理描述:混合均勻磨碎', '蓬萊米,圓米', 356.725, 7.205, 0.5069, 0.1437, 78.7163, 0.5784, 0, 2.3843),
(33, '穀物類', '稉米(台稉8號)', '樣品狀態:生,白稉米; 前處理描述:混合均勻磨碎', '蓬萊米,圓米', 355.243, 6.928, 0.4024, 0.1236, 78.8316, 0.4746, 0, 1.5755),
(34, '穀物類', '稉米(台稉9號)', '樣品狀態:生,白稉米; 前處理描述:混合均勻磨碎', '蓬萊米,圓米', 353.231, 6.58, 0.6335, 0.1926, 78.2041, 0.5678, 0, 1.94),
(35, '穀物類', '稉米(台農71號)', '樣品狀態:生,白稉米; 前處理描述:混合均勻磨碎', '蓬萊米,圓米,益全香米', 356.644, 7.9183, 0.6393, 0.2215, 77.7507, 0.8958, 0.0633, 1.6953),
(36, '穀物類', '稉米(高雄139號)', '樣品狀態:生,白稉米; 前處理描述:混合均勻磨碎', '蓬萊米,圓米', 357.245, 6.1225, 1.1844, 0.302, 78.4933, 1.2904, 0.4245, 2.2),
(37, '穀物類', '稉米(高雄142號)', '樣品狀態:生,白稉米; 前處理描述:混合均勻磨碎', '蓬萊米,圓米', 352.516, 7, 0.6, NULL, 77.7, 0.2, NULL, 4),
(38, '穀物類', '稉米(高雄145號)', '樣品狀態:生,白稉米; 前處理描述:混合均勻磨碎', NULL, 364.445, 6.768, 0.9792, 0.3388, 80.0453, 0.9515, 0.207, 0.566),
(39, '穀物類', '稉米(高雄139號)(2021年取樣)', '樣品狀態:生,白稉米; 前處理描述:混合均勻磨碎', '蓬萊米,圓米', 352.255, 5.666, 0.4619, 0.1802, 79.1833, 0.7871, 0.129, 0.71),
(40, '穀物類', '越光米', '樣品狀態:生,白稉米; 前處理描述:混合均勻磨碎', '蓬萊米,圓米', 339.507, 7.556, 0.9765, 0.2263, 73.25, 0.8641, 0, 0.7905),
(41, '穀物類', '越光米(台南16號)(2024年取樣)', '樣品狀態:生,白稉米; 前處理描述:混合均勻磨碎', '蓬萊米,圓米', 355.893, 6.948, 0.33, 0.1444, 79.1176, 0.8899, 0.116, 1.37),
(42, '穀物類', '秈型糯米(台中糯70號)', '樣品狀態:生; 前處理描述:混合均勻磨碎', '長糯米', 361.36, 7.8625, 0.89, 0.2399, 78.439, 0.4203, NULL, 1.31),
(43, '穀物類', '稉型糯米平均值', '樣品狀態:生; 前處理描述:混合均勻磨碎', '圓糯米', 358.156, 8.29, 0.81, 0.2292, 77.418, 0.7, NULL, 3.11),
(44, '穀物類', '稉型糯米', '樣品狀態:生; 前處理描述:混合均勻磨碎', '圓糯米', 358.626, 8.38, 0.52, 0.1471, 78.036, 0.7, NULL, 2.22),
(45, '穀物類', '稉型糯米(台稉糯1號)', '樣品狀態:生; 前處理描述:混合均勻磨碎', '圓糯米', 357.685, 8.2, 1.1, NULL, 76.8, 0.7, NULL, 4),
(46, '穀物類', '野生紅米', '樣品狀態:生,野生栽植; 前處理描述:混合均勻磨碎', NULL, 359.713, 7.693, 2.5955, 0.581, 74.7352, 3.4268, 0.2594, 8.286),
(47, '穀物類', '紅糯糙米', '樣品狀態:生; 前處理描述:混合均勻磨碎', NULL, 361.696, 9.92, 2.8463, 0.7399, 72.5936, 4.4756, 0.342, 0.591),
(48, '穀物類', '黑秈糯糙米', '樣品狀態:生; 前處理描述:混合均勻磨碎', '黑糯米,紫糯米,紫米,貢米,長生米', 357.408, 10.1235, 3.465, 0.8627, 70.1026, 3.293, NULL, 2.5),
(49, '穀物類', '胚芽秈米(台中秈10號)', '樣品狀態:生; 前處理描述:混合均勻磨碎', NULL, 363.018, 8.272, 2.0718, 0.5477, 76.0519, 2.7862, 0.48, 1.608),
(50, '穀物類', '胚芽稉米平均值', '樣品狀態:生; 前處理描述:混合均勻磨碎', NULL, 361.742, 8.1985, 1.5692, 0.464, 76.833, 1.5315, 0.1665, 1.4755),
(51, '穀物類', '胚芽稉米(台稉10號）', '樣品狀態:生; 前處理描述:混合均勻磨碎', NULL, 360.375, 7.28, 1.6679, 0.4918, 77.1722, 1.7754, 0.024, 1.039),
(52, '穀物類', '胚芽稉米(台稉9號)', '樣品狀態:生; 前處理描述:混合均勻磨碎', NULL, 363.11, 9.117, 1.4705, 0.436, 76.4937, 1.2875, 0.309, 1.912),
(53, '穀物類', '發芽稉米平均值', '樣品狀態:生; 前處理描述:混合均勻磨碎', '發芽糙米', 354.941, 7.798, 2.3453, 0.5447, 73.9857, 3.335, 0.167, 3.2655),
(54, '穀物類', '發芽稉米(台稉71號)', '樣品狀態:生; 前處理描述:混合均勻磨碎', '發芽糙米,益全香米發芽米', 356.738, 7.406, 2.8031, 0.5646, 73.8638, 3.3183, 0.334, 3.314),
(55, '穀物類', '發芽稉米(台稉9號）', '樣品狀態:生; 前處理描述:混合均勻磨碎', '發芽糙米', 353.145, 8.19, 1.8875, 0.4966, 74.1076, 3.3516, 0, 3.217),
(56, '穀物類', '糙秈米', '樣品狀態:生; 前處理描述:混合均勻磨碎', '糙米', 358.737, 7.285, 3.2064, 0.8013, 73.6444, 3.2902, 0.2851, 3.504),
(57, '穀物類', '糙稉米平均值', '樣品狀態:生; 前處理描述:混合均勻磨碎', '糙米', 364.276, 7.436, 2.3292, 0.572, 76.6276, 4.503, 0.45, 3.071),
(58, '穀物類', '糙稉米(台稉71號)', '樣品狀態:生; 前處理描述:混合均勻磨碎', '益全香米糙米', 360.382, 8.955, 2.6203, 0.5232, 73.6494, 3.5349, 0.4907, 3.054),
(59, '穀物類', '糙稉米(台稉9號)', '樣品狀態:生; 前處理描述:混合均勻磨碎', '糙米', 364.276, 7.436, 2.3292, 0.572, 76.6276, 4.503, 0.45, 3.071),
(60, '穀物類', '黑秈糙米', '樣品狀態:生,真空袋裝; 前處理描述:混合均勻磨碎', '黑米', 363.082, 7.455, 3.4538, 0.9126, 74.035, 4.4004, 0.755, 1.04),
(61, '穀物類', '加鈣米', '樣品狀態:生,含碳酸鈣之精選稉米; 前處理描述:混合均勻磨碎', NULL, 355.052, 7.37, 0.74, 0.1562, 77.68, 0.66, NULL, 7.58),
(62, '穀物類', '高纖米', '樣品狀態:生,高纖稉米; 前處理描述:混合均勻磨碎', '高纖蓬萊米', 362.723, 8.276, 2.47, 0.5086, 75.1674, 2.8368, NULL, 3.15),
(63, '穀物類', '五穀米', '樣品狀態:生(糙米,薏仁,蕎麥,小米,黑糯米,麥片,紅扁豆,紅薏仁等); 前處理描述:混合均勻磨碎', NULL, 358.285, 8.695, 2.8521, 0.7562, 72.9163, 4.8663, 0.8654, 2),
(64, '穀物類', '米胚芽', '樣品狀態:生; 前處理描述:混合均勻磨碎', NULL, 390.945, 17.024, 12.723, 2.9912, 52.8858, 14.7073, NULL, 4.9941),
(65, '穀物類', '秈米粉', '樣品狀態:水磨在來米粉; 前處理描述:混合均勻', '在來米粉', 363.249, 4.157, 0.4215, 0.0911, 83.3658, 0.5138, 0, 10.438),
(66, '穀物類', '糙米粉', '前處理描述:混合均勻', NULL, 392.739, 11.3, 3.2, NULL, 78.1, 3.2, NULL, 6),
(67, '穀物類', '白糯米粉', '樣品狀態:水磨糯米粉; 前處理描述:混合均勻', NULL, 359.895, 4.505, 0.3825, 0.122, 82.3007, 0.6174, 0, 15.861),
(68, '穀物類', '白飯', '樣品狀態:熟,白米加1.1倍的去離子水,用電鍋烹煮; 前處理描述:混合均勻打碎', NULL, 183.136, 3.09, 0.25, 0.0545, 41.01, 0.55, NULL, 2.03),
(69, '穀物類', '高梁', '樣品狀態:生; 前處理描述:混合均勻磨碎', NULL, 371.805, 11.0165, 3.0448, 0.6568, 73.6032, 5.1877, 0, 2.719),
(70, '穀物類', '糯高梁', '樣品狀態:生; 前處理描述:混合均勻磨碎', NULL, 362.326, 10.69, 1.04, 0.1696, 75.6852, 2.5494, NULL, 0),
(71, '穀物類', '黑麥片', '前處理描述:混合均勻打碎', NULL, 359.246, 7.784, 1.234, 0.2536, 77.3014, 10.7657, NULL, 1.3288),
(72, '穀物類', '燕麥', '樣品狀態:生; 前處理描述:混合均勻打碎', NULL, 406.036, 10.9165, 10.215, 1.9075, 67.4401, 8.5386, NULL, 3.905),
(73, '穀物類', '燕麥片', '樣品狀態:快煮即食; 前處理描述:混合均勻打碎', NULL, 393.374, 12.3, 9.7, NULL, 64.1, 4.7, NULL, 3),
(74, '穀物類', '即食燕麥片', '樣品狀態:沖泡即食; 前處理描述:混合均勻打碎', NULL, 406.251, 11.909, 9.5684, 1.7234, 67.8638, 10.5226, 0.88, 2.996),
(75, '穀物類', '蕎麥(甜蕎)', '樣品狀態:生; 前處理描述:混合均勻磨碎', '三角米', 360.843, 11.037, 2.8733, 0.5932, 71.2715, 3.524, NULL, 1.8033),
(76, '穀物類', '薏仁', '樣品狀態:生; 前處理描述:混合均勻磨碎', '薏仁,薏苡仁', 378.49, 14.0733, 6.05, 0.8633, 66.2196, 1.7952, NULL, 1.8733),
(77, '穀物類', '糙薏仁', '樣品狀態:生; 前處理描述:混合均勻磨碎', '紅薏仁', 386.851, 13.702, 7.3707, 1.1099, 65.9182, 3.7644, 0.4494, 1.059),
(78, '穀物類', '薏仁粉', '前處理描述:混合均勻', NULL, 394.795, 10.89, 3.475, 0.5128, 79.99, 2.99, NULL, 10.855),
(79, '穀物類', '紅藜麥', '樣品狀態:生; 前處理描述:混合均勻磨碎', NULL, 378.927, 12.134, 6.7366, 0.8969, 66.7713, 8.3217, 1.641, 2.21),
(80, '穀物類', '台灣藜(紅)(帶殼)', '樣品狀態:生,帶殼; 前處理描述:混合均勻磨碎', '藜,赤藜,紫藜,紅心藜,紅藜,食用藜', 385.581, 14.872, 8.45, 1.4415, 62.3071, 18.5031, 2.842, 1.13),
(81, '澱粉類', '淮山', '樣品狀態:乾貨; 前處理描述:混合均勻打碎', '山芋,山薯,田薯,薯蕷,長薯;淮山(加工後)', 362.835, 5.294, 0.34, 0.1086, 82.3519, 5.4408, NULL, 10.53),
(82, '澱粉類', '山藥平均值', '樣品狀態:生; 前處理描述:去皮,混合均勻打碎', '山芋,山薯,田薯,薯蕷,長薯;淮山(加工後)', 85.3829, 2.8187, 0.1107, 0.0502, 17.8241, 1.2767, 0.323, 3.9177),
(83, '澱粉類', '山藥(二刺)', '樣品狀態:生; 前處理描述:去皮,混合均勻打碎', '山芋,山薯,田薯,薯蕷,長薯;淮山(加工後)', 89.1922, 2.732, 0.0872, NULL, 18.8787, 1.5983, NULL, 2.1022),
(84, '澱粉類', '山藥(大汕1號)', '樣品狀態:生; 前處理描述:去皮,混合均勻打碎', '山芋,山薯,田薯,薯蕷,長薯;淮山(加工後)', 79.951, 2.407, 0.0749, NULL, 16.9691, 0.975, NULL, 4.0621),
(85, '澱粉類', '山藥(大汕3號)', '樣品狀態:生; 前處理描述:去皮,混合均勻打碎', '山芋,山薯,田薯,薯蕷,長薯;淮山(加工後)', 72.683, 2.649, 0.08, NULL, 14.965, 1.3492, NULL, 2.085),
(86, '澱粉類', '山藥(大刺)', '樣品狀態:生; 前處理描述:去皮,混合均勻打碎', '山芋,山薯,田薯,薯蕷,長薯;淮山(加工後)', 84.6262, 3.523, 0.0704, NULL, 17.0539, 1.1987, NULL, 7.674),
(87, '澱粉類', '山藥(中國長品)', '樣品狀態:生; 前處理描述:去皮,混合均勻打碎', '山芋,山薯,田薯,薯蕷,長薯;淮山(加工後)', 74.1359, 2.452, 0.0926, NULL, 15.479, 0.3957, NULL, 0.8894),
(88, '澱粉類', '山藥(台農1號)', '樣品狀態:生; 前處理描述:去皮,混合均勻打碎', '山芋,山薯,田薯,薯蕷,長薯;淮山(加工後)', 93.3841, 2.595, 0.1302, NULL, 19.9388, 1.1996, NULL, 0.8051),
(89, '澱粉類', '山藥(台農2號)', '樣品狀態:生; 前處理描述:去皮,混合均勻打碎', '山芋,山薯,田薯,薯蕷,長薯;淮山(加工後)', 94.8985, 3.207, 0.0594, NULL, 19.8694, 0.5808, NULL, 14.2629),
(90, '澱粉類', '山藥(白皮削)', '樣品狀態:生; 前處理描述:去皮,混合均勻打碎', '山芋,山薯,田薯,薯蕷,長薯;淮山(加工後)', 75.0452, 2.465, 0.0883, NULL, 15.6961, 1.4063, NULL, 2.4332),
(91, '澱粉類', '山藥(尖石原生種)', '樣品狀態:生; 前處理描述:去皮,混合均勻打碎', '山芋,山薯,田薯,薯蕷,長薯;淮山(加工後)', 64.6657, 3.14, 0.1494, NULL, 12.4121, 1.2715, NULL, 2.8681),
(92, '澱粉類', '山藥(宜蘭原生種)', '樣品狀態:生; 前處理描述:去皮,混合均勻打碎', '山芋,山薯,田薯,薯蕷,長薯;淮山(加工後)', 140.174, 4.796, 0.1859, NULL, 29.0937, 2.2504, NULL, 3.7645),
(93, '澱粉類', '山藥(花蓮3號)', '樣品狀態:生; 前處理描述:去皮,混合均勻打碎', '山芋,山薯,田薯,薯蕷,長薯;淮山(加工後)', 93.3366, 1.693, 0.0892, NULL, 20.8666, 1.4485, NULL, 5.62),
(94, '澱粉類', '山藥(青森)', '樣品狀態:生; 前處理描述:去皮,混合均勻打碎', '山芋,山薯,田薯,薯蕷,長薯;淮山(加工後)', 93.6043, 2.607, 0.1832, NULL, 19.8732, 2.0721, NULL, 3.6179),
(95, '澱粉類', '山藥(高田)', '樣品狀態:生; 前處理描述:去皮,混合均勻打碎', '山芋,山薯,田薯,薯蕷,長薯;淮山(加工後)', 71.0372, 3.116, 0.1381, NULL, 14.0043, 1.1452, NULL, 3.5835),
(96, '澱粉類', '山藥(白肉)', '樣品狀態:生; 前處理描述:去皮,混合均勻打碎', '日本山藥', 68.626, 2.08, 0.1207, 0.0548, 14.4376, 0.9825, 0.323, 1.08),
(97, '澱粉類', '紫山藥', '樣品狀態:生; 前處理描述:去皮,混合均勻打碎', '山薯,田薯,薯蕷,長薯,血薯;淮山(加工後)', 92.3211, 2.821, 0.0766, NULL, 19.5752, 1.0851, NULL, 2.8287),
(98, '澱粉類', '木薯粉', '樣品狀態:樹薯澱粉; 前處理描述:混合均勻', '樹薯粉', 361.669, 0.076, 0.1924, 0, 87.3207, 0.1736, 0, 0.783),
(99, '澱粉類', '白皮甘藷', '樣品狀態:生,白皮白肉; 前處理描述:去皮,混合均勻打碎', '甘薯,番薯,甜薯,地瓜,田薯,土薯,白薯', 119.209, 1.283, 0.1199, NULL, 27.473, 2.8505, 2.527, 72.992),
(100, '澱粉類', '菱角牛奶甘藷', '樣品狀態:生,白皮白肉; 前處理描述:去皮,混合均勻打碎', '甘薯,番薯,甜薯,地瓜,田薯,土薯,白薯', 133.164, 1.86, 0.3302, 0.2047, 29.8853, 1.6326, 4.756, 85.258),
(101, '澱粉類', '芋心甘藷', '樣品狀態:生,芋心種; 前處理描述:去皮,混合均勻打碎', '甘薯,番薯,甜薯,地瓜,田薯,土薯,紅薯,紫心甘薯,芋頭(仔)番薯', 122.315, 1.055, 0.1138, NULL, 28.4558, 2.8412, 4.3256, 87.0161),
(102, '澱粉類', '紅肉甘藷', '樣品狀態:生,紅皮紅肉; 前處理描述:去皮,混合均勻打碎', '甘薯,番薯,甜薯,地瓜,田薯,土薯', 113.718, 1.7783, 0.248, 0.1716, 25.41, 2.4046, 5.096, 41.7861),
(103, '澱粉類', '金時甘藷', '樣品狀態:生,紅皮黃肉; 前處理描述:去皮,混合均勻打碎', '甘薯,番薯,甜薯,地瓜,田薯,土薯', 138.296, 1.639, 0.3583, 0.2609, 31.2836, 2.1546, 5.392, 45.23),
(104, '澱粉類', '黃肉甘藷', '樣品狀態:生,黃皮黃肉; 前處理描述:去皮,混合均勻打碎', '甘薯,番薯,甜薯,地瓜,田薯,土薯', 120.667, 1.278, 0.1527, 0.1085, 27.7651, 2.5429, 4.8093, 51.2171),
(105, '澱粉類', '甘藷粉', '前處理描述:混合均勻', '甘薯粉,蕃薯粉,甜薯粉,地瓜粉', 357.56, 1.0215, 0.1509, NULL, 85.5103, 0.5183, 0, 19.063),
(106, '澱粉類', '油炸脫水甘藷', '前處理描述:混合均勻打碎', NULL, 524.9, 2.27, 30.1, NULL, 61.23, 25.01, NULL, 305),
(107, '澱粉類', '芋頭', '樣品狀態:生; 前處理描述:去皮,混合均勻打碎', '芋頭,芋艿,芋乃,芋仔,青芋,土芝', 127.75, 2.5, 1.1, NULL, 26.4, 2.31, NULL, 5),
(108, '澱粉類', '小芋頭(山芋)', '樣品狀態:生; 前處理描述:去皮,混合均勻打碎', '芋頭,芋艿,芋乃,芋仔,青芋,土芝', 112.938, 2.2897, 1.2044, 0.4475, 22.7924, 2.9333, 1.76, 5.4676),
(109, '澱粉類', '檳榔心芋', '樣品狀態:生; 前處理描述:去皮,混合均勻打碎', '芋頭,芋艿,芋乃,芋仔,青芋,土芝', 121.023, 1.298, 0.035, NULL, 28.0716, 2.6616, NULL, 2.3448),
(110, '澱粉類', '檳榔心芋(2021年取樣)', '樣品狀態:生; 前處理描述:去皮,混合均勻打碎', '芋頭,芋艿,芋乃,芋仔,青芋,土芝', 106.611, 1.139, 0, 0, 24.7955, 1.7126, 1.641, 0),
(111, '澱粉類', '冷凍芋頭塊', '樣品狀態:生,冷凍產品; 前處理描述:混合均勻打碎', NULL, 147.181, 2.2, 4.3, NULL, 24.9, 5.7, NULL, 15),
(112, '澱粉類', '芋頭粉', '樣品狀態:香芋,乳糖等; 前處理描述:混合均勻', NULL, 333.161, 0.102, 0.0475, 0, 83.0813, 9.1154, 73.477, 34.347),
(113, '澱粉類', '豆薯', '樣品狀態:生; 前處理描述:去皮,混合均勻打碎', '刈薯,涼薯,葛薯,沙葛,地瓜,三角薯', 31.4353, 0.728, 0.0616, 0, 6.8139, 1.255, 4.0227, 4.0819),
(114, '澱粉類', '紅馬鈴薯(粉紅珍珠馬鈴薯)', '樣品狀態:生,紅皮種; 前處理描述:去皮,混合均勻打碎', '洋芋,洋薯,洋山芋,荷蘭薯,日本番薯,塊茄', 65.7781, 1.64, 0.0173, 0, 14.374, 1.3319, 2.3783, 2.4604),
(115, '澱粉類', '馬鈴薯', '樣品狀態:生,黃皮種; 前處理描述:去皮,混合均勻打碎', '洋芋,洋薯,洋山芋,荷蘭薯,日本番薯,塊茄', 76.9397, 2.5825, 0.2161, NULL, 15.7848, 1.27, NULL, 3.0648),
(116, '澱粉類', '馬鈴薯(2022年取樣)', '樣品狀態:生,黃皮種; 前處理描述:去皮,混合均勻打碎', '洋芋,洋薯,洋山芋,荷蘭薯,日本番薯,塊茄', 70.3922, 2.276, 0, 0, 14.9255, 1.1825, 0.414, 1.93),
(117, '澱粉類', '小馬鈴薯(珍珠馬鈴薯)', '樣品狀態:生,黃皮種; 前處理描述:去皮,混合均勻打碎', '洋芋,洋薯,洋山芋,荷蘭薯,日本番薯,塊茄', 59.4809, 1.748, 0, 0, 12.7782, 1.174, 2.8298, 7.092),
(118, '澱粉類', '馬鈴薯粉', '前處理描述:混合均勻', '太白粉', 346.194, 0.09, 0.07, NULL, 83.8, 0.2, NULL, 7.5),
(119, '澱粉類', '荸薺', '樣品狀態:生; 前處理描述:去皮,混合均勻打碎', '水栗,地栗,馬蹄,馬薯,烏芋,水燈心草,海蔥仔,水蔥仔', 67.1952, 1.703, 0.0989, NULL, 14.4924, 2.0856, NULL, 21.2331),
(120, '澱粉類', '荸薺粉', '前處理描述:混合均勻', '水栗粉,地栗粉,馬蹄粉,馬薯粉,烏芋粉,水燈心草粉,海蔥仔粉,水蔥仔粉', 364.858, 0.384, 0.2065, 0, 87.7738, 0.5169, 0, 3.829),
(121, '澱粉類', '蓮藕', '樣品狀態:生; 前處理描述:去皮,混合均勻打碎', '蓮根,藕,芙蕖,荷花藕', 65.1526, 2.0293, 0.1893, 0.089, 13.5033, 3.2861, 3.1835, 15.6451),
(122, '澱粉類', '熟蓮藕', '樣品狀態:熟(已去皮); 前處理描述:浸泡水中,去藕節,混合均勻打碎', '蓮根,藕,芙蕖,荷花藕', 50.2206, 1.088, 0.0542, NULL, 11.0468, 1.4156, NULL, 28.5148),
(123, '澱粉類', '熟蓮藕切片(水煮)', '樣品狀態:熟(蓮藕,檸檬酸等); 前處理描述:混合均勻打碎', '蓮根,藕,芙蕖,荷花藕', 73.2139, 0.772, 0.048, 0.0138, 16.9402, 3.4489, 0, 77.431),
(124, '澱粉類', '蓮藕粉', '樣品狀態:蓮藕,馬鈴薯澱粉等; 前處理描述:混合均勻', NULL, 364.841, 0.12, 0.05, NULL, 88.3381, 0.323, NULL, 4.71),
(125, '澱粉類', '菱角(生)', '樣品狀態:生; 前處理描述:去殼,混合均勻打碎', '菱,芰,龍角,羊家,紅菱', 76.3995, 1.9, 0.33, NULL, 16.07, 1.9, NULL, 21),
(126, '澱粉類', '菱角仁(生)', '樣品狀態:生; 前處理描述:混合均勻打碎', NULL, 118.045, 4.141, 0.3171, 0.0959, 24.0776, 2.1549, 1.32, 14.651),
(127, '澱粉類', '菱角(熟)', '樣品狀態:熟; 前處理描述:去殼,混合均勻打碎', '菱,芰,龍角,羊家,紅菱', 146.244, 4.218, 0.25, NULL, 30.9853, 3.0271, NULL, 16.05),
(128, '澱粉類', '蒟蒻粉', '樣品狀態:蒟蒻抽出物,海藻抽出物,葡萄糖,檸檬酸鉀等; 前處理描述:混合均勻', NULL, 351.384, 0.184, 0.1888, 0, 87.2371, 7.3693, 82.955, 13.366),
(129, '堅果及種子類', '甘扁桃仁片(生)', '樣品狀態:生; 前處理描述:混合均勻打碎', '杏仁片(生)', 563.854, 27.257, 47.8116, 3.7499, 16.9753, 6.4918, 3.582, 20.058),
(130, '堅果及種子類', '甘扁桃仁片(熟)', '樣品狀態:熟; 前處理描述:混合均勻打碎', '杏仁片(熟)', 617.869, 23.443, 56.8882, 2.6533, 14.8323, 14.3597, 0, 73.271),
(131, '堅果及種子類', '甘扁桃仁(熟)', '樣品狀態:熟; 前處理描述:混合均勻打碎', '杏仁果(熟)', 587.878, 21.946, 49.8409, 4.2325, 23.2326, 9.8316, 4.256, 0.998),
(132, '堅果及種子類', '松子仁(生)', '樣品狀態:生; 前處理描述:混合均勻打碎', NULL, 677.758, 16.6155, 69.5262, 5.8509, 9.3778, 4.2042, 3.615, 3.5415),
(133, '堅果及種子類', '原味松子仁', '樣品狀態:熟; 前處理描述:混合均勻打碎', NULL, 680.428, 14.462, 68.9571, 6.8081, 13.0403, 5.9664, 2.689, 0.777),
(134, '堅果及種子類', '原味夏威夷豆', '樣品狀態:熟; 前處理描述:混合均勻打碎', '夏威夷火山豆', 699.835, 7.478, 71.6416, 12.2278, 18.2422, 6.2667, 4.836, 1.44),
(135, '堅果及種子類', '生核桃', '樣品狀態:生; 前處理描述:混合均勻打碎', NULL, 667.406, 15.388, 67.9249, 6.1122, 11.1741, 6.1672, 1.777, 4.5317),
(136, '堅果及種子類', '栗子(生)', '樣品狀態:生; 前處理描述:去殼,混合均勻打碎', NULL, 186.004, 3.53, 0.56, 0.1028, 41.54, 6.28, NULL, 1.58),
(137, '堅果及種子類', '栗子仁(生)', '樣品狀態:生; 前處理描述:混合均勻打碎', NULL, 176.478, 3.686, 0.7452, 0.1429, 38.6856, 8.6935, 8.08, 2.315),
(138, '堅果及種子類', '開心果', '樣品狀態:熟; 前處理描述:去殼,混合均勻打碎', NULL, 600.755, 22.381, 52.7376, 5.8468, 20.0686, 13.5612, 6.216, 462.322),
(139, '堅果及種子類', '腰果(生)', '樣品狀態:生; 前處理描述:混合均勻打碎', NULL, 568.136, 18.3335, 45.5279, 9.9121, 30.3317, 3.6073, 7.157, 11.2645),
(140, '堅果及種子類', '原味腰果', '樣品狀態:熟; 前處理描述:混合均勻打碎', NULL, 566.03, 16.376, 43.7356, 10.2735, 35.1692, 4.9515, 6.519, 9.972),
(141, '堅果及種子類', '原味榛果', '樣品狀態:熟; 前處理描述:混合均勻打碎', NULL, 671.636, 12.997, 66.4911, 5.7428, 17.2005, 7.9863, 2.452, 0.976),
(142, '堅果及種子類', '山粉圓', '樣品狀態:生; 前處理描述:混合均勻磨碎', NULL, 399.624, 16.333, 12.75, 1.3429, 58.0421, 57.8885, NULL, 4.9),
(143, '堅果及種子類', '亞麻仁籽', '樣品狀態:生; 前處理描述:混合均勻磨碎', NULL, 524.24, 20.83, 40.328, 4.3014, 28.1117, 23.1437, 1.311, 46.381),
(144, '堅果及種子類', '亞麻仁籽粉', '前處理描述:混合均勻', NULL, 557.096, 21.7325, 43.6424, 3.923, 28.5988, 24.4767, 0.988, 15.88),
(145, '堅果及種子類', '咖啡豆(曼特寧)', '樣品狀態:熟(純曼特寧咖啡豆烘焙而成); 前處理描述:混合均勻打碎', NULL, 437.432, 13.86, 14.87, 6.8236, 65.08, 48.41, NULL, 2.3),
(146, '堅果及種子類', '奇亞子', '樣品狀態:生; 前處理描述:混合均勻打碎', NULL, 483.317, 21.6785, 31.8405, 3.3464, 34.7882, 29.7495, 0.384, 0.475),
(147, '堅果及種子類', '白芝麻(生)', '樣品狀態:生; 前處理描述:混合均勻打碎', NULL, 598.038, 22.2645, 54.9223, 8.2153, 15.0075, 10.506, 0.9867, 38.8005),
(148, '堅果及種子類', '黑芝麻(生)', '樣品狀態:生; 前處理描述:混合均勻打碎', NULL, 550.927, 22.1585, 48.0768, 7.6257, 17.6005, 15.4903, 0.7315, 2.402),
(149, '堅果及種子類', '白芝麻(熟)', '樣品狀態:熟(烤); 前處理描述:混合均勻打碎', NULL, 625.61, 20.2885, 58.6937, 9.5084, 15.7107, 10.7188, 0.54, 24.4545),
(150, '堅果及種子類', '白芝麻(熟)2022年取樣)', '樣品狀態:熟(烤); 前處理描述:混合均勻打碎', NULL, 600.695, 21.734, 52.4471, 8.3637, 21.2028, 10.078, 0.944, 18.27),
(151, '堅果及種子類', '黑芝麻(熟)', '樣品狀態:熟(烤); 前處理描述:混合均勻打碎', NULL, 599.5, 17.26, 54.4333, 8.3816, 20.639, 13.9733, 0.1535, 1.9235),
(152, '堅果及種子類', '黑芝麻(熟)(2022年取樣)', '樣品狀態:熟(烤); 前處理描述:混合均勻打碎', NULL, 591.149, 20.689, 51.7701, 8.2617, 21.1407, 14.6575, 0.614, 0.84),
(153, '堅果及種子類', '黑芝麻粉', '前處理描述:混合均勻', NULL, 601.276, 15.719, 55.2097, 8.2344, 20.7926, 12.2778, 0, 2.671),
(154, '堅果及種子類', '帶殼花生(生)', '樣品狀態:生; 前處理描述:去殼,含膜,混合均勻打碎', '土豆,長生果,落花生', 330.763, 15.289, 27.2359, 7.2807, 12.2225, 8.0896, 1.7055, 0.908),
(155, '堅果及種子類', '冷凍帶殼花生(熟)', '樣品狀態:熟,冷凍包裝; 前處理描述:去殼,含膜,混合均勻打碎', '土豆,長生果,落花生', 343.542, 17.153, 27.444, 5.6274, 13.3451, NULL, NULL, 363.028),
(156, '堅果及種子類', '黑金剛花生(生)', '樣品狀態:生,黑仁花生; 前處理描述:去殼,混合均勻打碎', '花生,土豆,長壽果', 553.061, 27.632, 46.5733, 9.1013, 16.5502, 7.0642, 4.731, 22.59),
(157, '堅果及種子類', '帶膜花生仁(生)(1995年之前取樣)', '樣品狀態:生,帶膜; 前處理描述:混合均勻打碎', '土豆,長生果,落花生', 505.888, 28.785, 38.5, 8.0894, 20.5795, 13.4958, NULL, 31.59),
(158, '堅果及種子類', '去膜花生仁(生)', '樣品狀態:生,散裝; 前處理描述:混合均勻打碎', '土豆,長生果,落花生', 557.636, 28.8335, 45.3639, 10.0817, 19.1372, 6.6493, 4.5271, 1.8595),
(159, '堅果及種子類', '帶膜花生仁(生)(2004年取樣)', '樣品狀態:生,帶膜; 前處理描述:混合均勻打碎', '土豆,長生果,落花生', 516.497, 23.6283, 38.1004, 8.1798, 28.4046, 7.9415, 4.4034, 12.6617),
(160, '堅果及種子類', '紅土帶殼花生(熟)', '樣品狀態:熟; 前處理描述:去殼,含膜,混合均勻打碎', '土豆,長生果,落花生', 555.047, 31.246, 43.8941, 9.1218, 19.4667, 7.5099, 3.7545, 644.747),
(161, '堅果及種子類', '花生粉', '樣品狀態:散裝; 前處理描述:混合均勻', NULL, 515.765, 28.536, 33.7658, NULL, 32.9546, 4.9381, NULL, 10.9),
(162, '堅果及種子類', '芡實', '樣品狀態:生; 前處理描述:混合均勻打碎', '雞頭米,雞頭', 342.593, 9.944, 0.14, 0.0423, 75.4092, 3.1232, NULL, 0),
(163, '堅果及種子類', '愛玉子', '樣品狀態:生,天然野生; 前處理描述:混合均勻打碎', '愛玉,草子仔,草枳子,天拋藤,玉枳,枳子,天拋,風不動', 406.701, 12.22, 12.53, 1.1857, 63.74, 51.62, NULL, 6.4),
(164, '堅果及種子類', '原味葵瓜子(去殼)', '樣品狀態:熟; 前處理描述:混合均勻打碎', NULL, 586.369, 21.981, 51.8727, 5.0576, 18.6536, 8.3366, 3.032, 1.326),
(165, '堅果及種子類', '銀杏果', '樣品狀態:熟(去芯銀杏果,鹽等); 前處理描述:混合均勻打碎', '白果,銀杏核,公孫樹子,鴨腳樹子,靈眼', 142.069, 4.084, 1.2345, 0.1712, 28.8856, 3.1652, 1.2938, 13.98),
(166, '堅果及種子類', '蓮子', '樣品狀態:生(蓮子,蓮子心等); 前處理描述:混合均勻打碎', NULL, 140.913, 9.277, 0.5456, 0.1647, 25.591, 7.9699, 0, 118.737),
(167, '堅果及種子類', '蓮子(乾)', '樣品狀態:乾貨; 前處理描述:混合均勻打碎', NULL, 333.86, 21.7775, 1.2331, 0.3999, 60.9265, 13.065, 2.1795, 304.607),
(168, '水果類', '山竹', '前處理描述:去皮及籽,混合均勻打碎', '鳳果,都捻子,倒稔子,羅漢果,莽吉柿,果中之后', 69.4004, 0.5535, 0.287, NULL, 18.094, 1.6419, NULL, 3.1624),
(169, '水果類', '木瓜平均值', '前處理描述:去皮及籽,混合均勻打碎', '番木瓜,番瓜', 38.1568, 0.559, 0.0736, NULL, 9.9063, 1.3746, 6.182, 3.3746),
(170, '水果類', '木瓜(2月取樣)', '前處理描述:去皮及籽,混合均勻打碎', '番木瓜,番瓜', 31.152, 0.693, 0.1189, NULL, 7.7301, 1.5724, 6.182, 2.0296),
(171, '水果類', '木瓜(5月取樣)', '前處理描述:去皮及籽,混合均勻打碎', '番木瓜,番瓜', 43.8347, 0.675, 0.104, NULL, 11.3045, 1.4913, NULL, 3.6739),
(172, '水果類', '木瓜(8月取樣)', '前處理描述:去皮及籽,混合均勻打碎', '番木瓜,番瓜', 33.4413, 0.457, 0.021, NULL, 8.8139, 1.3615, NULL, 2.9287),
(173, '水果類', '木瓜(11月取樣)', '前處理描述:去皮及籽,混合均勻打碎', '番木瓜,番瓜', 44.199, 0.411, 0.0505, NULL, 11.7765, 1.0731, NULL, 4.8663),
(174, '水果類', '青木瓜', '前處理描述:去皮及籽,混合均勻打碎', '青番木瓜,青番瓜', 28.5757, 0.6203, 0.0691, NULL, 7.1981, 2.4009, 4.2576, 5.2903),
(175, '水果類', '安石榴', '前處理描述:去皮及籽,混合均勻打碎', '石榴, 榭榴, 謝榴, 樹榴', 67.2198, 1.7, 0.14, NULL, 16.76, 4.6, NULL, 8),
(176, '水果類', '百香果(台農一號)', '前處理描述:去皮,混合均勻打碎', '時計果,西番果', 102.208, 1.998, 2.24, 0.2999, 21.3183, 4.8747, 11.468, 2.08),
(177, '水果類', '百香果汁', '前處理描述:取內容物,混合均勻打碎,再去除粗籽', '時計果汁,西番果汁,西番蓮汁,美里瓜汁', 72.9366, 0.871, 0.3592, NULL, 18.6121, 0.1898, NULL, 0.9742),
(178, '水果類', '金黃奇異果', '樣品狀態:黃肉種; 前處理描述:去皮,混合均勻打碎', '彌猴桃,猴桃,猴梨,藤梨,毛桃,羊桃,紅藤梨,金桃,楊桃', 58.9366, 0.8385, 0.2661, 0.0931, 14.97, 1.42, 10.6077, 2.0379),
(179, '水果類', '奇異果', '樣品狀態:綠肉種; 前處理描述:去皮,混合均勻打碎', '彌猴桃,猴桃,猴梨,藤梨,毛桃,羊桃,紅藤梨,金桃,楊桃', 56.2826, 1.1497, 0.2582, 0.0525, 13.9607, 2.7494, 9.315, 2.9167),
(180, '水果類', '紅毛丹', '前處理描述:去皮及籽,混合均勻打碎', '韶子,毛龍眼,毛荔枝', 73.2833, 1.0315, 0.657, NULL, 17.8662, 1.5051, NULL, 8.1841),
(181, '水果類', '紅龍果(白肉)', '樣品狀態:白肉種; 前處理描述:去皮,混合均勻打碎', '火龍果,仙蜜果', 51.4985, 0.9307, 0.4393, 0.0491, 12.4151, 1.6795, 8.931, 0.0696),
(182, '水果類', '紅龍果(紅肉)', '樣品狀態:紅肉種; 前處理描述:去皮,混合均勻打碎', '火龍果,仙蜜果', 50.05, 1.119, 0.2498, 0.0679, 12.2776, 1.2759, 9.2187, 0.272),
(183, '水果類', '北蕉平均值', '前處理描述:去皮,混合均勻打碎', '香蕉,芎蕉,弓蕉,甘蕉', 84.9833, 1.451, 0.0722, 0.039, 22.0845, 1.6184, 18.014, 0.1778),
(184, '水果類', '北蕉(2月取樣)', '前處理描述:去皮,混合均勻打碎', '香蕉,芎蕉,弓蕉,甘蕉', 93.2203, 1.324, 0.0111, NULL, 24.633, 1.9614, NULL, 0.1743),
(185, '水果類', '北蕉(5月取樣)', '前處理描述:去皮,混合均勻打碎', '香蕉,芎蕉,弓蕉,甘蕉', 91.7847, 1.557, 0.1666, 0.0899, 23.6552, 1.8313, 18.014, 0.262),
(186, '水果類', '北蕉(9月取樣)', '前處理描述:去皮,混合均勻打碎', '香蕉,芎蕉,弓蕉,甘蕉', 64.6971, 1.33, 0.039, NULL, 16.6394, 1.1818, NULL, 0.1469),
(187, '水果類', '北蕉(11月取樣)', '前處理描述:去皮,混合均勻打碎', '香蕉,芎蕉,弓蕉,甘蕉', 90.231, 1.593, 0.0719, NULL, 23.4102, 1.4991, NULL, 0.128),
(188, '水果類', '北蕉(0天,綠皮)', '樣品狀態:綠皮北蕉; 前處理描述:購買當日即去皮,混合均勻打碎', '香蕉,芎蕉,弓蕉,甘蕉', 90.4728, 1.303, 0.2554, 0.0984, 23.3214, 1.9519, 9.165, 0.282),
(189, '水果類', '北蕉(1天)', '樣品狀態:綠皮北蕉; 前處理描述:帶皮室溫存放1天,去皮,混合均勻打碎', '香蕉,芎蕉,弓蕉,甘蕉', 87.1529, 1.432, 0.2886, 0.1237, 22.2016, 1.7198, 13.019, 0.301),
(190, '水果類', '北蕉(3天)', '樣品狀態:黃皮北蕉; 前處理描述:帶皮室溫存放3天,去皮,混合均勻打碎', '香蕉,芎蕉,弓蕉,甘蕉', 83.6957, 1.361, 0.2992, 0.1149, 21.2829, 1.7325, 11.887, 0.344),
(191, '水果類', '北蕉(7天)', '樣品狀態:黃皮斑點北蕉; 前處理描述:帶皮室溫存放7天,去皮,混合均勻打碎', '香蕉,芎蕉,弓蕉,甘蕉', 67.8757, 1.287, 0.2485, 0.0953, 17.0754, 1.6123, 10.846, 0.223),
(192, '水果類', '李林蕉(2007年取樣)', '前處理描述:去皮,混合均勻打碎', '香蕉,芎蕉,弓蕉,甘蕉(牛角蕉,佛手蕉,美人蕉,樹蕉)', 102.175, 1.418, 0.3465, 0.151, 26.253, 2.6162, 19.8249, 0),
(193, '水果類', '李林蕉(2012年取樣)', '前處理描述:去皮,混合均勻打碎', '香蕉,芎蕉,弓蕉,甘蕉(牛角蕉,佛手蕉,美人蕉,樹蕉)', 110.623, 1.474, 0.087, NULL, 29.1507, 3.2781, 18.918, 0.628),
(194, '水果類', '南華蕉', '前處理描述:去皮,混合均勻打碎', '香蕉,芎蕉,弓蕉,甘蕉(芭蕉)', 124.085, 1.142, 0.1, 0, 33.1697, 2.9011, 19.4063, 0.231),
(195, '水果類', '紅皮蕉(2004年取樣)', '前處理描述:去皮,混合均勻打碎', '香蕉,芎蕉,弓蕉,甘蕉,蘋果蕉', 92.9853, 1.287, 0.2912, 0.1251, 23.951, 2.1378, 19.3878, 0.316),
(196, '水果類', '紅皮蕉(2012年取樣)', '前處理描述:去皮,混合均勻打碎', '香蕉,芎蕉,弓蕉,甘蕉,蘋果蕉', 97.7854, 1.281, 0.2216, 0.1162, 25.4518, 2.7484, 18.237, 0.651),
(197, '水果類', '蛋蕉(2023年取樣)', '前處理描述:去皮,混合均勻打碎', '旦蕉, 一口蕉', 87.4042, 1.068, 0.01, 0.0077, 23.2589, 1.0698, 18.311, 3.381),
(198, '水果類', '酪梨(綠皮)', '樣品狀態:綠皮; 前處理描述:去皮及籽,混合均勻打碎', '牛油果(梨),黃油果(梨),油梨,鰐(鱷)梨,幸福果,樂天果', 64.9787, 1.6293, 3.6922, 1.0824, 7.9446, 3.3947, 0.9083, 2.0583),
(199, '水果類', '酪梨(室溫存放0天)', '樣品狀態:綠皮; 前處理描述:室溫存放0天,去皮及籽,混合均勻打碎', '牛油果(梨),黃油果(梨),油梨,鰐(鱷)梨,幸福果,樂天果', 80.0423, 1.455, 5.9116, 1.6761, 7.1315, 4.2357, 0.3221, 0.408),
(200, '水果類', '酪梨(室溫存放3天)', '樣品狀態:綠皮轉紅; 前處理描述:室溫存放3天,去皮及籽,混合均勻打碎', '牛油果(梨),黃油果(梨),油梨,鰐(鱷)梨,幸福果,樂天果', 84.4824, 1.365, 6.8229, 2.002, 6.3301, 2.9079, 0.3303, 0.309),
(201, '水果類', '酪梨(室溫存放6天)', '樣品狀態:紅皮; 前處理描述:室溫存放6天,去皮及籽,混合均勻打碎', '牛油果(梨),黃油果(梨),油梨,鰐(鱷)梨,幸福果,樂天果', 92.2151, 1.517, 7.5884, 2.1993, 6.5564, 5.7391, 0.8766, 0.548),
(202, '水果類', '榴槤', '前處理描述:去皮及籽,混合均勻打碎', '榴蓮,流連,山韶子', 131.727, 2.7187, 1.8612, 0.7055, 29.7262, 3.1876, 18.391, 1.7409),
(203, '水果類', '開英種1號鳳梨', '樣品狀態:開英種; 前處理描述:去皮,混合均勻打碎', '旺來,波羅,黃萊,黃梨,王萊(開英種1號,1號仔,突目仔)', 56.1664, 0.624, 0.2061, NULL, 14.5402, 0.9735, NULL, 0.0265),
(204, '水果類', '鳳梨平均值(雜交種)', '樣品狀態:雜交種; 前處理描述:去皮,混合均勻打碎', '鳳梨,旺來,波羅,黃萊,黃梨,王萊', 52.6628, 0.7379, 0.1454, 0.0542, 13.6018, 1.0525, 11.5986, 0.339),
(205, '水果類', '甘蔗鳳梨', '樣品狀態:雜交種; 前處理描述:去皮,混合均勻打碎', '旺來,波羅,黃萊,黃梨,王萊(台農13號,冬蜜鳳梨)', 57.4048, 0.693, 0.0732, NULL, 15.1288, 1.4499, NULL, 0.0633),
(206, '水果類', '甜蜜蜜鳳梨', '樣品狀態:雜交種; 前處理描述:去皮,混合均勻打碎', '旺來,波羅,黃萊,黃梨,王萊(台農16號)', 42.3321, 0.978, 0.093, NULL, 10.6299, 0.9354, NULL, 0.4058),
(207, '水果類', '金鑽鳳梨', '樣品狀態:雜交種; 前處理描述:去皮,混合均勻打碎', '旺來,波羅,黃萊,黃梨,王萊(台農17號,春蜜鳳梨)', 50.4379, 0.501, 0.1262, 0.0536, 13.2495, 1.0816, 9.4739, 0.5375),
(208, '水果類', '牛奶鳳梨', '樣品狀態:雜交種; 前處理描述:去皮,混合均勻打碎', '旺來,波羅,黃萊,黃梨,王萊(台農20號)', 60.4765, 0.7795, 0.2892, 0.0927, 15.3991, 0.743, 13.7233, 0.3495),
(209, '水果類', '釋迦', '前處理描述:去皮及籽,混合均勻打碎', '番荔枝,釋迦果,佛頭果,番梨', 104.199, 2.2, 0.144, 0.0552, 26.556, 2.7, 15.976, 7),
(210, '水果類', '鳳梨釋迦', '前處理描述:去皮及籽,混合均勻打碎', '旺來釋迦,奇美釋迦,蜜釋迦', 102.175, 1.5105, 0.415, 0.1524, 26.0073, 1.7216, 19.599, 2.3035),
(211, '水果類', '桑葚', '樣品狀態:橢圓型果; 前處理描述:去蒂頭,混合均勻打碎', '桑果,桑葚兒', 31.9989, 1.137, 0.3676, 0.1598, 6.9727, 1.2778, 3.7935, 0.786),
(212, '水果類', '桑葚汁', '樣品狀態:橢圓型果; 前處理描述:混合均勻打碎,再以砂布濾取果汁', '桑果,桑葚兒', 25.1552, 0.815, 0.155, 0, 5.8665, 0.3863, 3.7649, 0.48),
(213, '水果類', '草莓', '前處理描述:去蒂,混合均勻打碎', NULL, 38.6848, 0.963, 0.2439, 0.0866, 9.2799, 1.7605, 6.084, 6.7619),
(214, '水果類', '土芭樂', '前處理描述:去蒂及籽,混合均勻打碎', '番石榴,芭樂,拔仔,扒仔,朳仔,那拔仔,藍拔', 39.1794, 0.74, 0.1, NULL, 9.96, 5, NULL, 5),
(215, '水果類', '芭樂平均值(白肉)', '前處理描述:去蒂及籽,混合均勻打碎', '番石榴,芭樂,拔仔,扒仔,朳仔,那拔仔,藍拔', 39.9848, 0.6901, 0.0982, 0.0607, 10.2344, 3.4795, 5.5305, 1.4848),
(216, '水果類', '番石榴(珍珠拔)(有機)', '前處理描述:去蒂及籽,混合均勻打碎', '牛乳芭樂,牛奶芭樂,芭樂,拔仔,扒仔,朳仔,那拔仔,藍拔', 39.8257, 0.576, 0.06, 0.0508, 10.3856, 3.7968, 5.876, 0),
(217, '水果類', '世紀芭樂', '樣品狀態:橢圓形; 前處理描述:去蒂及籽,混合均勻打碎', '番石榴,芭樂,拔仔,扒仔,朳仔,那拔仔,藍拔', 39.7046, 0.662, 0.068, NULL, 10.2531, 3.4427, NULL, 0.4396),
(218, '水果類', '珍珠芭樂', '樣品狀態:梨形,白黃肉; 前處理描述:去蒂及籽,混合均勻打碎', '番石榴,芭樂,拔仔,扒仔,朳仔,那拔仔,藍拔', 41.9639, 0.7225, 0.1649, 0.0644, 10.5989, 3.6784, 5.185, 0.4996),
(219, '水果類', '泰國芭樂', '樣品狀態:圓形,黃綠皮白肉; 前處理描述:去蒂及籽,混合均勻打碎', '番石榴,芭樂,拔仔,扒仔,朳仔,那拔仔,藍拔', 38.445, 0.8, 0.1, NULL, 9.7, 3, NULL, 5),
(220, '水果類', '無子芭樂', '樣品狀態:圓形,黃綠皮白肉; 前處理描述:去蒂及籽,混合均勻打碎', '番石榴,芭樂,拔仔,扒仔,朳仔,那拔仔,藍拔', 33.4051, 0.74, 0.0016, NULL, 8.5848, 2.9429, NULL, 0.1583),
(221, '水果類', '紅心芭樂', '樣品狀態:梨形,綠皮紅肉; 前處理描述:去蒂及籽,混合均勻打碎', '番石榴,芭樂,拔仔,扒仔,朳仔,那拔仔,藍拔', 42.0341, 0.757, 0.1089, 0.0327, 10.7164, 3.9322, 5.31, 1.182),
(222, '水果類', '楊桃平均值', '前處理描述:去陵線及籽,混合均勻打碎', '羊桃,洋桃,陽桃,五稜子,五斂子', 32.0281, 0.5262, 0.0706, NULL, 8.2414, 1.2545, 6.336, 0.3201),
(223, '水果類', '楊桃(2月取樣)', '前處理描述:去陵線及籽,混合均勻打碎', '羊桃,洋桃,陽桃,五稜子,五斂子', 29.3672, 0.438, 0.0734, NULL, 7.5781, 1.4723, NULL, 0.0877),
(224, '水果類', '楊桃(4月取樣)', '前處理描述:去陵線及籽,混合均勻打碎', '羊桃,洋桃,陽桃,五稜子,五斂子', 32.095, 0.651, 0.0722, NULL, 8.1398, 1.497, 6.336, 0.435),
(225, '水果類', '楊桃(5月取樣)', '前處理描述:去陵線及籽,混合均勻打碎', '羊桃,洋桃,陽桃,五稜子,五斂子', 34.4451, 0.636, 0.127, NULL, 8.6792, 0.9377, NULL, 0.3473),
(226, '水果類', '楊桃(9月取樣)', '前處理描述:去陵線及籽,混合均勻打碎', '羊桃,洋桃,陽桃,五稜子,五斂子', 33.4224, 0.468, 0.036, NULL, 8.7635, 1.3721, NULL, 0.4848),
(227, '水果類', '楊桃(11月取樣)', '前處理描述:去陵線及籽,混合均勻打碎', '羊桃,洋桃,陽桃,五稜子,五斂子', 30.8111, 0.438, 0.0444, NULL, 8.0466, 0.9933, NULL, 0.2457),
(228, '水果類', '美國紅葡萄', '樣品狀態:有籽種,紅皮; 前處理描述:去皮及籽,混合均勻打碎', '蒲桃,蒲萄,草龍珠,蒲陶,葡桃', 68.6178, 0.443, 0.4035, NULL, 17.7089, 0.5, NULL, 7.9209),
(229, '水果類', '巨峰葡萄', '樣品狀態:有籽種,黑皮; 前處理描述:去皮及籽,混合均勻打碎', '蒲桃,蒲萄,草龍珠,蒲陶,葡桃', 63.5451, 0.52, 0.2633, 0.1083, 16.5539, 0.2401, 15.568, 0.9866),
(230, '水果類', '綠葡萄平均值', '樣品狀態:有籽種,綠皮; 前處理描述:去皮及籽,混合均勻打碎', '葡萄,蒲桃,蒲萄,草龍珠,蒲陶,葡桃', 57.9343, 0.5188, 0.1533, NULL, 15.2524, 0.3709, NULL, 3.6363),
(231, '水果類', '美國綠葡萄', '樣品狀態:有籽種,綠皮; 前處理描述:去皮及籽,混合均勻打碎', '蒲桃,蒲萄,草龍珠,蒲陶,葡桃(青葡萄,白葡萄)', 63.9579, 0.5385, 0.1935, NULL, 16.8136, 0.3857, NULL, 7.0882),
(232, '水果類', '意大利葡萄', '樣品狀態:有籽種,綠皮; 前處理描述:去皮及籽,混合均勻打碎', '蒲桃,蒲萄,草龍珠,蒲陶,葡桃', 51.9108, 0.499, 0.113, NULL, 13.6912, 0.356, NULL, 0.1844),
(233, '水果類', '美國紅葡萄(含皮)', '樣品狀態:有籽種,紅皮; 前處理描述:去籽,含皮,混合均勻打碎', '蒲桃,蒲萄,草龍珠,蒲陶,葡桃', 61.3069, 0.4385, 0.145, NULL, 16.2833, 0.8013, NULL, 1.1939),
(234, '水果類', '美國紫葡萄(含皮)', '樣品狀態:有籽種,紫皮; 前處理描述:去籽,含皮,混合均勻打碎', '蒲桃,蒲萄,草龍珠,蒲陶,葡桃', 80.4128, 0.444, 0, NULL, 21.9225, 0.7408, NULL, 0.6748),
(235, '水果類', '美國黑葡萄(含皮)', '樣品狀態:有籽種,黑皮; 前處理描述:去籽,含皮,混合均勻打碎', '蒲桃,蒲萄,草龍珠,蒲陶,葡桃', 62.6744, 0.592, 0.177, NULL, 16.4455, 0.8224, NULL, 0.3481),
(236, '水果類', '美國綠葡萄(含皮)', '樣品狀態:有籽種,綠皮; 前處理描述:去籽,含皮,混合均勻打碎', '蒲桃,蒲萄,草龍珠,蒲陶,葡桃(青葡萄,白葡萄)', 86.9466, 0.581, 0.395, NULL, 22.6912, 0.8334, NULL, 0.9027),
(237, '水果類', '無子紅葡萄(含皮)', '樣品狀態:無籽種,紅皮; 前處理描述:含皮,混合均勻打碎', '蒲桃,蒲萄,草龍珠,蒲陶,葡桃', 71.6646, 0.46, 0.108, NULL, 19.2264, 0.6281, NULL, 3.1072),
(238, '水果類', '黑美人葡萄(含皮)', '樣品狀態:無籽種,黑皮; 前處理描述:含皮,混合均勻打碎', '蒲桃,蒲萄,草龍珠,蒲陶,葡桃', 65.5083, 0.5135, 0.1409, NULL, 17.3899, 0.5247, NULL, 0.2129),
(239, '水果類', '金香葡萄(含皮)', '樣品狀態:無籽種,綠皮; 前處理描述:含皮,混合均勻打碎', '蒲桃,蒲萄,草龍珠,蒲陶,葡桃', 60.1749, 0.63, 0.062, NULL, 15.9831, 0.5416, NULL, 0.2428),
(240, '水果類', '葡萄乾', '樣品狀態:果乾(紅葡萄,無加糖); 前處理描述:混合均勻打碎', NULL, 306.105, 3.19, 1.4504, 0.2301, 78.6796, 5.91, 43.544, 14),
(241, '水果類', '蓮霧平均值(粉紅色種)', '樣品狀態:粉紅色種; 前處理描述:去蒂及籽,混合均勻打碎', '璉霧,輦霧,洋蒲桃', 39.4115, 0.3857, 0.2669, 0.0873, 9.9671, 0.7957, 7.7735, 1.8747),
(242, '水果類', '蓮霧(紅寶石)', '樣品狀態:粉紅色種; 前處理描述:去蒂及籽,混合均勻打碎', '璉霧,輦霧,洋蒲桃,水蓊', 32.9007, 0.339, 0.3295, 0.0781, 8.0566, 0.6712, 7.49, 2.113),
(243, '水果類', '蓮霧(黑金剛)', '樣品狀態:粉紅色種; 前處理描述:去蒂及籽,混合均勻打碎', '璉霧,輦霧,洋蒲桃,水蓊', 33.8464, 0.473, 0.0613, 0, 8.8178, 0.9232, NULL, 0.741),
(244, '水果類', '蓮霧(黑珍珠)', '樣品狀態:粉紅色種; 前處理描述:去蒂及籽,混合均勻打碎', '璉霧,輦霧,洋蒲桃,水蓊', 51.4874, 0.345, 0.41, 0.3049, 13.0268, 0.7927, 8.057, 2.77),
(245, '水果類', '華寶大西瓜(花蓮)', '樣品狀態:紅肉大瓜,長球型,淡綠色皮; 前處理描述:去皮及籽,混合均勻打碎', '水瓜,寒瓜,夏瓜', 33.1023, 0.654, 0.059, NULL, 8.4475, 0.6905, 7.7963, 1.44),
(246, '水果類', '西瓜平均值(紅肉小瓜)', '樣品狀態:紅肉小瓜; 前處理描述:去皮及籽,混合均勻打碎', '水瓜,寒瓜,夏瓜', 32.5907, 0.7784, 0.1213, 0.0412, 8.0445, 0.3389, 7.4652, 1.4365),
(247, '水果類', '皇宮西瓜', '樣品狀態:紅肉小瓜,圓球型,淡綠色皮; 前處理描述:去皮及籽,混合均勻打碎', '水瓜,寒瓜,夏瓜', 32.3959, 0.69, 0.1134, 0.0487, 8.0912, 0.2546, 7.7028, 0.9055),
(248, '水果類', '紅鈴西瓜', '樣品狀態:紅肉小瓜,長球型,深綠色,鮮紅肉色; 前處理描述:去皮及籽,混合均勻打碎', '水瓜,寒瓜,夏瓜', 34.0299, 0.8387, 0.0688, NULL, 8.51, 0.3219, 7.6921, 2.2113),
(249, '水果類', '黑美人西瓜', '樣品狀態:紅肉小瓜; 前處理描述:去皮及籽,混合均勻打碎', '水瓜,寒瓜,夏瓜', 36.465, 0.912, 0.0839, NULL, 9.0829, 0.2964, 8.907, 1.6611),
(250, '水果類', '鳳光西瓜', '樣品狀態:紅肉小瓜,長球型,深淺綠色條紋相間,鮮紅肉色; 前處理描述:去皮及籽,混合均勻打碎', '水瓜,寒瓜,夏瓜', 27.4719, 0.673, 0.2189, 0.0547, 6.494, 0.4825, 5.559, 0.968),
(251, '水果類', '無籽西瓜', '前處理描述:去皮,混合均勻打碎', '水瓜,寒瓜,夏瓜', 32.8436, 0.875, 0.0451, NULL, 8.2017, 0.5683, 7.3471, 0.61),
(252, '水果類', '西瓜平均值(黃肉小瓜)', '樣品狀態:黃肉小瓜種; 前處理描述:去皮及籽,混合均勻打碎', '水瓜,寒瓜,夏瓜', 29.0044, 0.679, 0.038, 0.0126, 7.3347, 0.2516, 7.86, 1.5732),
(253, '水果類', '小玉西瓜', '樣品狀態:黃肉小瓜; 前處理描述:去皮及籽,混合均勻打碎', '水瓜,寒瓜,夏瓜', 34.368, 0.791, 0.06, 0.0199, 8.6689, 0.296, 7.86, 2.4225),
(254, '水果類', '金蘭西瓜', '樣品狀態:黃肉小瓜,圓球型,綠底綠條紋,深黃肉色; 前處理描述:去皮及籽,混合均勻打碎', '水瓜,寒瓜,夏瓜', 23.6408, 0.567, 0.016, NULL, 6.0005, 0.2072, NULL, 0.7238),
(255, '水果類', '嘉寶瓜', '樣品狀態:橙肉西瓜,橢圓形; 前處理描述:去皮,混合均勻打碎', '水瓜,寒瓜,夏瓜(嘉寶兵瓜)', 40.2228, 0.78, 0.2, NULL, 9.98, 0.38, NULL, 9),
(256, '水果類', '甜瓜平均值(光皮洋香瓜)', '樣品狀態:光皮洋香瓜種; 前處理描述:去皮及籽,混合均勻打碎', '甜瓜,甘瓜,果瓜,香瓜,梨仔瓜,澎湖瓜,洋香瓜', 29.5857, 0.8727, 0.0922, 0.0586, 7.1894, 0.573, 6.0484, 13.0543),
(257, '水果類', '太陽洋香瓜', '樣品狀態:光皮洋香瓜種,橢圓形,黃皮白肉系; 前處理描述:去皮及籽,混合均勻打碎', '甜瓜,甘瓜,果瓜,香瓜,梨仔瓜,澎湖瓜,洋香瓜', 32.3771, 1.163, 0.0347, NULL, 7.8275, 0.096, NULL, 3.1355),
(258, '水果類', '狀元瓜', '樣品狀態:光皮洋香瓜種,橄欖形,黃皮白肉系; 前處理描述:去皮及籽,混合均勻打碎', '甜瓜,甘瓜,果瓜,香瓜,梨仔瓜,澎湖瓜,洋香瓜', 27.3527, 0.7327, 0.1161, NULL, 6.6442, 0.7588, 5.4818, 17.502),
(259, '水果類', '蜜世界洋香瓜', '樣品狀態:光皮洋香瓜種,長球形,白綠皮綠肉系; 前處理描述:去皮及籽,混合均勻打碎', '甜瓜,甘瓜,果瓜,香瓜,梨仔瓜,澎湖瓜,洋香瓜', 29.0271, 0.7225, 0.1257, 0.0799, 7.0965, 0.8642, 6.615, 18.5255),
(260, '水果類', '甜瓜平均值(東洋系脆瓜)', '樣品狀態:東洋系脆瓜種; 前處理描述:去皮及籽,混合均勻打碎', '甜瓜,甘瓜,果瓜,香瓜,梨仔瓜,澎湖瓜', 36.7097, 0.9829, 0.1572, 0.0765, 8.9142, 0.5489, 8.4644, 9.3425),
(261, '水果類', '美濃瓜', '樣品狀態:東洋系脆瓜種,扁圓形,白綠皮肉系; 前處理描述:去皮及籽,混合均勻打碎', '甜瓜,甘瓜,果瓜,香瓜,梨仔瓜,澎湖瓜', 36.8136, 1.0678, 0.187, 0.091, 8.7946, 0.4556, 8.0082, 8.3475),
(262, '水果類', '黃香瓜', '樣品狀態:東洋系脆瓜種,橢圓形,黃皮白肉系; 前處理描述:去皮及籽,混合均勻打碎', '甜瓜,甘瓜,果瓜,香瓜,梨仔瓜,澎湖瓜', 30.4992, 0.6, 0.16, NULL, 7.54, 0.6, NULL, 16),
(263, '水果類', '嘉玉甜瓜', '樣品狀態:東洋系脆瓜種,扁圓形,白綠皮肉系; 前處理描述:去皮及籽,混合均勻打碎', '甜瓜,甘瓜,果瓜,香瓜,梨仔瓜,澎湖瓜', 42.8162, 1.281, 0.1246, NULL, 10.4081, 0.5912, 8.9205, 3.68),
(264, '水果類', '洋香瓜(新世紀)', '樣品狀態:哈蜜瓜種,橢圓形,綠皮橙肉系; 前處理描述:去皮及籽,混合均勻打碎', '網仔瓜,哈密瓜', 38.9086, 0.674, 0.043, 0.0144, 10.0789, 0.4892, 7.547, 9.313),
(265, '水果類', '新疆哈密瓜', '樣品狀態:哈蜜瓜種; 前處理描述:去皮及籽,混合均勻打碎', '網仔瓜,哈密瓜', 27.7775, 0.7, 0.085, NULL, 6.865, 0.65, NULL, 29),
(266, '水果類', '洋香瓜(卡蜜拉)', '前處理描述:去皮及籽,混合均勻打碎', '網仔瓜,哈密瓜', 37.6079, 0.567, 0.19, 0.1254, 9.4757, 0.6319, 8.487, 11.78),
(267, '水果類', '甜瓜平均值(網紋洋香瓜)', '樣品狀態:網紋洋香瓜種; 前處理描述:去皮及籽,混合均勻打碎', '甜瓜,甘瓜,果瓜,香瓜,梨仔瓜,澎湖瓜,洋香瓜,網仔瓜,哈蜜瓜', 36.9446, 0.9182, 0.039, 0.0133, 9.3148, 0.6009, 6.8388, 13.2864),
(268, '水果類', '七股香洋香瓜', '樣品狀態:網紋洋香瓜種,球形,綠皮橙肉系; 前處理描述:去皮及籽,混合均勻打碎', '甜瓜,甘瓜,果瓜,香瓜,梨仔瓜,澎湖瓜,洋香瓜,網仔瓜,哈蜜瓜', 40.2804, 0.588, 0.0711, NULL, 10.4749, 0.6027, 7.879, 8.725),
(269, '水果類', '天香洋香瓜', '樣品狀態:網紋洋香瓜種,綠肉系; 前處理描述:去皮及籽,混合均勻打碎', '甜瓜,甘瓜,果瓜,香瓜,梨仔瓜,澎湖瓜,洋香瓜,網仔瓜,哈蜜瓜', 44.4526, 0.811, 0.0062, 0.0018, 11.5766, 0.5081, 4.253, 8.543),
(270, '水果類', '秋香洋香瓜', '樣品狀態:網紋洋香瓜種,球形,黃皮橙肉系; 前處理描述:去皮及籽,混合均勻打碎', '甜瓜,甘瓜,果瓜,香瓜,梨仔瓜,澎湖瓜,洋香瓜,網仔瓜,哈蜜瓜', 34.0753, 1.04, 0.0443, NULL, 8.3917, 0.4893, NULL, 16.0924),
(271, '水果類', '紅寶石洋香瓜', '樣品狀態:網紋洋香瓜種,球形,綠皮橙肉系; 前處理描述:去皮及籽,混合均勻打碎', '甜瓜,甘瓜,果瓜,香瓜,梨仔瓜,澎湖瓜,洋香瓜,網仔瓜,哈蜜瓜', 38.8355, 1.232, 0.0279, 0.0109, 9.5729, 0.6451, 8.839, 13.706),
(272, '水果類', '香華洋香瓜', '樣品狀態:網紋洋香瓜種,球形,綠皮綠肉系; 前處理描述:去皮及籽,混合均勻打碎', '甜瓜,甘瓜,果瓜,香瓜,梨仔瓜,澎湖瓜,洋香瓜,網仔瓜,哈蜜瓜', 30.4513, 0.743, 0.0413, NULL, 7.6692, 0.3997, 6.384, 20.447),
(273, '水果類', '藍寶石洋香瓜', '樣品狀態:網紋洋香瓜種,球形,綠皮綠肉系; 前處理描述:去皮及籽,混合均勻打碎', '甜瓜,甘瓜,果瓜,香瓜,梨仔瓜,澎湖瓜,洋香瓜,網仔瓜,哈蜜瓜', 33.5724, 1.095, 0.043, NULL, 8.2037, 0.9605, NULL, 12.205),
(274, '水果類', '土芒果', '樣品狀態:本地種; 前處理描述:去皮及籽,混合均勻打碎', '檬果,檨仔,菴羅果(柴檨,土檨仔)', 54.3278, 0.6487, 0.2846, 0.1579, 13.8239, 1.0096, 10.552, 1.5493),
(275, '水果類', '芒果平均值(西洋種)', '樣品狀態:西洋種; 前處理描述:去皮及籽,混合均勻打碎', '檬果,檨仔,菴羅果', 50.3479, 0.5779, 0.213, 0.0631, 12.9509, 1.2115, 9.8494, 4.7542),
(276, '水果類', '肯特芒果', '樣品狀態:西洋種; 前處理描述:去皮及籽,混合均勻打碎', '檬果,檨仔,菴羅果', 49.3645, 0.538, 0.2355, 0.069, 12.6627, 1.1618, 8.7561, 17.3543),
(277, '水果類', '海頓芒果', '樣品狀態:西洋種; 前處理描述:去皮及籽,混合均勻打碎', '檬果,檨仔,菴羅果', 59.9496, 0.38, 0.24, NULL, 15.74, 1.74, NULL, 4),
(278, '水果類', '凱特芒果', '樣品狀態:西洋種; 前處理描述:去皮及籽,混合均勻打碎', '檬果,檨仔,菴羅果', 50.1086, 1.145, 0.1603, NULL, 12.4777, 1.0201, 11.3129, 0.566),
(279, '水果類', '愛文芒果', '樣品狀態:西洋種; 前處理描述:去皮及籽,混合均勻打碎', '檬果,檨仔,菴羅果(蘋果芒果)', 42.3591, 0.3567, 0.1837, 0.0577, 11.0064, 0.8852, 8.75, 1.4656),
(280, '水果類', '聖心芒果', '樣品狀態:西洋種; 前處理描述:去皮及籽,混合均勻打碎', '檬果,檨仔,菴羅果', 49.9574, 0.47, 0.2455, 0.069, 12.8676, 1.2505, 10.5787, 0.385),
(281, '水果類', '黑香芒果', '樣品狀態:南洋種; 前處理描述:去皮及籽,混合均勻打碎', '檬果,檨仔,菴羅果', 65.9523, 0.813, 0.2969, 0.1122, 16.871, 1.3039, 16.6206, 0.169),
(282, '水果類', '芒果平均值(新興種)', '樣品狀態:新興種; 前處理描述:去皮及籽,混合均勻打碎', '檬果,檨仔,菴羅果', 55.8473, 0.5786, 0.239, 0.0901, 14.4176, 1.1184, 12.1157, 1.4266),
(283, '水果類', '四季芒果', '樣品狀態:新興種; 前處理描述:去皮及籽,混合均勻打碎', '檬果,檨仔,菴羅果(四季檨)', 60.0964, 0.577, 0.2182, NULL, 15.6476, 1.7928, 13.189, 0.2817),
(284, '水果類', '玉文芒果', '樣品狀態:新興種; 前處理描述:去皮及籽,混合均勻打碎', '檬果,檨仔,菴羅果', 61.9019, 0.519, 0.275, 0.1097, 16.0712, 0.744, 9.2387, 0),
(285, '水果類', '金煌芒果', '樣品狀態:新興種; 前處理描述:去皮及籽,混合均勻打碎', '檬果,檨仔,菴羅果', 51.637, 0.8265, 0.2425, NULL, 13.0084, 1.377, NULL, 7.6948),
(286, '水果類', '金蜜芒果', '樣品狀態:新興種; 前處理描述:去皮及籽,混合均勻打碎', '檬果,檨仔,菴羅果', 63.8271, 0.583, 0.3804, 0.1277, 16.3012, 1.1435, 15.0387, 0.836),
(287, '水果類', '金興芒果', '樣品狀態:新興種; 前處理描述:去皮及籽,混合均勻打碎', '檬果,檨仔,菴羅果', 40.9565, 0.552, 0.1111, 0.0393, 10.6033, 0.6144, 9.1786, 0.403),
(288, '水果類', '香水芒果', '樣品狀態:新興種; 前處理描述:去皮及籽,混合均勻打碎', '檬果,檨仔,菴羅果', 65.2215, 0.5715, 0.2138, 0.0935, 17.0866, 1.3748, 15.5623, 0.3697),
(289, '水果類', '蓮花芒果', '樣品狀態:新興種; 前處理描述:去皮及籽,混合均勻打碎', '檬果,檨仔,菴羅果', 47.2908, 0.421, 0.2317, 0.0832, 12.2047, 0.7825, 10.4872, 0.401),
(290, '水果類', '芒果乾', '樣品狀態:果乾(無加糖); 前處理描述:混合均勻打碎', NULL, 333.918, 0.55, 0.9749, 0.3465, 89.9751, 3.44, 56.589, 219),
(291, '水果類', '荔枝平均值', '前處理描述:去殼及籽,混合均勻打碎', '丹荔,荔錦,麗枝,離枝', 64.9699, 1.0357, 0.236, 0.0865, 16.5319, 0.8288, 14.0801, 1.244),
(292, '水果類', '玉荷苞荔枝', '前處理描述:去殼及籽,混合均勻打碎', '丹荔,荔錦,麗枝,離枝', 68.2581, 1.168, 0.2426, 0.0889, 17.3064, 0.7537, 14.394, 0.2381),
(293, '水果類', '黑葉仔荔枝', '前處理描述:去殼及籽,混合均勻打碎', '丹荔,荔錦,麗枝,離枝', 61.6818, 0.9033, 0.2294, NULL, 15.7574, 0.9039, 13.7661, 2.2498),
(294, '水果類', '冷凍荔枝', '樣品狀態:果肉,冷凍包裝; 前處理描述:混合均勻打碎', '丹荔,荔錦,麗枝,離枝', 28.1127, 0.4, 0.11, NULL, 7.18, 0.62, NULL, 9),
(295, '水果類', '龍眼', '前處理描述:去殼及籽,混合均勻打碎', '桂圓,龍目,圓眼', 71.8698, 1.1275, 0.3794, 0.2183, 18.0294, 1.8, 15.159, 2.5862),
(296, '水果類', '龍眼乾', '樣品狀態:果乾; 前處理描述:混合均勻打碎', '桂圓乾,龍目乾,圓眼乾', 276.091, 5.065, 0.4547, 0.2515, 70.9074, 2.855, 51.408, 4.8081),
(297, '水果類', '帶殼龍眼乾', '樣品狀態:果乾; 前處理描述:去殼及籽,混合均勻打碎', '桂圓乾,龍目乾,圓眼乾', 278.491, 4.604, 0.071, 0, 72.8965, 3.0869, NULL, 0.4082),
(298, '水果類', '李子平均值(青皮黃肉)', '樣品狀態:青皮黃肉; 前處理描述:去籽,混合均勻打碎', '李子', 47.5354, 0.667, 0.3753, NULL, 11.7093, 1.5136, NULL, 0.2939),
(299, '水果類', '加州青李', '樣品狀態:青皮黃肉; 前處理描述:去籽,混合均勻打碎', '李子', 47.176, 0.649, 0.22, NULL, 11.9872, 1.7611, NULL, 0.4595),
(300, '水果類', '翡翠李', '樣品狀態:青皮黃肉; 前處理描述:去籽,混合均勻打碎', '李子', 47.8949, 0.685, 0.5305, NULL, 11.4314, 1.2661, NULL, 0.1282),
(301, '水果類', '李子平均值(紅皮紅肉)', '樣品狀態:紅皮紅肉; 前處理描述:去籽,混合均勻打碎', '李子', 39.4575, 0.6053, 0.3384, 0.1105, 9.6089, 1.6598, 5.6884, 0.2462),
(302, '水果類', '紅肉李(大)', '樣品狀態:紅皮紅肉; 前處理描述:去籽,混合均勻打碎', '李子', 40.5805, 0.5315, 0.3323, NULL, 10.0037, 1.5101, 5.8854, 0.0003),
(303, '水果類', '紅肉李(小)', '樣品狀態:紅皮紅肉; 前處理描述:去籽,混合均勻打碎', '李子', 38.3345, 0.679, 0.3444, 0.1125, 9.214, 1.8094, 5.4914, 0.492),
(304, '水果類', '李子平均值(紅皮黃肉)', '樣品狀態:紅皮黃肉; 前處理描述:去籽,混合均勻打碎', '李子', 47.6233, 0.7072, 0.2937, 0.1035, 11.8859, 1.4819, 5.4026, 0.6912),
(305, '水果類', '加州紅李(台灣)', '樣品狀態:紅皮黃肉; 前處理描述:去籽,混合均勻打碎', '李子', 44.6365, 0.348, 0.6404, NULL, 10.5853, 1.6564, NULL, 0.0304),
(306, '水果類', '加州紅李(進口)', '樣品狀態:紅皮黃肉; 前處理描述:去籽,混合均勻打碎', '李子', 60.0724, 0.818, 0.2653, NULL, 15.3065, 1.5236, NULL, 3.5),
(307, '水果類', '加州蜜李(進口)', '樣品狀態:紅皮黃肉; 前處理描述:去籽,混合均勻打碎', '李子', 66.2079, 1.254, 0.0513, NULL, 17.1014, 2.0852, NULL, 0.0521),
(308, '水果類', '香水李', '樣品狀態:紅皮黃肉; 前處理描述:去籽,混合均勻打碎', '李子', 36.1779, 0.709, 0.271, 0.0885, 8.7576, 0.6216, 5.8479, 0.264),
(309, '水果類', '桃接李(大)', '樣品狀態:紅皮黃肉; 前處理描述:去籽,混合均勻打碎', '李子', 37.5626, 0.5845, 0.2828, NULL, 9.231, 1.168, 5.045, 0.7417),
(310, '水果類', '桃接李(小)', '樣品狀態:紅皮黃肉; 前處理描述:去籽,混合均勻打碎', '李子', 35.8162, 0.66, 0.3158, 0.1194, 8.5987, 1.9241, 5.315, 0.0181),
(311, '水果類', '蜜棗李(進口)', '樣品狀態:紅皮黃肉; 前處理描述:去籽,混合均勻打碎', '李子', 52.89, 0.577, 0.229, NULL, 13.6207, 1.3944, NULL, 0.2319),
(312, '水果類', '黃肉李', '樣品狀態:黃皮黃肉; 前處理描述:去籽,混合均勻打碎', '李子', 35.4499, 0.436, 0.222, 0.0836, 8.9241, 0.9328, 5.8709, 0.474),
(313, '水果類', '黑李', '樣品狀態:黑皮黃肉; 前處理描述:去籽,混合均勻打碎', '李子', 56.8927, 0.7435, 0.1591, 0.0666, 14.7397, 1.4455, 10.471, 0.1925),
(314, '水果類', '枇杷', '前處理描述:去皮及籽,混合均勻打碎', '琶琵果', 37.9522, 0.327, 0.1907, 0.0358, 9.7937, 0.9124, 7.9976, 4.3127),
(315, '水果類', '筆柿', '前處理描述:去皮及蒂,混合均勻打碎', '柿子,柹,香柿(長柿,珍寶柿,筆干柿)', 69.216, 0.574, 0.149, NULL, 18.3445, 4.0329, NULL, 1.9299),
(316, '水果類', '甜柿平均值', '前處理描述:去皮及蒂,混合均勻打碎', '柿子,柹,香柿', 57.1428, 0.4813, 0.1004, NULL, 15.1904, 1.2303, 13.0254, 2.9431),
(317, '水果類', '富有甜柿(大雪山)', '前處理描述:去皮及蒂,混合均勻打碎', '柿子,柹,香柿', 56.7934, 0.391, 0.1243, NULL, 15.122, 1.0934, 13.0254, 0.48),
(318, '水果類', '甜柿(進口)', '前處理描述:去皮及蒂,混合均勻打碎', '柿子,柹,香柿', 57.4922, 0.5715, 0.0765, NULL, 15.2588, 1.3671, NULL, 5.4062),
(319, '水果類', '國產甜柿', '前處理描述:去皮及蒂,混合均勻打碎', '柿子,柹,香柿', 47.4084, 0.374, 0.0558, 0.0282, 12.6902, 1.0525, 11.586, 0),
(320, '水果類', '牛心柿', '樣品狀態:脆澀柿; 前處理描述:去皮及蒂,混合均勻打碎', '柿子,柹,香柿(水柿,浸柿,硬柿,脆柿)', 62.3047, 0.4805, 0.1615, NULL, 16.4829, 4.0005, NULL, 3.3468),
(321, '水果類', '四周柿', '樣品狀態:軟澀柿; 前處理描述:去皮及蒂,混合均勻打碎', '柿子,柹,香柿(紅柿,軟柿)', 65.6456, 0.474, 0.099, NULL, 17.5623, 4.3664, NULL, 0.4203),
(322, '水果類', '柿餅', '前處理描述:去蒂,混合均勻打碎', NULL, 195.614, 1.7097, 0.2172, 0.0809, 52.2366, 12.5877, 25.985, 3.7444),
(323, '水果類', '水蜜桃平均值', '樣品狀態:水蜜桃系; 前處理描述:去籽,混合均勻打碎', '毛桃,白桃', 39.4356, 0.9065, 0.1633, 0.0426, 9.7287, 1.6599, 6.3621, 1.9139),
(324, '水果類', '水蜜桃', '樣品狀態:水蜜桃(white peach #4401); 前處理描述:去籽,混合均勻打碎', '毛桃,白桃', 39.7262, 0.906, 0.1389, 0, 9.8665, 1.3358, 6.0491, 3.4017),
(325, '水果類', '甜蜜桃', '樣品狀態:水蜜桃; 前處理描述:去籽,混合均勻打碎', '毛桃,白桃', 39.145, 0.907, 0.1876, 0.0978, 9.5909, 1.9839, 6.675, 0.426),
(326, '水果類', '脆桃平均值', '前處理描述:去籽,混合均勻打碎', '桃子,甜桃', 44.3199, 0.9194, 0.1426, 0.0499, 11.1215, 2.5171, 5.8215, 2.1418),
(327, '水果類', '白油桃', '樣品狀態:脆桃; 前處理描述:去籽,混合均勻打碎', '桃子,脆桃,甜桃', 36.7819, 0.635, 0.125, NULL, 9.3339, 2.6339, NULL, 0.684),
(328, '水果類', '玫瑰桃', '樣品狀態:脆桃; 前處理描述:去籽,混合均勻打碎', '桃子,脆桃,甜桃', 50.949, 1.2, 0.1, NULL, 12.8, 1.7, NULL, 7),
(329, '水果類', '福壽桃', '樣品狀態:脆桃; 前處理描述:去籽,混合均勻打碎', '桃子,脆桃,甜桃', 47.2326, 0.888, 0.1682, NULL, 11.9003, 3.0544, 6.4196, 0.483),
(330, '水果類', '鶯哥桃', '樣品狀態:脆桃; 前處理描述:去籽,混合均勻打碎', '桃子,脆桃,甜桃', 42.316, 0.9545, 0.1772, 0.062, 10.4516, 2.6801, 5.2233, 0.4002),
(331, '水果類', '蟠桃', '前處理描述:去籽,混合均勻打碎', '餅桃', 45.2668, 0.854, 0.2189, 0.06, 11.2681, 1.6806, 8.638, 0),
(332, '水果類', '青梅(胭脂梅)', '前處理描述:去蒂及籽,混合均勻打碎', '梅子', 34.6328, 0.514, 0.1458, 0.0396, 8.8015, 1.9779, 0.75, 0.801),
(333, '水果類', '西洋梨平均值', '前處理描述:去皮及核,混合均勻打碎', '梨子,水梨,山褵,快果,果宗', 52.7872, 0.2543, 0.1587, 0.0768, 14.0568, 2.1177, 11.264, 0.4537),
(334, '水果類', '西洋梨(青皮)', '前處理描述:去皮及核,混合均勻打碎', '梨子,水梨,山褵,快果,果宗', 61.8717, 0.2755, 0.1915, NULL, 16.4842, 2.6345, NULL, 0.1565),
(335, '水果類', '西洋梨(紅皮)', '前處理描述:去皮及核,混合均勻打碎', '梨子,水梨,山褵,快果,果宗', 52.8339, 0.2815, 0.2106, 0.1019, 13.9237, 1.8326, 11.264, 0.8611),
(336, '水果類', '西洋梨(黃皮)', '前處理描述:去皮及核,混合均勻打碎', '梨子,水梨,山褵,快果,果宗', 43.6562, 0.206, 0.074, NULL, 11.7624, 1.886, NULL, 0.3435),
(337, '水果類', '幸水梨', '前處理描述:去皮及核,混合均勻打碎', '梨子,水梨,山褵,快果,果宗', 34.1309, 0.403, 0.039, NULL, 9.014, 1.1623, 6.7709, 0.446),
(338, '水果類', '大雪梨', '前處理描述:去皮及核,混合均勻打碎', '梨子,水梨,山褵,快果,果宗', 41.9846, 0.3367, 0.1109, 0.0443, 11.0903, 1.1494, 7.2386, 0.4106),
(339, '水果類', '新世紀梨', '前處理描述:去皮及核,混合均勻打碎', '梨子,水梨,山褵,快果,果宗', 41.5951, 0.368, 0.2115, NULL, 10.719, 1.789, NULL, 6.0671),
(340, '水果類', '新興梨', '前處理描述:去皮及核,混合均勻打碎', '梨子,水梨,山褵,快果,果宗', 44.063, 0.24, 0.057, NULL, 11.8832, 1.4041, NULL, 0.3705),
(341, '水果類', '橫山梨', '前處理描述:去皮及核,混合均勻打碎', '梨子,水梨,山褵,快果,果宗(三灣冬梨,粗梨)', 46.5972, 0.4055, 0.0825, NULL, 12.3734, 1.8675, NULL, 4.7379),
(342, '水果類', '豐水梨', '前處理描述:去皮及核,混合均勻打碎', '梨子,水梨,山褵,快果,果宗', 36.129, 0.5257, 0.0673, 0.0218, 9.3887, 0.965, 6.8505, 0.3245),
(343, '水果類', '將軍蜜梨', '樣品狀態:高接梨; 前處理描述:去皮及核,混合均勻打碎', '梨子,水梨,山褵,快果,果宗(三星上將梨)', 49.8356, 0.366, 0.081, NULL, 13.3133, 0.9291, NULL, 0.4764),
(344, '水果類', '梨山蜜梨', '樣品狀態:高接梨; 前處理描述:去皮及核,混合均勻打碎', '梨子,水梨,山褵,快果,果宗', 47.0467, 0.289, 0.0455, 0.0261, 12.693, 1.595, 8.203, 0.2036),
(345, '水果類', '蜜棗平均值(大)', '樣品狀態:大印度棗; 前處理描述:去蒂及籽,混合均勻打碎', '棗子,棗仔', 43.2663, 1.0548, 0.1465, 0.0497, 10.6935, 1.6495, 7.2985, 2.1994),
(346, '水果類', '蜜棗(長形)', '樣品狀態:大印度棗; 前處理描述:去蒂及籽,混合均勻打碎', '棗子,棗仔', 42.8209, 1.1605, 0.17, NULL, 10.4163, 1.6762, NULL, 3.6653),
(347, '水果類', '蜜棗(圓形)', '樣品狀態:大印度棗; 前處理描述:去蒂及籽,混合均勻打碎', '棗子,棗仔(蜜絲棗)', 43.7118, 0.949, 0.1229, 0.0417, 10.9707, 1.6227, 7.2985, 0.7335),
(348, '水果類', '珍珠蜜棗', '樣品狀態:小印度棗; 前處理描述:去蒂及籽,混合均勻打碎', '棗子,棗仔', 45.8929, 1.112, 0.0125, 0.007, 11.6811, 2.242, 10.432, 0.7215),
(349, '水果類', '國產紅棗', '樣品狀態:紅棗,綠皮帶紅; 前處理描述:去蒂及籽,混合均勻打碎', '紅棗', 87.3003, 0.908, 0.1305, 0.0827, 23.0992, 3.9278, 16.139, 1.2248),
(350, '水果類', '紅棗(乾)', '樣品狀態:乾貨; 前處理描述:去籽,混合均勻打碎', '大棗,棗仔', 227.4, 3.173, 0.3, NULL, 59.5078, 7.6505, NULL, 9.65),
(351, '水果類', '黑棗(乾)', '樣品狀態:乾貨; 前處理描述:去蒂及籽,混合均勻打碎', '大棗,棗仔', 230.081, 2.71, 0.19, NULL, 60.9404, 10.814, NULL, 2.89),
(352, '水果類', '蘋果平均值(青皮)', '樣品狀態:青皮; 前處理描述:去皮及核,混合均勻打碎', '柰,林檎', 49.9685, 0.2979, 0.2191, 0.1138, 13.0928, 1.7519, 10.663, 1.6259),
(353, '水果類', '青龍蘋果', '樣品狀態:青皮; 前處理描述:去皮及核,混合均勻打碎', '柰,林檎,青蘋果', 53.8282, 0.265, 0.29, 0.1936, 14.0307, 1.7563, 11.679, 0.62),
(354, '水果類', '翠玉青蘋果', '樣品狀態:青皮; 前處理描述:去皮及核,混合均勻打碎', '柰,林檎,青蘋果(翡翠,青玉,史蜜斯)', 46.1089, 0.3307, 0.1482, 0.055, 12.1548, 1.7475, 9.647, 2.6318),
(355, '水果類', '翠玉青蘋果(帶皮)', '樣品狀態:青皮; 前處理描述:帶皮去核,混合均勻打碎', '柰,林檎,青蘋果(翡翠,青玉,史蜜斯)', 53.7499, 0.371, 0.2285, 0.0575, 14.053, 2.3314, 10.135, 5.057),
(356, '水果類', '美國五爪蘋果', '樣品狀態:紅皮; 前處理描述:去皮及核,混合均勻打碎', '柰,林檎,紅蘋果(元帥)', 50.6902, 0.1545, 0.068, NULL, 13.7783, 1.6212, NULL, 2.2349),
(357, '水果類', '蘋果平均值(混色)', '樣品狀態:混色; 前處理描述:去皮及核,混合均勻打碎', '柰,林檎', 51.3994, 0.2123, 0.095, 0.0304, 13.8587, 1.3388, 11.0585, 1.1926),
(358, '水果類', '加拉蘋果', '樣品狀態:混色; 前處理描述:去皮及核,混合均勻打碎', '柰,林檎', 55.0358, 0.193, 0.063, NULL, 14.9611, 1.4831, NULL, 0.3405),
(359, '水果類', '津輕蜜蘋果', '樣品狀態:混色; 前處理描述:去皮及核,混合均勻打碎', '柰,林檎', 56.3442, 0.198, 0.1679, NULL, 15.076, 1.3696, 11.73, 0.552),
(360, '水果類', '秋香蘋果', '樣品狀態:混色; 前處理描述:去皮及核,混合均勻打碎', '柰,林檎', 45.3376, 0.265, 0.0217, NULL, 12.296, 1.2179, NULL, 0.4479),
(361, '水果類', '富士蘋果', '樣品狀態:混色; 前處理描述:去皮及核,混合均勻打碎', '柰,林檎', 48.8801, 0.193, 0.1273, 0.0408, 13.1017, 1.2844, 10.387, 3.4298),
(362, '水果類', '富士蘋果(帶皮)', '樣品狀態:混色; 前處理描述:帶皮去核,混合均勻打碎', '柰,林檎', 44.9081, 0.226, 0.1469, 0.006, 11.922, 1.697, 9.401, 3.43),
(363, '水果類', '金冠蘋果', '樣品狀態:黃皮; 前處理描述:去皮及核,混合均勻打碎', '柰,林檎,黃蘋果(黃元帥)', 48.7552, 0.36, 0.1025, NULL, 12.9688, 1.4631, NULL, 0),
(364, '水果類', '櫻桃', '樣品狀態:紅皮; 前處理描述:去籽,混合均勻打碎', '中國櫻桃又稱鶯桃,荊桃', 74.9321, 1.2155, 0.2603, NULL, 19.0748, 1.3465, NULL, 2.2269),
(365, '水果類', '白櫻桃', '樣品狀態:紅黃皮; 前處理描述:去籽,混合均勻打碎', '中國櫻桃又稱鶯桃,荊桃', 69.3936, 0.702, 0.0975, NULL, 18.3941, 1.0696, NULL, 0.5416),
(366, '水果類', '椪柑', '前處理描述:去皮及籽,混合均勻打碎', '橘子,蘆柑,壼柑,凸柑,乳柑,潮州柑', 40.1505, 0.804, 0.1548, 0.0421, 10.0426, 1.4714, 6.84, 1.6891),
(367, '水果類', '紅柑', '前處理描述:去皮及籽,混合均勻打碎', '美人(女)柑,明尼吉柚,葡萄蜜柑,迷你葡萄柚', 41.8001, 0.845, 0.1119, 0.0266, 10.5623, 0.9698, 6.899, 0.717),
(368, '水果類', '茂谷柑', '前處理描述:去皮及籽,混合均勻打碎', '柑', 44.3919, 0.595, 0.1223, 0.0389, 11.4914, 1.3294, 9.527, 0.6009),
(369, '水果類', '海梨桶柑', '前處理描述:去皮及籽,混合均勻打碎', '年柑,草山柑,焦柑,蜜桶,漳柑,草山桔(海梨)', 43.8265, 0.8645, 0.15, NULL, 11.0184, 1.9986, NULL, 6.2029),
(370, '水果類', '高牆桶柑', '前處理描述:去皮及籽,混合均勻打碎', '年柑,草山柑,焦柑,蜜桶,漳柑,草山桔(桶柑)', 45.1465, 0.771, 0, NULL, 11.8211, 1.4448, NULL, 0.8032),
(371, '水果類', '檸檬柑', '前處理描述:去皮及籽,混合均勻打碎', '三寶柑,甜檸檬', 48.2649, 1.108, 0.0809, 0, 12.1847, 1.9237, 8.1052, 1.003),
(372, '水果類', '砂糖橘', '前處理描述:去皮及籽,混合均勻打碎', '十月桔,沙糖桔,沙糖橘,砂糖桔', 49.8641, 0.652, 0.28, 0.0799, 12.5916, 1.7196, 9.286, 2.69),
(373, '水果類', '長果金柑', '前處理描述:去皮及籽,混合均勻打碎', '金棗,羅浮柑', 55.5443, 0.96, 0.1947, 0.065, 14.0803, 3.2497, 9.792, 4.9506),
(374, '水果類', '圓果金柑', '前處理描述:去皮及籽,混合均勻打碎', '金桔,金橘,桔子', 31.5768, 0.7, 0.24, NULL, 7.56, 2.2, NULL, 4),
(375, '水果類', '圓果金柑汁(綠皮)', '樣品狀態:現榨原汁; 前處理描述:混合均勻', '金桔,金橘,桔子', 32.3401, 0.891, 0.0725, 0.0318, 7.9832, 1.368, 1.38, 1.3305),
(376, '水果類', '文旦', '前處理描述:取果肉,混合均勻打碎', '柚子,內紫,朱欒,香欒,座凡,拋,欒', 34.4186, 0.685, 0.0655, NULL, 8.7691, 1.4347, NULL, 0.4824),
(377, '水果類', '文旦(2023年取樣)', '前處理描述:取果肉,混合均勻打碎', '麻豆文旦,文旦柚', 47.8151, 0.574, 0.03, 0.0146, 12.6765, 0.8976, 9.969, 0.781),
(378, '水果類', '白柚', '前處理描述:取果肉,混合均勻打碎', '柚子,內紫,朱欒,香欒,座凡,拋,欒', 37.4132, 0.5755, 0.1013, 0.0678, 9.6199, 1.1856, 8.093, 7.1127),
(379, '水果類', '西施蜜柚', '前處理描述:取果肉,混合均勻打碎', '柚子,內紫,朱欒,香欒,座凡,拋,欒(西施柚)', 40.3168, 0.803, 0.154, NULL, 10.0916, 1.2636, NULL, 0.2111),
(380, '水果類', '甜橙平均值(普遍系)', '樣品狀態:普遍系; 前處理描述:去皮及籽,混合均勻打碎', '甜橙,柳橙,柳丁,印子柑,廣柑', 45.5985, 0.7908, 0.2496, 0.0845, 11.3479, 1.9675, 9.1, 2.9883),
(381, '水果類', '柳橙', '樣品狀態:普遍系; 前處理描述:去皮及籽,混合均勻打碎', '甜橙,柳橙,柳丁,印子柑,廣柑', 43.5126, 0.799, 0.1311, 0.0516, 11.0363, 2.0505, 8.565, 5.3037),
(382, '水果類', '香吉士(進口)', '樣品狀態:普遍系; 前處理描述:去皮及籽,混合均勻打碎', '甜橙,柳橙,柳丁,印子柑,廣柑', 47.2362, 0.6845, 0.48, NULL, 11.3663, 2.1662, NULL, 1.1047),
(383, '水果類', '澳洲甜橙(進口)', '樣品狀態:普遍系; 前處理描述:去皮及籽,混合均勻打碎', '甜橙,柳橙,柳丁,印子柑,廣柑', 46.0467, 0.889, 0.1376, 0.0391, 11.6411, 1.6857, 9.635, 2.5564),
(384, '水果類', '青皮葡萄柚', '樣品狀態:青皮白肉; 前處理描述:取果肉,混合均勻打碎', '西柚,朱欒', 33.1124, 0.751, 0.0851, NULL, 8.2991, 1.182, 6.0762, 1.035),
(385, '水果類', '紅寶石葡萄柚(古坑)', '樣品狀態:紅皮粉紅肉; 前處理描述:取果肉,混合均勻打碎', '西柚,朱欒', 36.8728, 0.702, 0.2838, 0.0808, 8.9274, 1.0929, 6.4311, 0),
(386, '水果類', '黃皮葡萄柚(進口)', '樣品狀態:黃皮白肉; 前處理描述:取果肉,混合均勻打碎', '西柚,朱欒', 37.8268, 0.717, 0.078, NULL, 9.6569, 1.083, NULL, 1.4728),
(387, '水果類', '黃皮葡萄柚', '樣品狀態:黃皮粉紅肉; 前處理描述:取果肉,混合均勻打碎', '西柚,朱欒', 37.2039, 0.668, 0.2217, 0.1022, 9.1955, 1.1307, 6.391, 3.6267),
(388, '水果類', '檸檬', '前處理描述:去皮及籽,混合均勻打碎', NULL, 33.3043, 0.708, 0.5335, 0.1966, 7.35, 1.2309, 0.9435, 3.833),
(389, '水果類', '萊姆', '前處理描述:去皮,混合均勻打碎', '無子檸檬', 37.6843, 0.521, 0.9926, 0.3284, 7.6738, 1.8647, 0.907, 1.356),
(390, '水果類', '檸檬汁平均值', '樣品狀態:現榨原汁; 前處理描述:混合均勻', NULL, 30.6394, 0.45, 0.4495, 0.1103, 7.0459, 0.1797, 1.2317, 1.0913),
(391, '水果類', '檸檬汁(黃皮)', '樣品狀態:現榨原汁; 前處理描述:混合均勻', NULL, 29.8739, 0.478, 0.2978, 0.0504, 7.1598, 0.0563, 1.7108, 1.066),
(392, '水果類', '檸檬汁(綠皮)', '樣品狀態:現榨原汁; 前處理描述:混合均勻', NULL, 31.4048, 0.422, 0.6012, 0.1934, 6.9319, 0.303, 0.7525, 1.1165),
(393, '水果類', '萊姆汁', '樣品狀態:現榨原汁; 前處理描述:混合均勻', '無子檸檬', 34.1966, 0.3125, 0.4963, 0.1834, 8.0535, 0.3004, 1.193, 0.4928),
(394, '水果類', '紅甘蔗汁', '樣品狀態:現榨原汁; 前處理描述:混合均勻', '甘蔗汁、高貴蔗汁、果蔗汁、干蔗汁、薯蔗汁、竹蔗汁', 76.1557, 0.505, 0.1927, 0.0966, 20.235, 0.0549, 17.961, 0.478),
(395, '水果類', '紅甘蔗汁(有機,2023年取樣)', '樣品狀態:冷凍瓶裝; 前處理描述:混合均勻', '甘蔗汁、高貴蔗汁、果蔗汁、干蔗汁、薯蔗汁、竹蔗汁', 71.9862, 0.203, 0.412, 0.1504, 18.8488, 0.0553, 16.734, 0),
(396, '水果類', '人心果', '前處理描述:去皮及籽,混合均勻打碎', '吳鳳柿,沙漠吉拉,查某囝仔,人蔘果', 82.512, 0.6, 0.8, NULL, 20.5, 9, NULL, 10),
(397, '水果類', '可可椰子汁平均值', '樣品狀態:綠皮種; 前處理描述:倒出內部汁液混合均勻分裝', '椰子汁,越王頭汁', 17.4086, 0.1405, 0.1249, 0.1249, 4.4142, 0.0132, 3.43, 9.7805),
(398, '水果類', '可可椰子汁(屏東)', '樣品狀態:綠皮種; 前處理描述:倒出內部汁液混合均勻分裝', '椰子汁,越王頭汁', 15.9585, 0.101, 0.2254, 0.2254, 3.8146, 0.0263, 3.43, 3.12);
INSERT INTO `nutrition_facts` (`id`, `food_category`, `sample_name`, `content_description`, `alias`, `kcal`, `protein`, `fat`, `saturated_fat`, `carbohydrate`, `fiber`, `total_sugar`, `sodium`) VALUES
(399, '水果類', '可可椰子汁(進口)', '樣品狀態:綠皮種; 前處理描述:倒出內部汁液混合均勻分裝', '椰子汁,越王頭汁', 18.8587, 0.18, 0.0244, NULL, 5.0138, 0, NULL, 16.441),
(400, '水果類', '蛋黃果', '樣品狀態:長形種; 前處理描述:去皮及籽,混合均勻打碎', '仙桃', 105.623, 1.405, 0.3206, NULL, 27.2831, 6.1032, NULL, 2.7636),
(401, '水果類', '無花果', '前處理描述:去蒂,混合均勻打碎', NULL, 66.9899, 1.16, 0.4204, 0.2288, 16.5482, 2.4692, 6.119, 9.4),
(402, '水果類', '無花果乾', '樣品狀態:果乾(無加糖); 前處理描述:混合均勻打碎', '無花果', 328.033, 3.56, 4.3, 0.5029, 77.8, 13.29, NULL, 9.66),
(403, '水果類', '黃金果', '前處理描述:去皮及籽,混合均勻打碎', '黃晶果', 44.4768, 0.927, 0.227, 0.1021, 10.9617, 0.9431, 10.53, 0),
(404, '水果類', '菠蘿蜜', '樣品狀態:果肉,冷凍袋裝; 前處理描述:混合均勻打碎', '天波羅,樹波羅', 107.752, 1.016, 0.2449, 0.1279, 28.4135, 2.6894, 23.668, 0),
(405, '水果類', '榴槤蜜', '前處理描述:取可食部位,混合均勻打碎', '尖百達,尖蜜拉,小樹菠蘿,小波羅蜜', 123.815, 1.608, 0.11, 0.0636, 32.6365, 3.3211, 21.399, 0),
(406, '水果類', '牛奶果', '前處理描述:去皮及籽,混合均勻打碎', '星蘋果', 62.1757, 0.829, 0.28, 0.1831, 15.8463, 2.385, 12.785, 2.6),
(407, '水果類', '餘甘子', '前處理描述:去籽,混合均勻打碎', '油柑,油甘', 42.5991, 0.285, 0.3169, 0.1695, 10.8303, 3.8265, 2.652, 2.304),
(408, '水果類', '嘉寶果', '前處理描述:去皮及籽混合均勻打碎', '樹葡萄', 58.5811, 0.347, 0.27, 0.1485, 15.3209, 0.706, 14.03, 0),
(409, '水果類', '藍莓(台灣)', '樣品狀態:冷藏盒裝; 前處理描述:混合均勻打碎', NULL, 53.4889, 0.527, 0.33, 0.1066, 13.5989, 1.7926, 9.063, 0.3),
(410, '蔬菜類', '牛蒡', '樣品狀態:生; 前處理描述:去皮,混合均勻打碎', '吳帽,吳某,牛菜,蒡翁菜,鼠黏', 84.456, 2.5407, 0.3733, 0.1805, 19.1474, 5.0896, 1.2874, 14.5052),
(411, '蔬菜類', '胡蘿蔔平均值', '樣品狀態:生; 前處理描述:去蒂及皮,混合均勻打碎', '紅蘿蔔,紅菜頭,黃蘿蔔,丁香蘿蔔,人參,金筍', 38.547, 1.1223, 0.1263, 0.0125, 8.8588, 2.6444, 6.2739, 89.4138),
(412, '蔬菜類', '胡蘿蔔', '樣品狀態:生; 前處理描述:去蒂及皮,混合均勻打碎', '紅蘿蔔,紅菜頭,黃蘿蔔,丁香蘿蔔,人參,金筍', 37.2239, 1.005, 0.1761, 0, 8.4915, 2.7255, 5.2298, 67.1443),
(413, '蔬菜類', '向陽二號胡蘿蔔', '樣品狀態:生; 前處理描述:去蒂及皮,混合均勻打碎', '紅蘿蔔,紅菜頭,黃蘿蔔,丁香蘿蔔,人參,金筍', 44.2969, 0.627, 0.1448, 0.0287, 10.6262, 2.5468, 7.318, 92.478),
(414, '蔬菜類', '澳洲胡蘿蔔(細長型)', '樣品狀態:生; 前處理描述:去蒂及皮,混合均勻打碎', '紅蘿蔔,紅菜頭,黃蘿蔔,丁香蘿蔔,人參,金筍', 34.1201, 1.735, 0.058, NULL, 7.4587, 2.6608, NULL, 108.619),
(415, '蔬菜類', '黃胡蘿蔔', '樣品狀態:生,黃皮黃肉; 前處理描述:去蒂及皮,混合均勻打碎', '紅蘿蔔,紅菜頭,黃蘿蔔,丁香蘿蔔,人參,金筍', 41.802, 1.073, 0.2553, 0.0663, 9.4497, 4.1325, 3.931, 64.57),
(416, '蔬菜類', '冷凍胡蘿蔔', '樣品狀態:冷凍袋裝; 前處理描述:混合均勻打碎', '紅蘿蔔,紅菜頭,黃蘿蔔,丁香蘿蔔,人參,金筍', 13.3556, 0.47, 0.06, NULL, 2.98, 2.16, NULL, 65),
(417, '蔬菜類', '根菾菜根', '樣品狀態:生; 前處理描述:去皮,混合均勻打碎', '甜菜根,火焰菜根', 26.9879, 1.166, 0.0709, NULL, 5.9845, 1.7055, NULL, 236.063),
(418, '蔬菜類', '根菾菜根(2023年取樣)', '樣品狀態:生; 前處理描述:去皮,混合均勻打碎', '甜菜根,火焰菜根', 36.5782, 1.222, 0, 0, 8.5581, 1.9619, 5.92, 141),
(419, '蔬菜類', '白蘿蔔平均值', '樣品狀態:生,白皮白肉; 前處理描述:去蒂及皮,混合均勻打碎', '蘿蔔,菜頭,萊菔,蘆萉,仙人骨,大菜,大根', 17.5798, 0.5485, 0.1277, 0, 3.8652, 1.0894, 2.403, 46.1228),
(420, '蔬菜類', '白蘿蔔', '樣品狀態:生,白皮白肉; 前處理描述:去蒂及皮,混合均勻打碎', '蘿蔔,菜頭,萊菔,蘆萉,仙人骨,大菜,大根', 16.0011, 0.695, 0.146, NULL, 3.3226, 1.087, 1.657, 27.0346),
(421, '蔬菜類', '白蘿蔔(長形)', '樣品狀態:生,白皮白肉; 前處理描述:去蒂及皮,混合均勻打碎', '蘿蔔,菜頭,萊菔,蘆萉,仙人骨,大菜,大根', 19.1585, 0.402, 0.1093, 0, 4.4078, 1.0918, 3.149, 65.211),
(422, '蔬菜類', '櫻桃蘿蔔', '樣品狀態:生,紅皮白肉; 前處理描述:去蒂及皮,混合均勻打碎', '蘿蔔,菜頭,萊菔,小根蘿蔔,二十日蘿蔔,小粒菜頭', 10.7028, 0.595, 0, NULL, 2.3446, 0.9913, NULL, 43.0001),
(423, '蔬菜類', '青蘿蔔', '樣品狀態:生,綠皮白肉; 前處理描述:去蒂及皮,混合均勻打碎', '蘿蔔,菜頭,萊菔,綠蘿蔔,綠長蘿蔔,青菜頭,青大根', 32.66, 1.809, 0.0868, NULL, 6.9728, 1.6019, NULL, 12.7358),
(424, '蔬菜類', '蘿蔔乾', '樣品狀態:生; 前處理描述:混合均勻打碎', '菜脯乾,菜脯', 57.8833, 2.2, 1.19, NULL, 10.81, 7.21, NULL, 3278.6),
(425, '蔬菜類', '百合鱗片', '樣品狀態:生; 前處理描述:混合均勻打碎', '百合,百合花鱗片,蒜腦藷', 136.616, 3.793, 0.0627, 0, 32.347, 2.671, 7.7718, 4.219),
(426, '蔬菜類', '乾百合鱗片', '樣品狀態:乾貨; 前處理描述:混合均勻打碎', '乾百合,乾百合花鱗片,乾蒜腦藷', 303.915, 11.838, 0.7399, 0.2063, 68.3864, 25.9582, 2.7285, 89.964),
(427, '蔬菜類', '芋莖', '樣品狀態:生; 前處理描述:去粗皮,混合均勻打碎', '芋拐,芋橫,芋葉梗', 19.7972, 1.1, 0.46, NULL, 3.35, 1.5, NULL, 4),
(428, '蔬菜類', '金針菜嫩莖', '樣品狀態:生; 前處理描述:混合均勻打碎', '碧玉筍,金針筍,金針菜梗,軟化金針菜,金針嫩菜芽,萱草菜嫩芽', 23.9964, 0.7207, 0.1523, 0.0717, 5.3419, 2.0698, 3.0735, 1.076),
(429, '蔬菜類', '草石蠶', '樣品狀態:生; 前處理描述:混合均勻打碎', '甘露兒,甘露菜,寶塔菜,地蠶,螺獅菜,土蛹(坊間誤稱為冬蟲夏草)', 74.8778, 1.725, 0, NULL, 18.0406, 2.4066, NULL, 0.4275),
(430, '蔬菜類', '球莖甘藍', '樣品狀態:生; 前處理描述:去皮,混合均勻打碎', '大頭菜,結頭菜,芥頭,菜菜鵠,菜叩,莖藍,蕪菁蕓苔', 19.943, 1.5563, 0.2257, 0.081, 3.5837, 0.8816, 2.761, 17.6559),
(431, '蔬菜類', '孟宗竹筍', '樣品狀態:生; 前處理描述:去殼,混合均勻打碎', '毛竹,茅竹,茅茹竹,江南竹,貓竹,貓兒竹,楠竹,南竹,至竹,斑竹(冬筍)', 40.0978, 3.958, 0.15, NULL, 7.3006, 2.1355, NULL, 11.5409),
(432, '蔬菜類', '熟桂竹筍', '樣品狀態:熟; 前處理描述:混合均勻打碎', '桂竹仔筍,石竹仔筍,簍竹,筀竹筍', 20.846, 2.1323, 0.1974, 0.0559, 3.489, 1.7038, 0.2235, 67.9358),
(433, '蔬菜類', '烏殼綠竹筍', '樣品狀態:生; 前處理描述:去殼,混合均勻打碎', '烏殼筍,烏殼綠,烏綠竹,烏腳綠竹筍,烏腳綠仔,四季竹,南洋竹,食用刺竹', 21.4256, 1.8233, 0.2228, 0.1503, 3.7907, 1.7252, 1.5769, 16.7736),
(434, '蔬菜類', '茭白筍', '樣品狀態:生; 前處理描述:去殼,混合均勻打碎', '茭白,茭筍,茭草,水筍,腳白筍,加白筍,菰,菰菜,菰筍,菰蔣', 20.459, 1.332, 0.1565, 0.1035, 4.0152, 2.1139, 1.778, 5.0048),
(435, '蔬菜類', '玉米筍', '樣品狀態:生; 前處理描述:混合均勻打碎', '番麥筍,珍珠筍', 33.3763, 1.768, 0.16, 0.1209, 7.0269, 2.079, 3.023, 0),
(436, '蔬菜類', '麻竹筍', '樣品狀態:生; 前處理描述:去殼,混合均勻打碎', '蔴竹,甜竹,巨竹,坭竹,大綠竹,瓦坭竹,巨麻竹,美濃麻竹,吊絲麻竹', 22.0451, 1.422, 0.13, 0.0787, 4.4183, 1.64, 2.271, 0.55),
(437, '蔬菜類', '冷凍麻竹筍', '前處理描述:混合均勻打碎', '蔴竹,甜竹,巨竹,坭竹,大綠竹,瓦坭竹,巨麻竹,美濃麻竹,吊絲麻竹', 17.2648, 0.85, 0.04, NULL, 3.77, 1.7, NULL, 22),
(438, '蔬菜類', '綠竹筍', '樣品狀態:生; 前處理描述:去殼,混合均勻打碎', '甜竹,甜竹筍,綠仔筍,綠仔笋,綠竹笋', 24.9617, 1.7175, 0.2348, 0.1507, 4.7427, 1.6663, 2.2001, 0.362),
(439, '蔬菜類', '帶殼熟綠竹筍', '樣品狀態:熟,真空包裝; 前處理描述:去殼,混合均勻打碎', '甜竹,甜竹筍,綠仔筍,綠仔笋,綠竹笋', 25.2944, 2.01, 0.0899, NULL, 4.9425, 1.8772, 1.8844, 1.393),
(440, '蔬菜類', '沙拉筍塊', '樣品狀態:綠竹筍,熟,真空包裝; 前處理描述:混合均勻打碎', '涼筍', 23.7743, 1.5635, 0.098, NULL, 4.8353, 1.7265, 2.991, 7.9176),
(441, '蔬菜類', '熟箭竹筍', '樣品狀態:熟,真空包裝; 前處理描述:混合均勻打碎', '箭筍,台灣箭竹,矢竹仔,玉山箭竹', 19.7042, 2.0968, 0.3253, 0.0801, 2.9456, 2.1067, 0, 342.772),
(442, '蔬菜類', '白蘆筍', '樣品狀態:生; 前處理描述:去粗皮及粗莖,混合均勻打碎', '野天門冬,松葉土當歸,石刁柏,龍鬚菜', 25.2835, 1.8453, 0.1565, 0.0517, 4.9074, 1.8322, NULL, 3.5594),
(443, '蔬菜類', '綠蘆筍平均值', '樣品狀態:生; 前處理描述:去粗皮及粗莖,混合均勻打碎', '野天門冬,松葉土當歸,石刁柏,龍鬚菜', 21.8875, 2.6543, 0.1684, 0.144, 3.4677, 1.2023, 1.6625, 4.3052),
(444, '蔬菜類', '綠蘆筍', '樣品狀態:生; 前處理描述:去粗皮及粗莖,混合均勻打碎', '野天門冬,松葉土當歸,石刁柏,龍鬚菜', 22.2906, 1.348, 0.1639, 0.1368, 4.4582, 1.4194, 1.696, 6.0314),
(445, '蔬菜類', '澳洲綠蘆筍(粗短型)', '樣品狀態:生; 前處理描述:去粗皮及粗莖,混合均勻打碎', '野天門冬,松葉土當歸,石刁柏,龍鬚菜', 20.4908, 2.54, 0.1929, NULL, 3.1337, 1.2288, NULL, 3.11),
(446, '蔬菜類', '綠蘆筍(細短型)', '樣品狀態:生; 前處理描述:去粗皮及粗莖,混合均勻打碎', '野天門冬,松葉土當歸,石刁柏,龍鬚菜', 22.9636, 3.26, 0.2125, NULL, 3.242, 1.2103, NULL, 3.4795),
(447, '蔬菜類', '綠蘆筍(短型)', '樣品狀態:生; 前處理描述:去粗皮及粗莖,混合均勻打碎', '野天門冬,松葉土當歸,石刁柏,龍鬚菜', 21.8049, 3.469, 0.1043, 0.0913, 3.0367, 0.9506, 1.629, 4.6),
(448, '蔬菜類', '蘆筍花', '樣品狀態:生; 前處理描述:去粗皮及粗莖,混合均勻打碎', NULL, 20.6429, 2.913, 0.3053, NULL, 2.6809, 1.776, NULL, 1.894),
(449, '蔬菜類', '嫩莖萵苣', '樣品狀態:生; 前處理描述:去皮,混合均勻打碎', '鵝菜心,莖用萵苣,萵(鵝)仔菜心,大心萵(媚)仔菜,萵苣筍(莖),妹仔菜筍,', 16.2946, 1, 0.18, NULL, 3.12, 1.2, NULL, 22),
(450, '蔬菜類', '嫩薑', '樣品狀態:生; 前處理描述:混合均勻打碎', '薑仔,生薑,生姜,羌,蘘荷,茗荷,甘露子,紫薑', 21.2034, 0, 0.32, NULL, 4.75, 1.38, NULL, 12),
(451, '蔬菜類', '粉薑', '樣品狀態:生; 前處理描述:混合均勻打碎', '薑仔,生薑,生姜,羌,蘘荷,茗荷,甘露子,紫薑', 28.3892, 0.98, 0.2629, 0.0951, 6.0567, 2.7254, 0.6835, 7.2318),
(452, '蔬菜類', '老薑', '樣品狀態:生; 前處理描述:混合均勻打碎', '薑仔,生薑,生姜,羌,蘘荷,茗荷,甘露子,紫薑', 52.5956, 1.143, 0.4836, 0.1808, 11.6803, 3.2059, 0.659, 4.2429),
(453, '蔬菜類', '檳榔嫩莖', '樣品狀態:生; 前處理描述:混合均勻打碎', '半天筍,檳榔樹心', 31.3181, 2.232, 0.4183, 0.128, 5.6331, 2.5608, 1.9264, 9.5837),
(454, '蔬菜類', '大蒜', '樣品狀態:乾貨; 前處理描述:去外膜,混合均勻打碎', '蒜頭,大蒜頭,蒜球,蒜瓣,蒜仔頭', 122.486, 6.6885, 0.2269, 0.1748, 26.4265, 4.1739, 1.038, 4.2509),
(455, '蔬菜類', '青蒜', '樣品狀態:生; 前處理描述:去根部及葉尾與外葉,混合均勻打碎', '蒜仔,葫,胡蒜,洋蒜,韭蔥', 32.7941, 2.1337, 0.254, 0.0897, 6.4302, 3.2153, 2.959, 3.0408),
(456, '蔬菜類', '蒜苗', '樣品狀態:生; 前處理描述:去根部及葉尾,混合均勻打碎', '蒜黃', 53.5059, 2.229, 0.083, NULL, 12.0439, 3.2913, NULL, 8.8693),
(457, '蔬菜類', '青蔥平均值', '樣品狀態:生; 前處理描述:去根部及葉尾與外葉,混合均勻打碎', NULL, 30.6272, 1.2625, 0.1855, 0.079, 6.6068, 2.2122, 3.0609, 0.9736),
(458, '蔬菜類', '青蔥(有機)', '樣品狀態:生,冷藏袋裝; 前處理描述:去根部,外葉及葉尾,混合均勻打碎', '蔥,葉蔥,蔥仔', 31.3369, 1.148, 0.2346, 0.1097, 6.7604, 2.6528, 3.677, 1.19),
(459, '蔬菜類', '山東大蔥', '樣品狀態:生; 前處理描述:去根部及葉尾與外葉,混合均勻打碎', '蔥,大蔥,葉蔥,蔥仔,水蔥,漢蔥', 30.6474, 1.304, 0.1196, NULL, 6.7256, 1.3499, NULL, 0.8022),
(460, '蔬菜類', '日本甜蔥', '樣品狀態:生; 前處理描述:去根部及葉尾與外葉,混合均勻打碎', '蔥,大蔥,葉蔥,蔥仔,水蔥,漢蔥', 33.2834, 1.014, 0.1382, NULL, 7.5564, 2.6654, 3.066, 1.021),
(461, '蔬菜類', '宜蘭粉蔥', '樣品狀態:生; 前處理描述:去根部及葉尾與外葉,混合均勻打碎', '蔥,葉蔥,蔥仔,水蔥,漢蔥', 27.2412, 1.584, 0.2497, 0.0959, 5.3849, 2.1808, 2.4396, 0.881),
(462, '蔬菜類', '白洋蔥', '樣品狀態:生; 前處理描述:去根部及外皮,混合均勻打碎', '玉蔥,蔥頭,球蔥,胡蔥,日本蔥頭,大粒蔥頭,洋蔥頭,大蔥頭', 41.9293, 1.0005, 0.058, NULL, 9.9545, 1.2711, 5.2759, 3.223),
(463, '蔬菜類', '紫洋蔥', '樣品狀態:生; 前處理描述:去根部及外皮,混合均勻打碎', '玉蔥,蔥頭,球蔥,胡蔥,日本蔥頭,大粒蔥頭,洋蔥頭,大蔥頭', 31.5642, 0.8748, 0.1088, 0.0423, 7.2722, 1.4965, 4.2678, 3.7699),
(464, '蔬菜類', '黃洋蔥', '樣品狀態:生; 前處理描述:去根部及外皮,混合均勻打碎', '玉蔥,蔥頭,球蔥,胡蔥,日本蔥頭,大粒蔥頭,洋蔥頭,大蔥頭', 41.5585, 0.9663, 0.24, 0.0951, 9.4918, 1.3758, 5.514, 2.4683),
(465, '蔬菜類', '紅蔥頭', '樣品狀態:生; 前處理描述:去根部及外皮,混合均勻打碎', '油蔥頭,珠蔥頭,分蔥頭,大頭蔥頭,四季蔥頭', 74.9788, 3.437, 0.2625, NULL, 16.353, 2.5283, NULL, 15.9285),
(466, '蔬菜類', '韮菜花', '樣品狀態:生; 前處理描述:混合均勻打碎', '花韮菜,韮花,韭菜苔(韮/韭通用)', 28.2275, 1.802, 0.22, 0.1375, 5.5551, 2.4818, 1.871, 3.06),
(467, '蔬菜類', '韮菜', '樣品狀態:生; 前處理描述:去腐葉,混合均勻打碎', '韮,塊莖蒜,起陽草(韮/韭通用)', 23.0272, 1.8953, 0.3507, 0.1307, 3.8785, 2.4366, 1.051, 2.3307),
(468, '蔬菜類', '韮黃', '樣品狀態:生; 前處理描述:去腐葉,混合均勻打碎', '韮黃,黃韮菜,白韮菜,軟化韮菜(韮/韭通用)', 16.2344, 1.478, 0.1215, NULL, 2.909, 1.6534, NULL, 3.3924),
(469, '蔬菜類', '九層塔', '樣品狀態:生; 前處理描述:去粗梗,混合均勻打碎', '千層塔,羅勒,家佩蘭,零陵菜,香菜(草),薰草,西王母菜,塞香菜,光明子,醒頭香', 27.3979, 2.904, 0.2916, 0.101, 4.4484, 3.4205, 0.083, 1.6471),
(470, '蔬菜類', '小麥苗', '樣品狀態:生; 前處理描述:混合均勻打碎', NULL, 34.0464, 3.326, 0.4841, 0.0992, 5.4565, 3.929, 0, 3.064),
(471, '蔬菜類', '水菜(日本種)', '樣品狀態:生; 前處理描述:去根部,混合均勻打碎', NULL, 10.9221, 1.164, 0.201, 0.0821, 1.5872, 1.3546, 0, 2.294),
(472, '蔬菜類', '甘藍平均值', '樣品狀態:生; 前處理描述:去粗莖,混合均勻打碎', '高麗菜,包菜,洋白菜,玻璃菜,玉菜,捲心菜,球葉甘藍,結球甘藍,蕃芥藍', 23.1788, 1.308, 0.1439, NULL, 4.7557, 1.0946, 2.732, 10.5289),
(473, '蔬菜類', '梨山甘藍(尖球形)', '樣品狀態:生,尖球形; 前處理描述:去粗莖,混合均勻打碎', '高麗菜,包菜,洋白菜,玻璃菜,玉菜,捲心菜,球葉甘藍,結球甘藍,蕃芥藍', 24.058, 1.402, 0.0614, NULL, 5.0951, 1.0397, NULL, 8.3789),
(474, '蔬菜類', '甘藍(扁圓形)', '樣品狀態:生,扁圓形; 前處理描述:去粗莖,混合均勻打碎', '高麗菜,包菜,洋白菜,玻璃菜,玉菜,捲心菜,球葉甘藍,結球甘藍,蕃芥藍', 21.0373, 1.09, 0.1754, NULL, 4.2855, 0.9158, 2.732, 12.208),
(475, '蔬菜類', '甘藍(圓球形)', '樣品狀態:生,圓球形; 前處理描述:去粗莖,混合均勻打碎', '高麗菜,包菜,洋白菜,玻璃菜,玉菜,捲心菜,球葉甘藍,結球甘藍,蕃芥藍', 24.4409, 1.432, 0.1949, NULL, 4.8866, 1.3282, NULL, 10.9997),
(476, '蔬菜類', '甘藍(圓球形)(2021年取樣)', '樣品狀態:生,圓球形; 前處理描述:去粗莖,混合均勻打碎', '高麗菜', 20.2123, 0.842, 0, 0, 4.617, 1.0525, 3.426, 3.47),
(477, '蔬菜類', '紫色甘藍', '樣品狀態:生,紫色種; 前處理描述:去粗莖,混合均勻打碎', '紫甘藍,紫色高麗菜,紅色高麗菜,紅玻璃菜,紅玉菜', 28.4625, 1.484, 0.1836, NULL, 5.9071, 2.1274, 2.3507, 13.3745),
(478, '蔬菜類', '甘藍芽', '樣品狀態:生; 前處理描述:混合均勻打碎', '高麗菜芽', 33.0137, 2.6525, 0.5995, 0, 5.3965, 2.101, NULL, 12.061),
(479, '蔬菜類', '冷凍甘藍', '樣品狀態:冷凍包裝; 前處理描述:混合均勻打碎', '高麗菜,包菜,洋白菜,玻璃菜,玉菜,捲心菜,球葉甘藍,結球甘藍,蕃芥藍', 20.4849, 1.286, 0.1, NULL, 4.174, 2.28, NULL, 20.9),
(480, '蔬菜類', '羽衣甘藍(有機)', '樣品狀態:生,冷藏袋裝; 前處理描述:混合均勻打碎', NULL, 35.2175, 2.956, 0.8998, 0.2632, 5.1132, 3.8297, 0.298, 59.62),
(481, '蔬菜類', '脫水甘藍', '樣品狀態:乾貨; 前處理描述:混合均勻打碎', NULL, 340.726, 6.856, 0.06, NULL, 82.631, 17.0236, NULL, 1351.47),
(482, '蔬菜類', '甘藷葉', '樣品狀態:生; 前處理描述:去粗莖,混合均勻打碎', '地瓜葉,番藷葉,過溝菜(藷同薯)', 27.8434, 3.1552, 0.2784, 0.1235, 4.4222, 3.287, 0, 39.2764),
(483, '蔬菜類', '蚵仔白菜(2022年取樣)', '樣品狀態:生,不結球白菜; 前處理描述:去根部,混合均勻打碎', '白菜,青菜,散葉白菜,無心菜,菘,不結球白菜,尼龍白菜,皺(碎/曲)葉白菜,皺葉中蕓苔', 13.0932, 1.399, 0.3098, 0.1143, 1.7525, 1.38, 0.4, 39.71),
(484, '蔬菜類', '荷葉白菜', '樣品狀態:生,不結球白菜; 前處理描述:去根部,混合均勻打碎', '白菜,青菜,散葉白菜,無心菜,菘,不結球白菜', 14.4486, 1.436, 0.1004, NULL, 2.5246, 1.2489, NULL, 91.2009),
(485, '蔬菜類', '葵扇白菜', '樣品狀態:生,不結球白菜; 前處理描述:去根部,混合均勻打碎', '白菜,青菜,散葉白菜,無心菜,菘,不結球白菜,江戶(門)白菜,黑葉白菜,扇子白菜,黑芥菜,排菜', 13.8586, 1.552, 0.073, NULL, 2.3542, 1.3803, NULL, 47.3983),
(486, '蔬菜類', '黑葉白菜(短梗)', '樣品狀態:生,不結球白菜; 前處理描述:去根部,混合均勻打碎', '白菜,青菜,散葉白菜,無心菜,菘,不結球白菜', 15.1397, 1.343, 0.0386, NULL, 2.8969, 1.283, NULL, 56.9583),
(487, '蔬菜類', '千寶菜', '樣品狀態:生; 前處理描述:混合均勻打碎', NULL, 20.1997, 1.714, 0.1968, 0.0645, 3.6056, 2.232, 1.1253, 45.932),
(488, '蔬菜類', '小白菜(土植)(1月取樣)', '樣品狀態:生; 前處理描述:去根部,混合均勻打碎', '土白菜,青菜,白菜,不結球白菜,水白菜', 10.4144, 1.15, 0.184, 0, 1.5029, 1.3243, NULL, 109.604),
(489, '蔬菜類', '小白菜(土植)(3月取樣)', '樣品狀態:生; 前處理描述:去根部,混合均勻打碎', '土白菜,青菜,白菜,不結球白菜,水白菜', 13.9188, 1.221, 0.14, 0.0568, 2.4482, 1.376, 0.373, 50.72),
(490, '蔬菜類', '小白菜(土植)(4月取樣)', '樣品狀態:生; 前處理描述:去根部,混合均勻打碎', '土白菜,青菜,白菜,不結球白菜,水白菜', 13.1398, 1.05, 0.199, NULL, 2.2367, 1.2386, NULL, 124.901),
(491, '蔬菜類', '小白菜(土植)(7月取樣)', '樣品狀態:生; 前處理描述:去根部,混合均勻打碎', '土白菜,青菜,白菜,不結球白菜,水白菜', 10.4789, 0.96, 0.11, NULL, 1.8059, 1.0437, NULL, 119.099),
(492, '蔬菜類', '小白菜(土植)(10月取樣)', '樣品狀態:生; 前處理描述:去根部,混合均勻打碎', '土白菜,青菜,白菜,不結球白菜,水白菜', 11.4178, 1.065, 0.24, NULL, 1.6971, 1.1009, NULL, 70.87),
(493, '蔬菜類', '小白菜(水耕)(1月取樣)', '樣品狀態:生; 前處理描述:去根部,混合均勻打碎', '土白菜,青菜,白菜,不結球白菜,水白菜', 12.7756, 1.452, 0.107, 0, 2.0707, 1.5216, NULL, 8.541),
(494, '蔬菜類', '小白菜(水耕)(4月取樣)', '樣品狀態:生; 前處理描述:去根部,混合均勻打碎', '土白菜,青菜,白菜,不結球白菜,水白菜', 13.351, 0.979, 0.172, NULL, 2.3965, 1.3544, NULL, 10.8848),
(495, '蔬菜類', '小白菜(水耕)(7月取樣)', '樣品狀態:生; 前處理描述:去根部,混合均勻打碎', '土白菜,青菜,白菜,不結球白菜,水白菜', 12.2164, 0.902, 0.077, NULL, 2.3612, 1.1754, NULL, 8.8591),
(496, '蔬菜類', '小白菜(水耕)(10月取樣)', '樣品狀態:生; 前處理描述:去根部,混合均勻打碎', '土白菜,青菜,白菜,不結球白菜,水白菜', 11.9979, 1.091, 0.27, NULL, 1.764, 1.2214, NULL, 6.35),
(497, '蔬菜類', '小白菜(有機)(1月取樣)', '樣品狀態:生; 前處理描述:去根部,混合均勻打碎', '土白菜,青菜,白菜,不結球白菜,水白菜', 9.2122, 1.842, 0.17, 0, 0.7598, 1.5374, NULL, 79.227),
(498, '蔬菜類', '小白菜(有機)(4月取樣)', '樣品狀態:生; 前處理描述:去根部,混合均勻打碎', '土白菜,青菜,白菜,不結球白菜,水白菜', 14.4059, 1.254, 0.195, NULL, 2.4329, 1.1737, NULL, 39.6322),
(499, '蔬菜類', '小白菜(有機)(7月取樣)', '樣品狀態:生; 前處理描述:去根部,混合均勻打碎', '土白菜,青菜,白菜,不結球白菜,水白菜', 10.9009, 1.258, 0.097, NULL, 1.7418, 1.3067, NULL, 32.9271),
(500, '蔬菜類', '小白菜(有機)(10月取樣)', '樣品狀態:生; 前處理描述:去根部,混合均勻打碎', '土白菜,青菜,白菜,不結球白菜,水白菜', 12.9507, 1.347, 0.24, NULL, 1.9007, 1.056, NULL, 23.03),
(501, '蔬菜類', '珍珠小白菜', '樣品狀態:生; 前處理描述:去根部,混合均勻打碎', '珍珠白菜', 11.1145, 1.497, 0.0718, 0.0354, 1.6901, 1.6795, 0.081, 4.039),
(502, '蔬菜類', '油菜心', '樣品狀態:生; 前處理描述:混合均勻打碎', NULL, 30.9035, 3.2, 0.85, NULL, 3.95, 2.3, NULL, 21),
(503, '蔬菜類', '油菜(有機)', '樣品狀態:生,去根部; 前處理描述:混合均勻打碎', '蕓苔', 12.9931, 1.303, 0.113, 0.0508, 2.2137, 1.4522, 0.243, 23.71),
(504, '蔬菜類', '青江菜(土植)(1月取樣)', '樣品狀態:生; 前處理描述:混合均勻打碎', '江門白菜, 湯匙菜,青梗白菜', 10.1525, 1.307, 0.049, NULL, 1.62, 1.1269, NULL, 73.07),
(505, '蔬菜類', '青江菜(土植)(3月取樣)', '樣品狀態:生; 前處理描述:混合均勻打碎', '江門白菜 ,湯匙菜,青梗白菜', 12.8607, 1.233, 0.13, 0.0554, 2.1903, 1.2063, 0.374, 53.14),
(506, '蔬菜類', '青江菜(土植)(4月取樣)', '樣品狀態:生; 前處理描述:混合均勻打碎', '江門白菜, 湯匙菜,青梗白菜', 10.7355, 0.96, 0.125, NULL, 1.8395, 0.9868, NULL, 110.196),
(507, '蔬菜類', '青江菜(土植)(7月取樣)', '樣品狀態:生; 前處理描述:混合均勻打碎', '江門白菜,湯匙菜,青梗白菜', 14.8163, 1.507, 0.118, NULL, 2.5334, 1.2505, NULL, 92.3846),
(508, '蔬菜類', '青江菜(土植)(10月取樣)', '樣品狀態:生; 前處理描述:混合均勻打碎', '江門白菜, 湯匙菜,青梗白菜', 18.1348, 1.701, 0.07, 0.0379, 3.357, 1.5626, 0.58, 27.676),
(509, '蔬菜類', '青江菜(水耕)(1月取樣)', '樣品狀態:生; 前處理描述:混合均勻打碎', '江門白菜 ,湯匙菜,青梗白菜', 12.4853, 1.243, 0.007, NULL, 2.3513, 1.4051, NULL, 5.659),
(510, '蔬菜類', '青江菜(水耕)(4月取樣)', '樣品狀態:生; 前處理描述:混合均勻打碎', '江門白菜 , 湯匙菜,青梗白菜', 14.3465, 1.397, 0.16, NULL, 2.3967, 1.2706, NULL, 11.6504),
(511, '蔬菜類', '青江菜(水耕)(7月取樣)', '樣品狀態:生; 前處理描述:混合均勻打碎', '江門白菜 ,湯匙菜,青梗白菜', 13.9288, 1.651, 0.129, NULL, 2.1855, 1.11, NULL, 12.7177),
(512, '蔬菜類', '青江菜(水耕)(10月取樣)', '樣品狀態:生; 前處理描述:混合均勻打碎', '江門白菜 ,湯匙菜,青梗白菜', 10.943, 1.371, 0.22, 0.0227, 1.4127, 1.8541, NULL, 14.3),
(513, '蔬菜類', '青江菜(有機)(1月取樣)', '樣品狀態:生; 前處理描述:混合均勻打碎', '江門白菜,湯匙菜,青梗白菜', 9.8742, 1.531, 0.003, NULL, 1.4969, 1.3377, NULL, 37.815),
(514, '蔬菜類', '青江菜(有機)(4月取樣)', '樣品狀態:生; 前處理描述:混合均勻打碎', '江門白菜 ,湯匙菜,青梗白菜', 14.8681, 1.382, 0.176, NULL, 2.5062, 1.1858, NULL, 40.083),
(515, '蔬菜類', '青江菜(有機)(7月取樣)', '樣品狀態:生; 前處理描述:混合均勻打碎', '江門白菜 ,湯匙菜,青梗白菜', 20.6762, 1.944, 0.243, NULL, 3.4741, 1.8684, NULL, 22.3153),
(516, '蔬菜類', '青江菜(有機)(10月取樣)', '樣品狀態:生; 前處理描述:混合均勻打碎', '江門白菜 , 湯匙菜,青梗白菜', 15.4033, 1.64, 0.05, 0.0235, 2.7405, 1.5067, 0.505, 23.076),
(517, '蔬菜類', '塔菇菜(有機)', '樣品狀態:生; 前處理描述:混合均勻打碎', '塌棵菜；塔菜；瓢兒芥', 14.0011, 1.864, 0, 0, 2.3378, 1.6536, 0.1, 58.61),
(518, '蔬菜類', '廣島野菜', '樣品狀態:生; 前處理描述:去根部,混合均勻打碎', '廣島菜', 15.828, 1.71, 0, 0, 2.9097, 1.5104, 0.343, 18.56),
(519, '蔬菜類', '日本油菜(有機)', '樣品狀態:生,冷藏袋裝; 前處理描述:去根部,混合均勻打碎', '鶯菜,小松菜', 20.437, 1.505, 0.427, 0.168, 3.3128, 2.1273, 0.755, 55.44),
(520, '蔬菜類', '結球白菜平均值', '樣品狀態:生,結球白菜; 前處理描述:混合均勻打碎', '大白菜,黃芽菜,包心白菜,卷心白菜,山東白菜,結球白菜', 16.7791, 1.1926, 0.2916, 0.1235, 2.8753, 0.9438, 1.8695, 23.8718),
(521, '蔬菜類', '煙台白菜', '樣品狀態:生,結球白菜,長卵圓形; 前處理描述:混合均勻打碎', '大白菜,黃芽菜,包心白菜,卷心白菜,山東白菜,結球白菜(包頭蓮)', 14.2885, 1.296, 0.255, NULL, 2.2458, 1.1639, NULL, 29.82),
(522, '蔬菜類', '迷你竹筍白菜', '樣品狀態:生,結球白菜,長卵圓形; 前處理描述:混合均勻打碎', '大白菜,黃芽菜,包心白菜,卷心白菜,山東白菜,結球白菜', 18.9427, 1.256, 0.0891, 0.0386, 3.8221, 0.3989, 2.283, 4.222),
(523, '蔬菜類', '翠玉白菜', '樣品狀態:生,結球白菜,圓筒形; 前處理描述:混合均勻打碎', '天津白菜,直筒白菜,長筒白菜,竹筒白菜', 19.4448, 1.0345, 0.68, NULL, 2.8315, 1.1859, NULL, 47.795),
(524, '蔬菜類', '包心白菜', '樣品狀態:生,結球白菜,橢圓形; 前處理描述:混合均勻打碎', '大白菜,黃芽菜,包心白菜,卷心白菜,山東白菜,結球白菜', 14.4402, 1.1837, 0.1424, 0.059, 2.6018, 1.0263, 1.456, 13.65),
(525, '蔬菜類', '白菜芽', '樣品狀態:生,高冷蔬菜; 前處理描述:混合均勻打碎', '娃娃菜', 21.1881, 3.0945, 0.0696, 0.0354, 3.2046, 2.1973, 1.1621, 21.86),
(526, '蔬菜類', '白鳳菜', '樣品狀態:生; 前處理描述:去粗莖,混合均勻打碎', '白蓊菜', 27.308, 2, 0.4, NULL, 4.8, 3.3, NULL, 28),
(527, '蔬菜類', '紅鳳菜', '樣品狀態:生; 前處理描述:去粗莖,混合均勻打碎', '紅蓊菜,紅菜,紅葉,紫背天葵,雙色三七草,天青地紅,地黃菜,腳目草', 22.4936, 2.115, 0.3801, NULL, 3.531, 2.5915, NULL, 13.2643),
(528, '蔬菜類', '豆瓣菜', '樣品狀態:生; 前處理描述:混合均勻打碎', '西洋菜,水芥(田/應/蕹)菜,無心芥(菜),廣東芥菜,微子蔊菜,風花菜,水生山葵菜,麥藍菜,角菜', 20.5147, 2.17, 0.29, NULL, 3.18, 1.96, NULL, 45),
(529, '蔬菜類', '明日葉', '樣品狀態:生; 前處理描述:混合均勻打碎', '鹹草,明日草,長壽草,八丈草,還陽草,珍立草,海峰人參,天賜草', 56.7617, 1.434, 0.7918, 0.2679, 11.8916, 6.1288, 3.07, 4.066),
(530, '蔬菜類', '山芹菜', '樣品狀態:生; 前處理描述:混合均勻打碎', '鴨兒芹,三葉芹,三葉山芹菜', 27.9017, 2.126, 0.25, 0.1006, 5.1895, 3.4267, 0.486, 1.82),
(531, '蔬菜類', '芹菜平均值', '樣品狀態:生,本地種; 前處理描述:去根部及葉,混合均勻打碎', '旱芹,藥芹,洋芹,白芹,塘蒿,和蘭鴨兒芹', 15.3823, 0.7933, 0.1288, NULL, 3.135, 1.3543, NULL, 65.4593),
(532, '蔬菜類', '芹菜(青梗)', '樣品狀態:生,本地種; 前處理描述:去根部及葉,混合均勻打碎', '旱芹,藥芹,洋芹,白芹,塘蒿,和蘭鴨兒芹', 12.3242, 0.779, 0.098, NULL, 2.4264, 1.1431, NULL, 46.2355),
(533, '蔬菜類', '芹菜', '樣品狀態:生,本地種; 前處理描述:去根部及葉,混合均勻打碎', '旱芹,藥芹,洋芹,白芹,塘蒿,和蘭鴨兒芹', 18.4403, 0.8075, 0.1595, NULL, 3.8435, 1.5655, NULL, 84.6831),
(534, '蔬菜類', '西洋芹菜', '樣品狀態:生,西洋種; 前處理描述:去根部及葉,混合均勻打碎', '美國芹菜,洋芹菜,金白芹菜,巨無霸芹菜', 11.1594, 0.3783, 0.1761, 0.0698, 2.2293, 1.5916, 1.318, 87.2866),
(535, '蔬菜類', '大心芥菜', '樣品狀態:生; 前處理描述:去外皮,混合均勻打碎', '大心菜,菜心,大骨芥菜,大莖菜', 12.5392, 0.9815, 0.0329, NULL, 2.4852, 0.9544, NULL, 12.4683),
(536, '蔬菜類', '大芥菜', '樣品狀態:生; 前處理描述:去粗根,混合均勻打碎', '芥菜,大心芥菜,大葉芥菜,長年菜,孤腰菜', 19.1256, 0.75, 0.48, NULL, 3.37, 1.58, NULL, 35),
(537, '蔬菜類', '包心芥菜', '樣品狀態:生; 前處理描述:去外葉及粗莖,混合均勻打碎', '包心刈菜,捲心芥菜', 17.1009, 1.0105, 0.4742, 0.1459, 2.6883, 1.3728, 1.385, 14.5552),
(538, '蔬菜類', '芥菜平均值', '樣品狀態:生; 前處理描述:去根部,混合均勻打碎', '刈菜,大菜,芥葉菜,雞冠菜,孤腰菜', 19.0774, 1.5375, 0.1595, 0, 3.5165, 1.6401, 0.7931, 8.7584),
(539, '蔬菜類', '芥菜', '樣品狀態:生; 前處理描述:去根部,混合均勻打碎', '刈菜,大菜,芥葉菜,雞冠菜,孤腰菜', 17.7386, 1.6025, 0.1273, NULL, 3.1986, 1.5489, 1.2971, 3.2183),
(540, '蔬菜類', '雪裡蕻', '樣品狀態:生,芥菜; 前處理描述:去根部,混合均勻打碎', '雪裡(裏)紅,雪菜,多葉藺蕓苔,千筋葉菜,春不老', 20.4162, 1.4725, 0.1917, 0, 3.8343, 1.7313, 0.289, 14.2985),
(541, '蔬菜類', '抱子芥菜', '樣品狀態:生; 前處理描述:去粗梗,混合均勻打碎', '娃娃菜', 20.8736, 2.103, 0.0542, 0.0213, 3.8231, 1.8277, 1.65, 3.9),
(542, '蔬菜類', '芥藍菜', '樣品狀態:生; 前處理描述:去粗莖,混合均勻打碎', '芥蘭菜,格藍菜,綠葉甘藍,佛光菜,隔暝仔菜', 19.9143, 1.738, 0.3473, 0.0942, 3.1933, 1.9402, 0, 26.7996),
(543, '蔬菜類', '芥藍芽', '樣品狀態:生; 前處理描述:去粗莖,混合均勻打碎', '菜嬰,格藍菜嬰', 26.223, 2.223, 0.3294, NULL, 4.5235, 1.9496, NULL, 6.9532),
(544, '蔬菜類', '芫荽', '樣品狀態:生; 前處理描述:去根部,混合均勻打碎', '香菜,香荽,胡荽,蒝荽,芫蓑,松鬚菜', 25.9745, 2.2565, 0.293, NULL, 4.5154, 3.2146, NULL, 16.8787),
(545, '蔬菜類', '紅梗珍珠菜', '樣品狀態:生; 前處理描述:混合均勻打碎', '角菜,香芹(甜)菜,山芹菜,甜菜,乳白艾,香甜菜,納艾香', 37.2118, 2.6, 1.025, NULL, 5.595, 6.4, NULL, 11.5),
(546, '蔬菜類', '食茱萸', '樣品狀態:生; 前處理描述:混合均勻打碎', '刺楤,紅刺楤,刺江某,越椒,艾子,茱萸,刺公牡', 126.509, 11.9, 0.3, NULL, 23.8, 16.8, NULL, 5),
(547, '蔬菜類', '香樁', '樣品狀態:生; 前處理描述:混合均勻打碎', '椿,紅椿(樹),椿樹,杶,春芽(陽)樹,椿樗,櫄,虎目樹,大眼桐,栲,大紅椿樹', 99.3469, 4.3, 1.47, NULL, 19.43, 5.94, NULL, 17),
(548, '蔬菜類', '茴香', '樣品狀態:生; 前處理描述:混合均勻打碎', '蘹香,小茴香,茴香子,臭蒝荽,客人蒝荽,香絲菜,茴香八角珠,蒝荽', 23.8996, 2.198, 0.2436, 0, 4.1287, 2.8285, 0.721, 50.0422),
(549, '蔬菜類', '馬齒莧', '樣品狀態:生; 前處理描述:混合均勻打碎', '豬母乳(菜/草),寶釧菜,長命菜,荷蘭菜,馬尺莧,瓜子菜,五行(才)草,馬子菜,地馬菜,醬瓣頭草', 13.824, 1.2, 0.4, NULL, 1.88, 0.4, NULL, 94),
(550, '蔬菜類', '茼蒿', '樣品狀態:生; 前處理描述:混合均勻打碎', '茼蒿菜,春菊,打某(妻)菜,苳蒿菜,花冠菊,艾菜,蓬蒿,菊蒿菜,菊花菜,實盡菜', 15.7387, 1.741, 0.3063, 0.0791, 2.2086, 1.583, 0, 69.0844),
(551, '蔬菜類', '日本茼蒿(有機)', '樣品狀態:生; 前處理描述:混合均勻打碎', '春菊,山茼蒿,小葉茼蒿', 25.9168, 1.93, 0.24, 0.0584, 4.8337, 2.9701, 0.429, 179.22),
(552, '蔬菜類', '昭和草', '樣品狀態:生; 前處理描述:混合均勻打碎', '山茼蒿,野茼蒿,太子原,飛機草,神仙草', 26.365, 2.2, 0.7, NULL, 3.78, NULL, NULL, 9),
(553, '蔬菜類', '隼人瓜苗', '樣品狀態:生; 前處理描述:混合均勻打碎', '隼人瓜鬚,佛手瓜苗(鬚),香櫞瓜苗(鬚),梨瓜苗(鬚),番瓜鬚(龍鬚菜是誤用)', 23.7434, 3.28, 0.1633, NULL, 3.5341, 2.2928, NULL, 3.3429),
(554, '蔬菜類', '白莧菜', '樣品狀態:生; 前處理描述:去根部及粗莖,混合均勻打碎', '杏菜,荇菜,莕菜,茵菜,白杏菜,白荇菜', 17.4757, 1.892, 0.3045, NULL, 2.5564, 2.4052, NULL, 19.8572),
(555, '蔬菜類', '紅莧菜', '樣品狀態:生; 前處理描述:去根部及粗莖,混合均勻打碎', '紅莧,虎菜,紅虎莧,赤莧,紅杏(荇)菜,赤杏菜,紫杏(莧)菜', 21.8817, 2.6233, 0.2543, 0.1242, 3.3026, 3.0745, 0.186, 12.3325),
(556, '蔬菜類', '野莧菜', '樣品狀態:生; 前處理描述:混合均勻打碎', '野莧(杏),綠莧,豬莧,鳥仔莧(杏),假莧(杏)菜,山荇(杏,莧)菜,', 40.638, 6.3, 0.6, NULL, 4.9, 4.28, NULL, 20.1),
(557, '蔬菜類', '紫蘇', '樣品狀態:生; 前處理描述:去莖,取葉片,混合均勻打碎', '蘇草,紅(赤/綠/青)紫蘇,桂荏', 70.5075, 5.526, 1.1632, 0.6704, 11.8701, 8.8278, 0.3621, 0.59),
(558, '蔬菜類', '菠菜', '樣品狀態:生; 前處理描述:去根部,混合均勻打碎', '菠菱菜,赤根菜,飛龍菜,角菜,波斯草,波斯菜,波菱菜', 17.8904, 2.1873, 0.3151, 0.1134, 2.4416, 1.9233, 0, 43.4573),
(559, '蔬菜類', '菠菜(葉)(有機)', '樣品狀態:生,冷藏袋裝,只取葉子部位; 前處理描述:混合均勻打碎', '菠菱菜,赤根菜,飛龍菜,角菜,波斯草,波斯菜,波菱菜', 25.6494, 3.268, 0.38, 0.1024, 3.5658, 2.5217, 0, 106.45),
(560, '蔬菜類', '冷凍菠菜', '樣品狀態:冷凍包裝; 前處理描述:混合均勻打碎', '菠菱菜,赤根菜,飛龍菜,角菜,波斯草,波斯菜,波菱菜', 17.2126, 2.14, 0.04, NULL, 2.89, 2.12, NULL, 46),
(561, '蔬菜類', '菾菜', '樣品狀態:生; 前處理描述:混合均勻打碎', '葉用甜菜,莙薘菜,牛皮菜,豬乸菜', 20.7438, 2.004, 0.1392, NULL, 3.6739, 2.0166, 0.563, 107.709),
(562, '蔬菜類', '黃金菾菜', '樣品狀態:生; 前處理描述:去根部,混合均勻打碎', '黃金火焰菜,君達菜,甜菜', 18.3533, 2.43, 0.2012, 0.085, 2.6417, 2.3961, 0.432, 77.122),
(563, '蔬菜類', '落葵', '樣品狀態:生,白落葵; 前處理描述:混合均勻打碎', '皇宮菜,蟳菜,胭(臙)脂菜,紅落葵,潺菜,蔠菜,藤葵,藤菜,天葵,御菜,牛皮凍', 33.1824, 2.672, 0.3166, NULL, 6.0338, 2.313, NULL, 49.1847),
(564, '蔬菜類', '藤三七', '樣品狀態:生,洋落葵; 前處理描述:混合均勻打碎', '洋落葵,蔓安迪,落葵安迪,藤子三七,雲南白藥,小年藥,馬德拉藤,金錢珠,中枝蓮(習以川七誤稱)', 21.2508, 1.635, 0.5346, 0.2364, 3.2032, 1.1842, 0, 25.0731),
(565, '蔬菜類', '不結球萵苣平均值', '樣品狀態:生,不結球萵苣; 前處理描述:混合均勻打碎', '葉萵苣,葉萵,萵仔菜,刈葉萵苣,生菜,妹(媚)仔菜,鵝仔菜(草),春不老,印度萵苣', 16.1684, 1.1184, 0.2595, 0.0755, 2.8375, 1.6455, 0.6254, 8.3358),
(566, '蔬菜類', '奶油萵苣(日本種)', '樣品狀態:生,不結球萵苣; 前處理描述:去根部,混合均勻打碎', '葉萵苣,葉萵,萵仔菜,刈葉萵苣,生菜,妹(媚)仔菜,鵝仔菜(草),春不老,印度萵苣', 15.6951, 1.093, 0.3087, 0.1122, 2.6276, 1.4345, 0.6525, 1.227),
(567, '蔬菜類', '紅葉萵苣(荷蘭種）', '樣品狀態:生,不結球萵苣; 前處理描述:去根部,混合均勻打碎', '彩葉萵苣,彩色媚仔菜,紅色萵苣菜,紅萵仔菜', 15.658, 1.364, 0.2898, 0.0792, 2.4766, 2.0311, 0.5651, 0.913),
(568, '蔬菜類', '廣東萵苣', '樣品狀態:生,不結球萵苣; 前處理描述:去根部,混合均勻打碎', '皺葉萵苣,縮葉萵苣,皺萵仔菜,皺妹菜', 19.8449, 1.023, 0.2065, 0.04, 3.958, 1.7138, NULL, 10.7927),
(569, '蔬菜類', '蘿美萵苣', '樣品狀態:生,不結球萵苣; 前處理描述:去根部,混合均勻打碎', '葉萵苣,葉萵,萵仔菜,刈葉萵苣,生菜,妹(媚)仔菜,鵝仔菜(草),春不老,印度萵苣(大陸妹)', 13.4757, 0.9937, 0.2329, 0.0775, 2.2879, 1.4026, 0.6586, 20.4103),
(570, '蔬菜類', '本島萵苣(土植)(1月取樣)', '樣品狀態:生; 前處理描述:混合均勻打碎', '葉萵苣,葉萵,萵仔菜,刈葉萵苣,生菜,妹(媚)仔菜,鵝仔菜(草),春不老,印度萵苣', 16.7144, 1.563, 0.354, NULL, 2.476, 1.5474, NULL, 65.466),
(571, '蔬菜類', '本島萵苣(土植)(3月取樣)', '樣品狀態:生; 前處理描述:混合均勻打碎', '葉萵苣,葉萵,萵仔菜,刈葉萵苣,生菜,妹(媚)仔菜,鵝仔菜(草),春不老,印度萵苣', 17.7524, 0.337, 0.2505, 0.0641, 3.7879, 2.0794, 0.319, 8.767),
(572, '蔬菜類', '本島萵苣(土植)(4月取樣)', '樣品狀態:生; 前處理描述:混合均勻打碎', '葉萵苣,葉萵,萵仔菜,刈葉萵苣,生菜,妹(媚)仔菜,鵝仔菜(草),春不老,印度萵苣', 16.7502, 0.874, 0.203, NULL, 3.2721, 1.3855, NULL, 45.7111),
(573, '蔬菜類', '本島萵苣(土植)(7月取樣)', '樣品狀態:生; 前處理描述:混合均勻打碎', '葉萵苣,葉萵,萵仔菜,刈葉萵苣,生菜,妹(媚)仔菜,鵝仔菜(草),春不老,印度萵苣', 23.4994, 1.364, 0.348, NULL, 4.3623, 1.7489, NULL, 90.1904),
(574, '蔬菜類', '本島萵苣(土植)(10月取樣)', '樣品狀態:生; 前處理描述:混合均勻打碎', '葉萵苣,葉萵,萵仔菜,刈葉萵苣,生菜,妹(媚)仔菜,鵝仔菜(草),春不老,印度萵苣', 13.8764, 1.142, 0.27, NULL, 2.2114, 1.1324, NULL, 7.46),
(575, '蔬菜類', '本島萵苣(水耕)(1月取樣)', '樣品狀態:生; 前處理描述:混合均勻打碎', '葉萵苣,葉萵,萵仔菜,刈葉萵苣,生菜,妹(媚)仔菜,鵝仔菜(草),春不老,印度萵苣', 13.7989, 1.561, 0.165, NULL, 2.1354, 1.5094, NULL, 2.694),
(576, '蔬菜類', '本島萵苣(水耕)(4月取樣)', '樣品狀態:生; 前處理描述:混合均勻打碎', '葉萵苣,葉萵,萵仔菜,刈葉萵苣,生菜,妹(媚)仔菜,鵝仔菜(草),春不老,印度萵苣', 14.8005, 0.97, 0.229, NULL, 2.6519, 1.3605, NULL, 2.1425),
(577, '蔬菜類', '本島萵苣(水耕)(7月取樣)', '樣品狀態:生; 前處理描述:混合均勻打碎', '葉萵苣,葉萵,萵仔菜,刈葉萵苣,生菜,妹(媚)仔菜,鵝仔菜(草),春不老,印度萵苣', 12.602, 1.442, 0.168, NULL, 1.902, 1.4191, NULL, 3.0983),
(578, '蔬菜類', '本島萵苣(水耕)(10月取樣)', '樣品狀態:生; 前處理描述:混合均勻打碎', '葉萵苣,葉萵,萵仔菜,刈葉萵苣,生菜,妹(媚)仔菜,鵝仔菜(草),春不老,印度萵苣', 11.5701, 1.144, 0.27, NULL, 1.6187, 1.0622, NULL, 2.85),
(579, '蔬菜類', '本島萵苣(有機)(1月取樣)', '樣品狀態:生; 前處理描述:混合均勻打碎', '葉萵苣,葉萵,萵仔菜,刈葉萵苣,生菜,妹(媚)仔菜,鵝仔菜(草),春不老,印度萵苣', 14.8851, 1.798, 0.026, NULL, 2.553, 2.03, NULL, 47.418),
(580, '蔬菜類', '本島萵苣(有機)(4月取樣)', '樣品狀態:生; 前處理描述:混合均勻打碎', '葉萵苣,葉萵,萵仔菜,刈葉萵苣,生菜,妹(媚)仔菜,鵝仔菜(草),春不老,印度萵苣', 18.7474, 1.063, 0.286, NULL, 3.4791, 1.556, NULL, 12.7215),
(581, '蔬菜類', '本島萵苣(有機)(7月取樣)', '樣品狀態:生; 前處理描述:混合均勻打碎', '葉萵苣,葉萵,萵仔菜,刈葉萵苣,生菜,妹(媚)仔菜,鵝仔菜(草),春不老,印度萵苣', 17.1753, 1.496, 0.31, NULL, 2.7336, 1.3731, NULL, 16.6427),
(582, '蔬菜類', '本島萵苣(有機)(10月取樣)', '樣品狀態:生; 前處理描述:混合均勻打碎', '葉萵苣,葉萵,萵仔菜,刈葉萵苣,生菜,妹(媚)仔菜,鵝仔菜(草),春不老,印度萵苣', 14.6738, 1.266, 0.28, NULL, 2.3111, 1.6821, NULL, 8.87),
(583, '蔬菜類', '水耕波士頓萵苣', '樣品狀態:生,半結球萵苣; 前處理描述:混合均勻打碎', NULL, 14.3018, 1.323, 0.74, 0.26, 1.1902, 0.9127, 0.288, 2.04),
(584, '蔬菜類', '結球萵苣', '樣品狀態:生; 前處理描述:混合均勻打碎', '球萵苣,包心萵苣,捲心萵苣,生菜,包心媚仔菜,結球妹仔菜', 13.4552, 0.653, 0.1011, NULL, 2.7944, 0.8951, 1.51, 7.243),
(585, '蔬菜類', '豌豆苗', '樣品狀態:生(高山嫩豆苗); 前處理描述:混合均勻打碎', '豆苗,豆鬚,荷蘭豆苗(鬚),飛龍豆苗', 31.3063, 3.7357, 0.4984, 0.1305, 4.448, 2.316, 0, 3.946),
(586, '蔬菜類', '龍葵', '樣品狀態:生; 前處理描述:混合均勻打碎', '黑甜菜,烏甜(田)菜,烏甜仔,烏子(克)菜,烏子茄,苦葵(菜),天茄子,天泡草,老鴉酸漿草', 25.8164, 3.8, 0.32, NULL, 3.38, 2.5, NULL, 32),
(587, '蔬菜類', '蕹菜(土植)(1月取樣)', '樣品狀態:生; 前處理描述:混合均勻打碎', '空心菜,應菜,壅菜,甕菜,草菜,無心菜,藤藤菜,竹葉菜,葛菜', 21.5859, 1.958, 0.331, NULL, 3.5091, 2.9047, NULL, 165.886),
(588, '蔬菜類', '蕹菜(土植)(4月取樣)', '樣品狀態:生; 前處理描述:混合均勻打碎', '空心菜,應菜,壅菜,甕菜,草菜,無心菜,藤藤菜,竹葉菜,葛菜', 19.9551, 1.706, 0.2122, 0.1009, 3.5152, 2.8677, 0, 112.913),
(589, '蔬菜類', '蕹菜(土植)(7月取樣)', '樣品狀態:生; 前處理描述:混合均勻打碎', '空心菜,應菜,壅菜,甕菜,草菜,無心菜,藤藤菜,竹葉菜,葛菜', 17.0068, 1.917, 0.136, NULL, 2.781, 1.8467, NULL, 97.0295),
(590, '蔬菜類', '蕹菜(土植)(10月取樣)', '樣品狀態:生; 前處理描述:混合均勻打碎', '空心菜,應菜,壅菜,甕菜,草菜,無心菜,藤藤菜,竹葉菜,葛菜', 17.4629, 1.809, 0.29, NULL, 2.64, 1.9426, NULL, 121.8),
(591, '蔬菜類', '蕹菜(水耕)(1月取樣)', '樣品狀態:生; 前處理描述:混合均勻打碎', '空心菜,應菜,壅菜,甕菜,草菜,無心菜,藤藤菜,竹葉菜,葛菜', 27.3093, 2.704, 0.298, NULL, 4.5463, 2.7767, NULL, 14.579),
(592, '蔬菜類', '蕹菜(水耕)(4月取樣)', '樣品狀態:生; 前處理描述:混合均勻打碎', '空心菜,應菜,壅菜,甕菜,草菜,無心菜,藤藤菜,竹葉菜,葛菜', 23.5584, 2.2, 0.127, NULL, 4.2901, 2.7361, NULL, 13.2092),
(593, '蔬菜類', '蕹菜(水耕)(7月取樣)', '樣品狀態:生; 前處理描述:混合均勻打碎', '空心菜,應菜,壅菜,甕菜,草菜,無心菜,藤藤菜,竹葉菜,葛菜', 17.1858, 1.919, 0.185, NULL, 2.7204, 1.8006, NULL, 8.1395),
(594, '蔬菜類', '蕹菜(水耕)(10月取樣)', '樣品狀態:生; 前處理描述:混合均勻打碎', '空心菜,應菜,壅菜,甕菜,草菜,無心菜,藤藤菜,竹葉菜,葛菜', 22.7065, 2.185, 0.26, NULL, 3.7963, 2.8288, NULL, 29.29),
(595, '蔬菜類', '蕹菜(有機)(4月取樣)', '樣品狀態:生; 前處理描述:混合均勻打碎', '空心菜,應菜,壅菜,甕菜,草菜,無心菜,藤藤菜,竹葉菜,葛菜', 25.8152, 1.937, 0.308, NULL, 4.657, 2.8259, NULL, 62.0464),
(596, '蔬菜類', '蕹菜(有機)(10月取樣)', '樣品狀態:生; 前處理描述:混合均勻打碎', '空心菜,應菜,壅菜,甕菜,草菜,無心菜,藤藤菜,竹葉菜,葛菜', 19.3562, 1.711, 0.37, NULL, 3.0196, 2.3195, NULL, 33.02),
(597, '蔬菜類', '水蕹菜', '樣品狀態:生; 前處理描述:混合均勻打碎', NULL, 23.6005, 2.61, 0.4778, 0.2463, 3.2726, 2.3517, 0.319, 41.13),
(598, '蔬菜類', '蘿蔔葉', '樣品狀態:生; 前處理描述:混合均勻打碎', '葉蘿蔔', 13.6798, 1.714, 0.1771, NULL, 1.9761, 1.9234, 0, 213.518),
(599, '蔬菜類', '花椰菜', '樣品狀態:生; 前處理描述:混合均勻打碎', '花菜,菜花,白花菜,白菜花', 23.1991, 1.7823, 0.131, NULL, 4.47, 2.0356, 2.524, 14.3515),
(600, '蔬菜類', '冷凍花椰菜', '樣品狀態:冷凍包裝; 前處理描述:混合均勻打碎', '花菜,菜花,白花菜,白菜花', 21.2569, 1.27, 0.05, NULL, 4.49, 3.16, NULL, 33),
(601, '蔬菜類', '紫色花椰菜', '樣品狀態:生; 前處理描述:混合均勻打碎', NULL, 40.0602, 3.115, 0.288, NULL, 7.5611, 3.9023, NULL, 19.7368),
(602, '蔬菜類', '青花菜(1999年取樣)', '樣品狀態:生; 前處理描述:混合均勻打碎', '(青花菜非綠色花椰菜)青(綠)花菜,美國花菜,青花苔,花(青)菜苔,菜苔,花菜苞', 28.4278, 3.6947, 0.1737, 0.042, 4.4343, 3.0878, 1.12, 15.3483),
(603, '蔬菜類', '青花菜(2021年取樣)', '樣品狀態:生; 前處理描述:去粗梗,混合均勻打碎', '(青花菜非綠色花椰菜)青(綠)花菜,美國花菜,青花苔,花(青)菜苔,菜苔,花菜苞', 37.9319, 3.439, 0.4072, 0.2023, 6.5419, 2.7777, 1.792, 13.11),
(604, '蔬菜類', '冷凍青花菜', '樣品狀態:冷凍包裝; 前處理描述:混合均勻打碎', '(青花菜非綠色花椰菜)青(綠)花菜,美國花菜,青花苔,花(青)菜苔,菜苔,花菜苞', 25.2669, 2.525, 0.156, 0, 4.4476, 3.263, NULL, 10.8178),
(605, '蔬菜類', '青花菜筍', '樣品狀態:生; 前處理描述:混合均勻打碎', NULL, 32.3202, 3.03, 0.5241, 0.2837, 5.1269, 2.9941, 0.908, 6.356),
(606, '蔬菜類', '花椰菜乾', '樣品狀態:乾貨; 前處理描述:混合均勻打碎', NULL, 290.779, 15.967, 0.6137, NULL, 62.515, 27.6769, NULL, 176.906),
(607, '蔬菜類', '金針菜', '樣品狀態:生; 前處理描述:混合均勻打碎', '萱草,金針花,金針,黃花(菜),萱花', 39.5529, 2.3853, 0.5367, 0.2343, 7.3875, 2.8927, 2.956, 1.5571),
(608, '蔬菜類', '金針菜乾', '樣品狀態:乾貨; 前處理描述:混合均勻打碎', '萱草,金針花,金針,黃花(菜),萱花', 307.132, 14.255, 1.758, NULL, 65.4024, 19.7838, NULL, 1484.85),
(609, '蔬菜類', '洛神花乾', '樣品狀態:乾貨; 前處理描述:混合均勻打碎', '玫瑰茄,洛神葵,洛神果,洛濟葵', 306.021, 9, 0.5532, 0.3377, 71.2334, 34.903, 4.407, 16.9),
(610, '蔬菜類', '絲瓜花', '樣品狀態:生; 前處理描述:混合均勻打碎', '菜瓜花', 31.3149, 3.9, 0.27, NULL, 4.83, 3.1, NULL, 6),
(611, '蔬菜類', '冬瓜平均值', '樣品狀態:生; 前處理描述:去皮,混合均勻打碎', '白瓜,東瓜,枕瓜,水芝,地芝', 10.8078, 0.3998, 0.0711, 0.0277, 2.3502, 1.1036, 1.402, 1.8147),
(612, '蔬菜類', '冬瓜', '樣品狀態:生,大果; 前處理描述:去皮,混合均勻打碎', '白瓜,東瓜,枕瓜,水芝,地芝', 12.7817, 0.4305, 0.1235, NULL, 2.7231, 1.1178, NULL, 2.7948),
(613, '蔬菜類', '香芋冬瓜', '樣品狀態:生,小果; 前處理描述:去皮,混合均勻打碎', '白瓜,東瓜,枕瓜,水芝,地芝', 8.8339, 0.369, 0.0186, 0.0072, 1.9773, 1.0894, 1.402, 0.8346),
(614, '蔬菜類', '冬瓜(2022年取樣)', '樣品狀態:生,大果; 前處理描述:去皮及囊籽,混合均勻打碎', '白瓜,東瓜,枕瓜,水芝,地芝', 20.7987, 0.411, 0, 0, 5.0569, 1.2004, 1.544, 0),
(615, '蔬菜類', '南瓜平均值', '樣品狀態:生; 前處理描述:去皮及籽,混合均勻打碎', '金瓜,飯瓜,番(翻)瓜,倭(窩)瓜,紅(冬/西洋)南瓜,南瓜,北瓜,玉瓜,筍瓜', 74.0847, 1.8516, 0.1983, 0.0742, 17.3266, 2.5015, 5.442, 1.3493),
(616, '蔬菜類', '日本南瓜', '樣品狀態:生; 前處理描述:去皮及籽,混合均勻打碎', '金瓜,飯瓜,番(翻)瓜,倭(窩)瓜,紅(冬/西洋)南瓜,南瓜,北瓜,玉瓜,筍瓜', 85.8109, 0.582, 0.388, NULL, 20.7791, 3.1226, NULL, 3.0481),
(617, '蔬菜類', '台灣南瓜', '樣品狀態:生; 前處理描述:去皮及籽,混合均勻打碎', '金瓜,飯瓜,番(翻)瓜,倭(窩)瓜,紅(冬/西洋)南瓜,南瓜,北瓜,玉瓜,筍瓜', 48.9517, 1.6655, 0.1665, NULL, 11.0755, 1.3862, NULL, 0.5413),
(618, '蔬菜類', '栗子南瓜', '樣品狀態:生; 前處理描述:去皮及籽,混合均勻打碎', '金瓜,飯瓜,番(翻)瓜,倭(窩)瓜,紅(冬/西洋)南瓜,南瓜,北瓜,玉瓜,筍瓜', 85.5911, 1.371, 0.1636, 0.0612, 20.6743, 3.2683, 5.442, 0.762),
(619, '蔬菜類', '菊花南瓜', '樣品狀態:生; 前處理描述:去皮及籽,混合均勻打碎', '金瓜,飯瓜,番(翻)瓜,倭(窩)瓜,紅(冬/西洋)南瓜,南瓜,北瓜,玉瓜,筍瓜', 75.985, 3.788, 0.075, NULL, 16.7776, 2.2288, NULL, 1.0456),
(620, '蔬菜類', '胡瓜', '樣品狀態:生; 前處理描述:去皮及籽,混合均勻打碎', '大黃瓜,刺瓜,黃瓜,生瓜,王瓜,花瓜,黑瓜,大瓜', 13.8438, 0.6553, 0.0963, NULL, 2.9028, 0.5271, 2.323, 3.371),
(621, '蔬菜類', '花胡瓜(有機)', '樣品狀態:生; 前處理描述:去蒂,混合均勻打碎', '小黃瓜,花瓜,小胡瓜,小刺瓜', 14.93, 0.759, 0.1, 0.0682, 3.1037, 0.6755, 1.314, 1.33),
(622, '蔬菜類', '苦瓜(白皮)', '樣品狀態:生,白苦瓜; 前處理描述:去蒂及囊籽,混合均勻打碎', '錦荔枝,癩蒲萄,涼瓜,癩瓜,紅姑娘', 19.3817, 0.8833, 0.1188, 0.0869, 4.1213, 2.8465, 0.45, 3.3065),
(623, '蔬菜類', '苦瓜(青皮)', '樣品狀態:生,白苦瓜; 前處理描述:去蒂及囊籽,混合均勻打碎', '錦荔枝,癩蒲萄,涼瓜,癩瓜,紅姑娘', 19.8198, 0.884, 0.1336, 0.0947, 4.2014, 3.6097, 0.5204, 0.6295),
(624, '蔬菜類', '珍珠苦瓜', '樣品狀態:生,青苦瓜; 前處理描述:去蒂及囊籽,混合均勻打碎', '錦荔枝,癩蒲萄,涼瓜,癩瓜,紅姑娘(青苦瓜)', 18.627, 0.741, 0.0558, NULL, 4.1586, 1.9424, NULL, 0.4637),
(625, '蔬菜類', '野苦瓜', '樣品狀態:生; 前處理描述:去蒂及囊籽,混合均勻打碎', '山苦瓜,青小苦瓜,小苦瓜,野生苦瓜,短苦瓜,野癩瓜', 29.9788, 1.687, 0.5895, NULL, 5.2884, 4.0851, NULL, 6.0663),
(626, '蔬菜類', '隼人瓜', '樣品狀態:生; 前處理描述:去蒂,混合均勻打碎', '梨瓜,壽瓜,合掌瓜,安南瓜,香瓜仔,拳頭瓜,佛掌瓜、香圓瓜,香櫞瓜,佛手瓜,瓦瓜', 23.1948, 0.737, 0.1381, NULL, 5.1559, 1.5632, 2.7613, 6.4467),
(627, '蔬菜類', '隼人瓜(2023年取樣)', '樣品狀態:生; 前處理描述:去蒂,混合均勻打碎', '梨瓜,壽瓜,合掌瓜,安南瓜,香瓜仔,拳頭瓜,佛掌瓜、香圓瓜,香櫞瓜,佛手瓜,瓦瓜', 21.5025, 0.704, 0.23, 0.1555, 4.5469, 1.4708, 2.936, 0),
(628, '蔬菜類', '白皮蛇瓜', '樣品狀態:生; 前處理描述:去皮,混合均勻打碎', '蛇王瓜,毛烏瓜', 18.7305, 1.44, 0.31, NULL, 3.17, 1.24, NULL, 22),
(629, '蔬菜類', '綠皮蛇瓜', '樣品狀態:生; 前處理描述:去皮,混合均勻打碎', '蛇王瓜,毛烏瓜', 31.879, 1.9, 0.6, NULL, 5.61, 2.9, NULL, 10),
(630, '蔬菜類', '絲瓜', '樣品狀態:生; 前處理描述:去皮,混合均勻打碎', '菜瓜,布瓜,蠻瓜,天絲瓜,水瓜,天羅,天絡,仙人拐,魚鰦', 18.6884, 1.062, 0.0982, 0.0509, 3.8677, 1.025, 2.08, 0.3157),
(631, '蔬菜類', '稜角絲瓜', '樣品狀態:生; 前處理描述:去皮,混合均勻打碎', '澎湖絲瓜,十角絲瓜,十捻菜瓜,角瓜,廣東絲瓜,雨傘絲瓜,金門絲瓜,香港絲瓜', 20.3366, 0.896, 0.2195, NULL, 4.1415, 1.2225, NULL, 5.3846),
(632, '蔬菜類', '越瓜', '樣品狀態:生; 前處理描述:去蒂及籽,混合均勻打碎', '醃瓜,菴瓜,梢瓜,酥瓜,甜瓜,羊角瓜,稍瓜,生瓜,白瓜,青瓜,百香胡瓜', 18.1169, 0.626, 0.0685, NULL, 4.0778, 0.9902, NULL, 2.2004),
(633, '蔬菜類', '蒲瓜平均值', '樣品狀態:生; 前處理描述:去皮,混合均勻打碎', '扁蒲,蒲仔,瓠子(瓜/餔),匏仔(瓜),葫蘆瓜,瓢簞,天瓜,龍蛋瓜,蒲(葫/壺)蘆', 17.7862, 0.4894, 0.1246, 0.0571, 3.9644, 1.2963, 1.9815, 0.639),
(634, '蔬菜類', '蒲瓜(長形)', '樣品狀態:生; 前處理描述:去皮,混合均勻打碎', '扁蒲,蒲仔,瓠瓜,匏瓜,葫蘆瓜,瓢簞,天瓜,龍蛋瓜,蒲(葫/壺)蘆', 18.6325, 0.504, 0.1175, NULL, 4.1868, 1.321, NULL, 1.6656),
(635, '蔬菜類', '蒲瓜(圓形)', '樣品狀態:生; 前處理描述:去皮,混合均勻打碎', '扁蒲,蒲仔,瓠瓜,匏瓜,葫蘆瓜,瓢簞,天瓜,龍蛋瓜,蒲(葫/壺)蘆', 17.9223, 0.619, 0.063, 0.0289, 4.0444, 1.3234, 2.42, 0.4827),
(636, '蔬菜類', '花蒲瓜(圓形)', '樣品狀態:生; 前處理描述:去皮,混合均勻打碎', '扁蒲,蒲仔,瓠瓜,匏瓜,葫蘆瓜,瓢簞,天瓜,龍蛋瓜,蒲(葫/壺)蘆', 14.9133, 0.3345, 0.048, NULL, 3.4962, 1.2409, 1.543, 0.4075),
(637, '蔬菜類', '葫蘆瓜', '樣品狀態:生; 前處理描述:去皮,混合均勻打碎', '扁蒲,蒲仔,瓠瓜,匏瓜,葫蘆瓜,瓢簞,天瓜,龍蛋瓜,蒲(葫/壺)蘆', 19.6769, 0.5, 0.27, NULL, 4.13, 1.3, NULL, 0),
(638, '蔬菜類', '黃櫛瓜', '樣品狀態:生; 前處理描述:去頭尾,混合均勻打碎', NULL, 15.1319, 1.45, 0.1113, NULL, 2.667, 0.936, NULL, 0.2772),
(639, '蔬菜類', '綠櫛瓜', '樣品狀態:生; 前處理描述:去頭尾,混合均勻打碎', NULL, 13.0889, 2.18, 0.0467, NULL, 1.7914, 0.9453, NULL, 0.4363),
(640, '蔬菜類', '枸杞乾', '樣品狀態:乾貨; 前處理描述:混合均勻打碎', '枸杞,地骨子,甘杞,杞子,枸忌,苦杞,血杞,天精子', 346.695, 12.295, 1.3, 0.2083, 77.8464, 11.2221, 44.139, 521.2),
(641, '蔬菜類', '長茄子', '樣品狀態:生,長茄; 前處理描述:去蒂,混合均勻打碎', '茄,茄仔,紅皮菜,紅茄(菜),紅茄仔,落蘇,崑崙瓜,紫瓜,酪酥,小蓏,長茄', 25.3298, 1.2165, 0.1621, 0.1144, 5.3297, 2.7473, 2.252, 2.1132),
(642, '蔬菜類', '圓茄子', '樣品狀態:生,圓茄; 前處理描述:去蒂,混合均勻打碎', '日本茄子,迷你茄', 20.6965, 1.019, 0.04, NULL, 4.5364, 1.5974, NULL, 1.7),
(643, '蔬菜類', '大番茄平均值(紅色系)', '樣品狀態:生,紅色系大果; 前處理描述:去蒂,混合均勻打碎', '柑仔蜜,甘仔(阿)蜜,草柿,臭柿仔,西紅柿,小金瓜,番柿,六月柿,洋柿(茄)子,紅茄,毛臘果', 18.5684, 0.7743, 0.054, 0.0243, 4.125, 1.0025, 2.1783, 2.1279),
(644, '蔬菜類', '牛番茄', '樣品狀態:生,紅色系大果; 前處理描述:去蒂,混合均勻打碎', '柑(甘)仔蜜,草(番,西紅,六月)柿,臭柿仔,小金瓜,洋柿(茄)子,紅茄,毛臘果', 18.5931, 0.7085, 0.1156, 0.0521, 4.0434, 1.0252, 2.1783, 1.6748),
(645, '蔬菜類', '紅番茄', '樣品狀態:生,紅色系大果; 前處理描述:去蒂,混合均勻打碎', '柑(甘)仔蜜,草(番,西紅,六月)柿,臭柿仔,小金瓜,洋柿(茄)子,紅茄,毛臘果', 19.6986, 0.885, 0.0464, NULL, 4.3568, 0.8136, NULL, 2.055),
(646, '蔬菜類', '桃太郎番茄', '樣品狀態:生,紅色系大果; 前處理描述:去蒂,混合均勻打碎', '柑(甘)仔蜜,草(番,西紅,六月)柿,臭柿仔,小金瓜,洋柿(茄)子,紅茄,毛臘果', 17.4134, 0.7295, 0, NULL, 3.9749, 1.1688, NULL, 2.654),
(647, '蔬菜類', '黃番茄', '樣品狀態:生,黃色系大果; 前處理描述:去蒂,混合均勻打碎', '柑(甘)仔蜜,草(番,西紅,六月)柿,臭柿仔,小金瓜,洋柿(茄)子,紅茄,毛臘果', 23.3043, 0.924, 0.044, 0, 5.2603, 0.4847, 2.7295, 3.094),
(648, '蔬菜類', '大番茄平均值(綠色系)', '樣品狀態:生,綠色系大果; 前處理描述:去蒂,混合均勻打碎', '柑仔蜜,甘仔(阿)蜜,草柿,臭柿仔,西紅柿,小金瓜,番柿,六月柿,洋柿(茄)子,紅茄,毛臘果', 21.9613, 0.7128, 0.0667, NULL, 5.0091, 0.9793, 2.865, 3.0896),
(649, '蔬菜類', '粉柿番茄', '樣品狀態:生,綠色系大果; 前處理描述:去蒂,混合均勻打碎', '柑(甘)仔蜜,草(番,西紅,六月)柿,臭柿仔,小金瓜,洋柿(茄)子,紅茄,毛臘果(粉柿仔)', 17.9897, 0.771, 0.0218, NULL, 4.048, 0.8243, NULL, 2.152),
(650, '蔬菜類', '黑柿番茄', '樣品狀態:生,綠色系大果; 前處理描述:去蒂,混合均勻打碎', '柑(甘)仔蜜,草(番,西紅,六月)柿,臭柿仔,小金瓜,洋柿(茄)子,紅茄,毛臘果', 23.3283, 0.42, 0.0613, NULL, 5.5679, 0.9807, 2.865, 1.218),
(651, '蔬菜類', '綠番茄', '樣品狀態:生,綠色系大果; 前處理描述:去蒂,混合均勻打碎', '柑(甘)仔蜜,草(番,西紅,六月)柿,臭柿仔,小金瓜,洋柿(茄)子,紅茄,毛臘果', 24.5658, 0.9475, 0.117, NULL, 5.4113, 1.1329, NULL, 5.8989),
(652, '蔬菜類', '小番茄平均值(紅色系)', '樣品狀態:生,紅色系小果; 前處理描述:去蒂,混合均勻打碎', '柑仔蜜,甘仔(阿)蜜,草柿,臭柿仔,西紅柿,小金瓜,番柿,六月柿,洋柿(茄)子,紅茄,毛臘果', 32.6934, 0.9208, 0.1778, 0.1033, 7.3827, 1.6731, 5.08, 5.877),
(653, '蔬菜類', '聖女小番茄', '樣品狀態:生,紅色系小果; 前處理描述:去蒂,混合均勻打碎', '柑(甘)仔蜜,草(番,西紅,六月)柿,臭柿仔,小金瓜,洋柿(茄)子,紅茄,毛臘果', 33.8335, 1.1085, 0.4705, 0.2734, 6.9208, 1.4673, 5.08, 9.5191),
(654, '蔬菜類', '試交二號小番茄', '樣品狀態:生,紅色系小果; 前處理描述:去蒂,混合均勻打碎', '柑(甘)仔蜜,草(番,西紅,六月)柿,臭柿仔,小金瓜,洋柿(茄)子,紅茄,毛臘果', 29.9358, 0.736, 0.002, NULL, 7.1771, 1.9411, NULL, 2.5326),
(655, '蔬菜類', '櫻桃小番茄', '樣品狀態:生,紅色系小果; 前處理描述:去蒂,混合均勻打碎', '柑(甘)仔蜜,草(番,西紅,六月)柿,臭柿仔,小金瓜,洋柿(茄)子,紅茄,毛臘果', 34.3111, 0.918, 0.061, NULL, 8.0501, 1.6109, NULL, 5.5793),
(656, '蔬菜類', '黃金小蕃茄', '樣品狀態:生,橙色系小果; 前處理描述:去蒂,混合均勻打碎', '柑(甘)仔蜜,草(番,西紅,六月)柿,臭柿仔,小金瓜,洋柿(茄)子,紅茄,毛臘果', 30.5688, 0.813, 0.2475, 0.1652, 6.7608, 1.1864, 5.533, 3.091),
(657, '蔬菜類', '小番茄平均值(橙色系)', '樣品狀態:生,橙色系小果; 前處理描述:去蒂,混合均勻打碎', '柑(甘)仔蜜,草(番,西紅,六月)柿,臭柿仔,小金瓜,洋柿(茄)子,紅茄,毛臘果', 31.0774, 1.1123, 0.1709, 0.0737, 6.8546, 1.3373, 4.2612, 3.5982),
(658, '蔬菜類', '金女小番茄', '樣品狀態:生,橙色系小果; 前處理描述:去蒂,混合均勻打碎', '柑(甘)仔蜜,草(番,西紅,六月)柿,臭柿仔,小金瓜,洋柿(茄)子,紅茄,毛臘果', 29.9058, 1.099, 0.1434, NULL, 6.6221, 1.2467, 4.9246, 4.464),
(659, '蔬菜類', '黃金聖女小番茄', '樣品狀態:生,橙色系小果; 前處理描述:去蒂,混合均勻打碎', '柑(甘)仔蜜,草(番,西紅,六月)柿,臭柿仔,小金瓜,洋柿(茄)子,紅茄,毛臘果', 30.8959, 0.999, 0.1321, 0.0476, 6.9674, 1.5616, 4.0841, 3.2625),
(660, '蔬菜類', '橙蕃茄', '樣品狀態:生,橙色系小果; 前處理描述:去蒂,混合均勻打碎', '柑(甘)仔蜜,草(番,西紅,六月)柿,臭柿仔,小金瓜,洋柿(茄)子,紅茄,毛臘果', 32.4305, 1.239, 0.2371, 0.1191, 6.9743, 1.2037, 3.775, 3.068),
(661, '蔬菜類', '香瓜茄', '樣品狀態:生; 前處理描述:去蒂及籽,混合均勻打碎', '香瓜梨,南美香瓜梨', 25.9595, 0.44, 0.0657, NULL, 6.2197, 0.6659, 5.408, 2.609),
(662, '蔬菜類', '甜椒平均值(青皮)', '樣品狀態:生,青椒; 前處理描述:去蒂及籽,混合均勻打碎', '青椒,(甜)番椒,青辣椒,大同仔,番羌仔,燈籠椒,生番薑,獅子椒,甘椒,生椒', 29.405, 1.0324, 0.4472, 0.2444, 5.8863, 2.99, 2.2022, 2.1545),
(663, '蔬菜類', '甜椒(青皮)', '樣品狀態:生,青椒; 前處理描述:去蒂及籽,混合均勻打碎', '甜椒,甜番椒,大同仔,番羌仔,燈籠椒,生番薑,獅子椒,甘椒,生椒(青椒,青辣椒)', 23.34, 0.7873, 0.2711, 0.177, 4.8739, 2.1056, 2.588, 4.2443),
(664, '蔬菜類', '小甜椒(青皮)', '樣品狀態:生,青椒; 前處理描述:去蒂及籽,混合均勻打碎', '甜椒,甜番椒,大同仔,番羌仔,燈籠椒,生番薑,獅子椒,甘椒,生椒(青椒,青辣椒)', 34.5107, 1.442, 0.5177, NULL, 6.7691, 3.2189, NULL, 0.3173),
(665, '蔬菜類', '高山甜椒(青皮)', '樣品狀態:生,青椒; 前處理描述:去蒂及籽,混合均勻打碎', '甜椒,甜番椒,大同仔,番羌仔,燈籠椒,生番薑,獅子椒,甘椒,生椒(青椒,青辣椒)', 30.3643, 0.868, 0.5529, 0.2433, 6.016, 3.6455, 1.8164, 1.902),
(666, '蔬菜類', '甜椒(紅皮)', '樣品狀態:生,彩椒; 前處理描述:去蒂及籽,混合均勻打碎', '甜椒,甜番椒,大同仔,番羌仔,燈籠椒,生番薑,獅子椒,甘椒,生椒(紅椒,紅番(辣)椒,紅色大唐)', 33.4918, 0.834, 0.45, NULL, 7.0616, 1.6307, NULL, 0.73),
(667, '蔬菜類', '甜椒(黃皮)', '樣品狀態:生,彩椒; 前處理描述:去蒂及籽,混合均勻打碎', '甜椒,甜番椒,大同仔,番羌仔,燈籠椒,生番薑,獅子椒,甘椒,生椒', 28.091, 0.826, 0.28, NULL, 6.047, 1.8795, NULL, 0.6),
(668, '蔬菜類', '甜椒(橙皮)', '樣品狀態:生,彩椒; 前處理描述:去蒂及籽,混合均勻打碎', '甜椒,甜番椒,大同仔,番羌仔,燈籠椒,生番薑,獅子椒,甘椒,生椒', 34.5559, 0.9225, 0.2686, 0.0802, 7.6643, 1.2759, 5.607, 2.337),
(669, '蔬菜類', '青辣椒平均值', '樣品狀態:生,青辣椒; 前處理描述:去蒂,混合均勻打碎', '辣椒,番椒,番仔薑,臘椒(牛角辣椒,羊角辣椒,長辣(番)椒,青辣椒)', 32.9325, 1.3443, 0.2998, 0.0992, 6.8978, 3.2998, 2.2187, 2.0127),
(670, '蔬菜類', '角椒', '樣品狀態:生,青辣椒; 前處理描述:去蒂及籽,混合均勻打碎', '辣椒,番椒,番仔薑,臘椒', 22.1826, 0.904, 0.159, NULL, 4.7393, 2.5346, NULL, 2.209),
(671, '蔬菜類', '長辣椒(青皮)', '樣品狀態:生,青辣椒; 前處理描述:去蒂,混合均勻打碎', '辣椒,番椒,番仔薑,臘椒', 48.9903, 1.889, 0.4433, 0.1409, 10.3412, 4.1447, 2.3654, 3.012),
(672, '蔬菜類', '糯米椒', '樣品狀態:生,青辣椒; 前處理描述:去蒂,混合均勻打碎', '辣椒,番椒,番仔薑,臘椒(伏見甘長辣椒)', 27.6246, 1.24, 0.297, 0.1021, 5.6128, 3.22, 2.072, 0.817),
(673, '蔬菜類', '紅辣椒平均值', '樣品狀態:生,紅辣椒; 前處理描述:去蒂,混合均勻打碎', '辣椒,番椒,番仔薑,牛角辣椒,羊角辣椒,長辣(番)椒,紅辣椒,臘椒', 80.4199, 3.5632, 0.8618, 0.363, 16.3772, 11.409, 2.98, 6.4134),
(674, '蔬菜類', '長辣椒(紅皮)', '樣品狀態:生,紅辣椒; 前處理描述:去蒂,混合均勻打碎', '辣椒,番椒,番仔薑,臘椒', 48.387, 2.3927, 0.6905, 0.298, 9.3176, 6.9015, 3.145, 13.7187),
(675, '蔬菜類', '朝天椒(長果)', '樣品狀態:生,紅辣椒; 前處理描述:去蒂,混合均勻打碎', '辣椒,番椒,番仔薑,臘椒,指(向)天椒,赤穗生番椒,叢果番椒,海椒', 90.0771, 3.391, 1.3488, 0.5542, 17.9239, 13.88, 2.815, 3.1884),
(676, '蔬菜類', '朝天椒(圓果)', '樣品狀態:生,紅辣椒; 前處理描述:去蒂,混合均勻打碎', '辣椒,番椒,番仔薑,臘椒,指(向)天椒,赤穗生番椒,叢果番椒,海椒(雞心椒)', 102.796, 4.906, 0.546, NULL, 21.8902, 13.4456, NULL, 2.3332),
(677, '蔬菜類', '乾長辣椒(紅皮)', '樣品狀態:乾貨,紅辣椒; 前處理描述:混合均勻打碎', '辣椒,番椒,番仔薑,臘椒', 382.059, 19.942, 17.2091, 4.7926, 47.6334, 41.444, 3.88, 39.762),
(678, '蔬菜類', '黃秋葵', '樣品狀態:生; 前處理描述:去蒂,混合均勻打碎', '秋葵,羊角豆,黃蜀葵,食香槿,假三念,黃葵', 35.613, 2.0565, 0.1259, 0.0533, 7.4798, 3.7491, 2.584, 9.4994),
(679, '蔬菜類', '青花菜芽', '樣品狀態:生(含種皮,芽體,根毛); 前處理描述:混合均勻打碎', '青花椰苗,青花菜苗,花菜苔芽', 34.6729, 2.802, 0.96, 0.1146, 4.9478, 2.9364, 0.682, 1.15),
(680, '蔬菜類', '苜蓿芽', '樣品狀態:生; 前處理描述:混合均勻打碎', '苜蓿嬰', 20.1213, 3.215, 0.2148, 0.0454, 2.5385, 1.7824, 0.27, 64.8417),
(681, '蔬菜類', '紫甘藍芽', '樣品狀態:生(含種皮,芽體,根毛); 前處理描述:混合均勻打碎', NULL, 32.0974, 0.248, 0.6712, 0.0746, 6.623, 2.8636, 0.586, 2.485),
(682, '蔬菜類', '黃豆芽', '樣品狀態:生; 前處理描述:混合均勻打碎', '大豆芽', 47.0472, 5.277, 1.6176, 0.3335, 5.0467, 3.2865, 0.371, 6.988),
(683, '蔬菜類', '黃豆芽(有機,2023年取樣)', '樣品狀態:生; 前處理描述:混合均勻打碎', '大豆芽', 40.9329, 5.072, 0.97, 0.2033, 5.0065, 3.2401, 0.506, 2.43),
(684, '蔬菜類', '黑豆芽', '樣品狀態:生; 前處理描述:混合均勻打碎', NULL, 51.5821, 6.625, 1.11, 0.2591, 6.3933, 4.2696, 0.819, 2.7),
(685, '蔬菜類', '葵花芽', '樣品狀態:生; 前處理描述:混合均勻打碎', NULL, 26.4237, 2.547, 0.354, 0.0715, 4.3045, 2.3527, 1.634, 1.477),
(686, '蔬菜類', '綠豆芽', '樣品狀態:生; 前處理描述:混合均勻打碎', '豆芽菜,豆菜,綠豆菜', 23.8073, 2.3453, 0.2147, NULL, 4.0681, 1.3116, 1.311, 16.2424),
(687, '蔬菜類', '豌豆芽', '樣品狀態:生; 前處理描述:混合均勻打碎', '豌豆嬰,荷蘭豆芽(嬰)', 25.4122, 3.971, 0.4301, 0.192, 2.9252, 1.8956, 0.574, 1.51),
(688, '蔬菜類', '蕎麥芽', '樣品狀態:生; 前處理描述:混合均勻打碎', '烏麥芽,花蕎芽,荍麥芽', 20.0241, 1.866, 0.215, 0.0485, 3.4194, 2.1095, NULL, 3.621),
(689, '蔬菜類', '蘿蔔芽', '樣品狀態:生; 前處理描述:混合均勻打碎', '蘿蔔嬰,菜頭嬰(苗/芽),菜頭苗,貝芽菜', 23.5706, 2.14, 0.3511, 0.0744, 3.8526, 1.1969, 0.294, 6.846),
(690, '蔬菜類', '山蘇菜', '樣品狀態:生; 前處理描述:混合均勻打碎', '山蘇花,鳥巢蕨,山翅菜,雀(鳥)巢羊齒,歪頭 菜,巢鐵角蕨,掌草', 26.2878, 2.967, 0.1694, 0.0819, 4.3837, 3.2549, 0, 5.3991),
(691, '蔬菜類', '火炭母草', '樣品狀態:生; 前處理描述:混合均勻打碎', '川七,清飯藤,冷飯藤,雞糞(屎)藤,烏炭子', 12.0412, 1.6, 0.36, NULL, 1.24, 1.7, NULL, 26),
(692, '蔬菜類', '石蓮花', '樣品狀態:生; 前處理描述:混合均勻打碎', '蓮座草', 10.561, 0.385, 0.1219, 0, 2.1877, 0.5758, 0.105, 40.161),
(693, '蔬菜類', '青葙', '樣品狀態:生; 前處理描述:混合均勻打碎', '野雞冠,雞冠莧,筆雞冠,草決明', 50.089, 2.5, 1.6, NULL, 7.73, 3.3, NULL, 44),
(694, '蔬菜類', '假人蔘', '樣品狀態:生; 前處理描述:混合均勻打碎', '土人參,參仔葉(草),土高麗參,臺灣(野)參,櫨蘭,東洋參,參草', 31.5362, 1.64, 2.22, NULL, 2.22, 0.99, NULL, 17),
(695, '蔬菜類', '野苦瓜嫩梢', '樣品狀態:生; 前處理描述:混合均勻打碎', NULL, 76.5238, 5.71, 1.68, NULL, 12.18, 8.81, NULL, 16),
(696, '蔬菜類', '過溝菜蕨', '樣品狀態:生; 前處理描述:混合均勻打碎', '過貓(溝),過貓(溝)菜,蕨山貓,食用雙囊蕨', 27.3946, 3.0975, 0.8249, NULL, 3.173, 2.9401, NULL, 6.2452),
(697, '蔬菜類', '蔘鬚', '樣品狀態:乾貨; 前處理描述:混合均勻打碎', NULL, 330.155, 7.018, 1.7639, 0.9158, 76.1549, 16.0494, 27.06, 31.546),
(698, '蔬菜類', '龍骨瓣莕菜', '樣品狀態:生; 前處理描述:去根部,混合均勻打碎', '水蓮菜,野蓮,銀蓮花,水皮蓮,刺種莕菜,捲瓣莕菜', 17.3803, 1.093, 0.2718, 0.1352, 3.1389, 1.8679, 0.5789, 110.653),
(699, '蔬菜類', '薄荷', '樣品狀態:生; 前處理描述:混合均勻打碎', '仁丹草,升陽藥,南薄荷,夜息花,野薄荷,新卜荷', 55.406, 3.05, 0.6, NULL, 10.87, 7.5, NULL, 14),
(700, '蔬菜類', '蕺菜', '樣品狀態:生; 前處理描述:混合均勻打碎', '魚腥草,臭腥草,臭臊草,臭瘥草,手藥', 45.545, 3.17, 0.88, NULL, 7.66, 1.9, NULL, 23),
(701, '蔬菜類', '蘆薈', '樣品狀態:生; 前處理描述:混合均勻打碎', '盧會', 4.415, 0.05, 0.4, NULL, 0.24, 1.4, NULL, 18),
(702, '蔬菜類', '皇宮菜', '樣品狀態:生; 前處理描述:混合均勻打碎', NULL, 21.7462, 2.2, 0.26, NULL, 3.54, 2.1, NULL, 20),
(703, '蔬菜類', '香芫荽', '樣品狀態:生; 前處理描述:去莖部,混合均勻打碎', NULL, 22.9932, 2.4, 0.16, NULL, 3.94, 2.2, NULL, 74),
(704, '蔬菜類', '荷蘭豆菜心', '樣品狀態:生; 前處理描述:混合均勻打碎', NULL, 29.8365, 3.9, 0.55, NULL, 3.85, 2.8, NULL, 9),
(705, '蔬菜類', '厥子', '樣品狀態:生; 前處理描述:混合均勻打碎', NULL, 22.7312, 2.3, 0.16, NULL, 3.94, 5.7, NULL, 3),
(706, '蔬菜類', '義大利茼蒿', '樣品狀態:生; 前處理描述:去根部,混合均勻打碎', NULL, 14.8298, 1.574, 0.3989, 0.1033, 1.889, 1.5515, 0.3575, 1.296),
(707, '蔬菜類', '龍延草', '樣品狀態:生; 前處理描述:混合均勻打碎', NULL, 78.755, 3.89, 2.26, NULL, 12.73, 0.7, NULL, 22),
(708, '蔬菜類', '麵包果', '樣品狀態:生; 前處理描述:去心及皮,含籽,混合均勻打碎', '釋迦果,馬檳榔', 61.3168, 0.973, 1.8194, 0.6365, 11.1639, 4.2761, 4.602, 1.72),
(709, '蔬菜類', '冰花', '樣品狀態:生,冷藏盒裝; 前處理描述:混合均勻打碎', '冰菜,水晶冰花,冰葉日中花', 6.9103, 0.775, 0.12, 0.069, 0.9937, 0.5385, 0, 445.36),
(710, '藻類', '紅毛苔', '樣品狀態:乾貨; 前處理描述:混合均勻打碎', '海發菜,海髮菜,頭髮菜,紅毛菜', 264.662, 39.932, 1.9137, 1.1247, 36.9289, 26.6108, 0, 209.216),
(711, '藻類', '紫菜', '樣品狀態:乾貨; 前處理描述:混合均勻打碎', '海苔', 267.505, 28.05, 0.8823, 0.4766, 47.8537, 28.9975, 0, 967.509),
(712, '藻類', '熟紫菜', '樣品狀態:乾貨; 前處理描述:混合均勻打碎', '海苔', 294.15, 18.073, 0.417, 0.2608, 62.3868, 37.2821, NULL, 516.873),
(713, '藻類', '髮菜', '樣品狀態:乾貨; 前處理描述:混合均勻打碎', '頭髮菜,紅毛菜,發菜', 302.232, 10.274, 0.5133, 0.3243, 69.4918, 14.5592, 0, 106.515),
(714, '藻類', '麒麟菜', '樣品狀態:生,褐色; 前處理描述:混合均勻打碎', '麒麟草,海麒麟草,海珊湖,珊湖藻(草),鹹(鹽/神/福)草', 41.1567, 0.95, 0.013, 0, 9.8869, 4.5134, 0, 16.425),
(715, '藻類', '乾麒麟菜', '樣品狀態:乾貨; 前處理描述:混合均勻打碎', '乾麒麟草,乾海麒麟草,乾海珊湖,乾珊湖藻(草),乾鹹(鹽/神/福)草', 189.153, 1.197, 0.4719, 0.2348, 46.6839, 12.1695, 0, 14907.9),
(716, '藻類', '礁膜', '樣品狀態:生; 前處理描述:混合均勻打碎', '海菜(澎湖人稱)', 16.0285, 0.2575, 0.0929, NULL, 3.7375, 3.546, 0, 76.6977),
(717, '藻類', '乾海茸芯', '樣品狀態:乾貨; 前處理描述:混合均勻打碎', '海海洋竹笙,乾素蹄筋', 254.26, 8.425, 0.213, NULL, 59.078, 40.0302, NULL, 4196.48),
(718, '藻類', '海帶平均值', '樣品狀態:生; 前處理描述:混合均勻打碎', '江白菜,昆布,海昆布', 19.0392, 0.7307, 0.0788, 0.0348, 4.2218, 2.4855, 0, 215.792),
(719, '藻類', '海帶卷', '樣品狀態:生; 前處理描述:混合均勻打碎', '江白菜卷,昆布卷,海昆布卷', 14.0141, 0.716, 0.1674, 0.0594, 2.7531, 2.729, 0, 367.388),
(720, '藻類', '海帶茸', '樣品狀態:生; 前處理描述:混合均勻打碎', '江白菜茸,昆布茸,海昆布茸', 28.6693, 1.052, 0.047, NULL, 6.5435, 1.8797, NULL, 207.783),
(721, '藻類', '海帶梗', '樣品狀態:生; 前處理描述:混合均勻打碎', '海帶根', 13.6788, 0.364, 0.01, 0.0067, 3.2414, 2.5719, 0, 122.138),
(722, '藻類', '海帶結', '樣品狀態:生; 前處理描述:混合均勻打碎', '江白菜結,昆布結,海昆布結', 16.7364, 0.7795, 0.0897, 0.0271, 3.5752, 2.4171, 0, 230.437),
(723, '藻類', '海帶絲', '樣品狀態:生; 前處理描述:混合均勻打碎', '江白菜絲,昆布絲,海昆布絲', 22.0973, 0.742, 0.08, NULL, 4.9958, 2.8297, NULL, 151.213),
(724, '藻類', '乾海帶', '樣品狀態:乾貨; 前處理描述:混合均勻打碎', '乾江白菜,乾昆布,乾海昆布', 219.982, 10.0465, 1.1035, 0.4908, 47.2883, 26.6287, NULL, 3152.51),
(725, '藻類', '裙帶菜', '樣品狀態:生,經鹽醃脫水處理; 前處理描述:混合均勻打碎', '海帶芽,嫩海帶', 58.2528, 4.963, 0, 0, 11.6025, 10.0736, 0, 9171.56),
(726, '藻類', '乾裙帶菜', '樣品狀態:乾貨; 前處理描述:混合均勻打碎', '乾海帶芽,乾嫩海帶', 224.926, 22.917, 0.684, 0.1267, 40.8099, 34.061, NULL, 8084.65),
(727, '藻類', '乾裙帶菜根', '樣品狀態:乾貨; 前處理描述:混合均勻打碎', '乾海帶芽根,乾嫩海帶根', 201.395, 6.178, 0.632, 0.3175, 46.133, 39.6142, NULL, 10169.8),
(728, '藻類', '鳳尾藻', '樣品狀態:乾貨; 前處理描述:混合均勻打碎', '紫晶藻', 212.689, 11.684, 1.2819, 0.9012, 43.9353, 40.6875, 0, 3957.26),
(729, '藻類', '葛仙米藻', '樣品狀態:生,冷藏袋裝; 前處理描述:混合均勻打碎', '雨來菇,地木耳,地軟兒,地皮菜,草皮菇,情人的眼淚', 24.0828, 1.321, 0.04, 0.0185, 5.2018, 4.5208, 0, 13.5),
(730, '藻類', '壽司海苔片', '前處理描述:混合均勻打碎', NULL, 277.891, 46.458, 3.6924, 1.0225, 32.1193, 26.5283, 0, 387.393),
(731, '菇類', '木耳', '樣品狀態:生; 前處理描述:混合均勻打碎', '黑木耳,桑耳,白背毛木耳,木樟(檽/菌/茸/蛾/樅),樹雞(毛木耳)', 37.9503, 0.856, 0.1457, 0.0205, 8.8431, 7.3899, 0.238, 12.1933),
(732, '菇類', '冷凍木耳', '樣品狀態:冷凍包裝; 前處理描述:混合均勻打碎', '黑木耳,桑耳,白背毛木耳,木樟(檽/菌/茸/蛾/樅),樹雞(毛木耳)', 50.9147, 0.86, 0.05, NULL, 12.37, 12.34, NULL, 35),
(733, '菇類', '乾木耳平均值', '樣品狀態:乾貨; 前處理描述:混合均勻打碎', '黑木耳,桑耳,白背毛木耳,木樟(檽/菌/茸/蛾/樅),樹雞(毛木耳)', 333.231, 13.7708, 0.6806, 0.1226, 74.7321, 57.6824, 0, 28.0173),
(734, '菇類', '乾木耳(紅耳仔)', '樣品狀態:乾貨; 前處理描述:混合均勻打碎', '黑木耳,桑耳,白背毛木耳,木樟(檽/菌/茸/蛾/樅),樹雞(毛木耳)', 328.759, 6.1495, 0.1512, 0.0272, 79.8414, 77.2411, 0, 44.0445),
(735, '菇類', '乾木耳(黑耳仔)', '前處理描述:以新鮮木耳熱風乾燥,混合均勻打碎', '黑木耳,桑耳,白背毛木耳,木樟(檽/菌/茸/蛾/樅),樹雞(毛木耳)', 337.703, 21.392, 1.21, NULL, 69.6227, 38.1237, NULL, 11.99),
(736, '菇類', '乾川耳', '樣品狀態:乾貨; 前處理描述:混合均勻打碎', NULL, 335.952, 8.954, 0.3304, 0.1008, 79.4172, 78.0834, 0, 17.5),
(737, '菇類', '銀耳', '樣品狀態:生; 前處理描述:混合均勻打碎', '白木耳,雪耳', 30.7147, 1.079, 0, 0, 7.1507, 6.3937, 0, 5.4),
(738, '菇類', '白毛木耳', '樣品狀態:生; 前處理描述:混合均勻打碎', '毛木耳(白化),雪珍耳', 44.8771, 1.166, 0.0646, NULL, 10.585, 7.1874, 0.269, 2.391),
(739, '菇類', '乾銀耳', '樣品狀態:乾貨; 前處理描述:混合均勻打碎', '白木耳,雪耳', 310.082, 9.2807, 1.1582, 0.2798, 70.7877, 64.5375, 2.0655, 26.7937),
(740, '菇類', '草菇', '樣品狀態:生; 前處理描述:混合均勻打碎', '蘭花菇,美味草菇,包腳菇,中國蘑菇,稈(麻/貢)菇,南華菇,家生菇(小包腳菇)', 35.7491, 3.8025, 0.345, NULL, 5.8715, 2.0837, NULL, 2.825),
(741, '菇類', '雞腿菇', '樣品狀態:生; 前處理描述:混合均勻打碎', '雞腿(蘑)菇,雞髀菇,墨水菇,一夜菇(毛頭鬼傘)', 35.8226, 2.121, 0.1397, 0.0307, 7.4606, 2.0755, 2.013, 10.533),
(742, '菇類', '雞腿菇(乾)', '樣品狀態:乾貨; 前處理描述:混合均勻打碎', '雞腿(蘑)菇,雞髀菇,墨水菇,一夜菇(毛頭鬼傘)', 297.559, 20.138, 1.4022, 0.2023, 59.7591, 20.3787, 24.506, 72.576),
(743, '菇類', '松茸', '樣品狀態:生; 前處理描述:去菌柄基部,混合均勻打碎', '台灣松茸,松口蘑,大花菌,松蕈,剝皮菌(台灣松口蘑)', 35.7479, 3.146, 0.5382, 0.1392, 5.8976, 1.4094, 2.8429, 1.024),
(744, '菇類', '雪白菇(長)', '樣品狀態:生; 前處理描述:混合均勻打碎', '美白菇,白精靈菇', 35.623, 2.105, 0.3768, 0.0995, 6.9113, 2.5142, 2.218, 1.1705),
(745, '菇類', '柳松菇', '樣品狀態:生; 前處理描述:混合均勻打碎', '柳松茸,茶樹菇,楊樹菇,田頭菇(柱狀田頭菇)', 35.767, 3.7043, 0.3277, 0.0748, 5.9792, 1.498, 0.774, 0.46),
(746, '菇類', '乾柳松菇', '樣品狀態:乾貨; 前處理描述:混合均勻打碎', '柳松茸,茶樹菇,楊樹菇,田頭菇(柱狀田頭菇)', 285.756, 23.48, 1.881, NULL, 53.4602, 27.3424, NULL, 5.8048),
(747, '菇類', '香菇平均值', '樣品狀態:生; 前處理描述:混合均勻打碎', '冬(北/花/厚/毛)菇,椎茸,香蕈(信/椹),合蕈', 38.5079, 3.0243, 0.124, 0, 7.576, 3.7999, 0.5417, 1.4764),
(748, '菇類', '香菇(大)', '樣品狀態:生; 前處理描述:混合均勻打碎', '冬(北/花/厚/毛)菇,椎茸,香蕈(信/椹),合蕈', 37.1935, 3.0383, 0.1661, 0, 7.1392, 3.5024, 0.7345, 1.5823),
(749, '菇類', '香菇(小)', '樣品狀態:生; 前處理描述:混合均勻打碎', '冬(北/花/厚/毛)菇,椎茸,香蕈(信/椹),合蕈', 25.8774, 2.4185, 0.0609, 0, 4.8798, 2.5084, 0.3488, 1.095),
(750, '菇類', '花菇', '樣品狀態:生; 前處理描述:混合均勻打碎', '冬(北/花/厚/毛)菇,椎茸,香蕈(信/椹),合蕈', 52.4527, 3.616, 0.145, 0, 10.709, 5.389, NULL, 1.752),
(751, '菇類', '乾香菇平均值', '樣品狀態:乾貨; 前處理描述:混合均勻打碎', '冬(北/花/厚/毛)菇,椎茸,香蕈(信/椹),合蕈', 320.941, 20.9261, 1.5631, 0.2576, 64.8799, 37.1087, 4.8294, 8.6843),
(752, '菇類', '乾香菇', '樣品狀態:乾貨; 前處理描述:混合均勻打碎', '冬(北/花/厚/毛)菇,椎茸,香蕈(信/椹),合蕈', 332.56, 23.3118, 1.3833, 0.2129, 66.6424, 38.4599, 6.675, 14.824),
(753, '菇類', '乾花菇', '樣品狀態:乾貨; 前處理描述:混合均勻打碎', '冬(北/花/厚/毛)菇,椎茸,香蕈(信/椹),合蕈', 316.73, 17.0485, 1.0793, 0.1854, 67.4435, 33.5233, 3.5519, 4.4455),
(754, '菇類', '乾白花菇', '樣品狀態:乾貨; 前處理描述:混合均勻打碎', '冬(北/花/厚/毛)菇,椎茸,香蕈(信/椹),合蕈', 309.897, 18.714, 1.0908, 0.1929, 64.5477, 40.378, 2.9736, 5.071),
(755, '菇類', '乾鈕釦菇', '樣品狀態:乾貨(香菇#271,93/03); 前處理描述:混合均勻打碎', '冬(北/花/厚/毛)菇,椎茸,香蕈(信/椹),合蕈', 324.575, 24.63, 2.6989, 0.4225, 60.8858, 36.0734, 6.117, 10.3965),
(756, '菇類', '姬松茸', '樣品狀態:生; 前處理描述:混合均勻打碎', '姬松菇,巴西蘑菇,柏氏蘑菇,小松菇', 40.4188, 4.0275, 0.369, 0.1677, 6.8662, 2.2563, 0.8681, 1.4985),
(757, '菇類', '乾姬松茸', '樣品狀態:乾貨; 前處理描述:混合均勻打碎', '姬松菇,巴西蘑菇,柏氏蘑菇,小松菇', 293.629, 33.967, 2.6788, 0.5385, 46.7216, 18.4817, 19.371, 22.697),
(758, '菇類', '酒杯菇', '樣品狀態:生; 前處理描述:混合均勻打碎', '大杯傘,大杯菇,葉松茸,豬肚菇', 49.9389, 4.583, 0.3469, 0.0754, 8.9815, 4.0402, 1.6063, 1.298),
(759, '菇類', '秀珍菇', '樣品狀態:生; 前處理描述:混合均勻打碎', '平菇,小平菇,側耳平菇,蠔菇,袖珍(鮑魚)菇(側耳)', 27.5205, 3.3377, 0.084, 0.0303, 4.634, 1.3297, 1.36, 0.7743),
(760, '菇類', '天喜菇', '樣品狀態:生; 前處理描述:混合均勻打碎', NULL, 25.8722, 4.504, 0.5148, 0.1438, 2.5033, 2.1627, 2.278, 0.709),
(761, '菇類', '白蠔菇', '樣品狀態:生; 前處理描述:混合均勻打碎', NULL, 32.7085, 2.16, 0.2561, 0.1353, 6.3861, 3.1027, 1.022, 1.144),
(762, '菇類', '玫瑰菇', '樣品狀態:生; 前處理描述:混合均勻打碎', '紅側耳,桃紅平菇,紅平菇,粉紅菇', 34.904, 4.514, 0.127, NULL, 5.6447, 4.4536, 0, 1.057),
(763, '菇類', '杏香菇', '樣品狀態:生; 前處理描述:混合均勻打碎', '香微蘑,雪茸,帝王菇,平菇王', 26.2176, 2.734, 0.1442, 0.0331, 4.5763, 1.4156, 0.668, 2.134),
(764, '菇類', '杏鮑菇平均值', '樣品狀態:生; 前處理描述:混合均勻打碎', '鳳尾菇,雪茸,帝王菇,平菇王,蠔菇王,干貝菇,刺芹側耳,義大利側耳,義大利蠔菌,杏鮑茸,西洋刺耳', 41.3127, 2.7185, 0.208, 0.0592, 8.3203, 3.1277, 2.8697, 2.6007),
(765, '菇類', '杏鮑菇(大)', '樣品狀態:生; 前處理描述:混合均勻打碎', '鳳尾菇,雪茸,帝王菇,平菇王,蠔菇王,干貝菇,刺芹側耳,義大利側耳,義大利蠔菌,杏鮑茸,西洋刺耳', 36.8808, 2.4273, 0.1332, 0.0342, 7.5401, 3.67, 3.227, 2.9983),
(766, '菇類', '杏鮑菇(中)', '樣品狀態:生; 前處理描述:混合均勻打碎', '鳳尾菇,雪茸,帝王菇,平菇王,蠔菇王,干貝菇,刺芹側耳,義大利側耳,義大利蠔菌,杏鮑茸,西洋刺耳', 40.3456, 2.4987, 0.2101, 0.0785, 8.2155, 2.921, 0.6455, 1.5513),
(767, '菇類', '杏鮑菇(小)', '樣品狀態:生; 前處理描述:混合均勻打碎', '鳳尾菇,雪茸,帝王菇,平菇王,蠔菇王,干貝菇,刺芹側耳,義大利側耳,義大利蠔菌,杏鮑茸,西洋刺耳', 46.7118, 3.2295, 0.2807, 0.0628, 9.2054, 2.792, 4.7365, 3.2525),
(768, '菇類', '珊瑚菇', '樣品狀態:生; 前處理描述:去菌柄基部,混合均勻打碎', '金頂鮑魚菇,金頂蘑,榆黃蘑,榆(黃)蘑,黃金菇,玉皇(米)菇,粗口黃,楊柳菌,黃樹窩(金頂側耳)', 32.6677, 3.9995, 0.212, 0.0746, 5.2345, 1.6993, 0.5887, 0.073),
(769, '菇類', '蠔菇', '樣品狀態:生,中溫系; 前處理描述:混合均勻打碎', '平菇,日本蠔菇,糙皮側耳,黑牡丹菇,黑美人菇,人工口蘑(囊狀側耳)', 26.1775, 2.0533, 0.2667, NULL, 4.7604, 3.1034, NULL, 3.9333),
(770, '菇類', '鮑魚菇', '樣品狀態:生,高溫系; 前處理描述:混合均勻打碎', '夏季鮑魚菇,高溫平菇,台灣平菇,黑美人菇,人工口蘑(囊狀側耳)', 21.8883, 1.689, 0.2, 0.0419, 4.0485, 0.6577, NULL, 1.98);
INSERT INTO `nutrition_facts` (`id`, `food_category`, `sample_name`, `content_description`, `alias`, `kcal`, `protein`, `fat`, `saturated_fat`, `carbohydrate`, `fiber`, `total_sugar`, `sodium`) VALUES
(771, '菇類', '金針菇', '樣品狀態:生; 前處理描述:混合均勻打碎', '金(冬/榎/朴)菇,金絲菇,金菇菜,秋葷,樸蕈構菌,毛柄金線菇,菌子(絨柄金錢菇)', 37.3304, 2.5873, 0.3049, 0.0822, 7.1794, 2.2556, 2.9, 2.3883),
(772, '菇類', '華翠菇', '樣品狀態:生; 前處理描述:混合均勻打碎', '滿天星菇,黃色金針菇(絨柄金錢菇)', 28.6648, 2.494, 0.2462, 0.0595, 5.1461, 2.2423, 2.377, 1.323),
(773, '菇類', '滑菇', '樣品狀態:生; 前處理描述:去菌柄基部,混合均勻打碎', '珍珠菇,滑子,滑子蘑,光蓋鱗傘,光帽黃傘(滑鱗傘)', 26.6925, 2.6285, 0.1951, NULL, 4.6597, 1.3878, 1.0839, 1.789),
(774, '菇類', '舞菇', '樣品狀態:生; 前處理描述:去菌柄基部,混合均勻打碎', '舞茸,灰樹花,葉多孔菌,栗子蘑,千佛菌,蓮花菌', 27.5913, 1.422, 0.1402, NULL, 5.8185, 0.3208, 0.475, 0.503),
(775, '菇類', '鴻喜菇', '樣品狀態:生; 前處理描述:去菌柄基部,混合均勻打碎', '紅喜菇,真姬菇,斑玉蕈,玉蕈,膠玉蘑,蟹味菇,海鮮菇,假松茸,松茸菇,榆菇,靈芝菇,黑真珠', 29.5935, 2.9157, 0.1487, 0.046, 5.3102, 2.1977, 1.7326, 1.5267),
(776, '菇類', '雪白菇', '樣品狀態:生,鴻喜菇的白變種; 前處理描述:去菌柄基部,混合均勻打碎', '美白菇,白玉菇', 30.9028, 2.154, 0.04, 0.0092, 6.3909, 2.3522, 0.199, 0.85),
(777, '菇類', '洋菇', '樣品狀態:生; 前處理描述:混合均勻打碎', '西洋蘑菇(蘑菇,雙孢蘑菇)', 24.9732, 3.039, 0.2456, 0.074, 3.8347, 1.2811, 0.274, 18.6435),
(778, '菇類', '冷凍洋菇', '樣品狀態:冷凍包裝; 前處理描述:混合均勻打碎', '西洋蘑菇(蘑菇,雙孢蘑菇)', 38.7583, 3.79, 1.45, NULL, 4.28, 3.93, NULL, 7.6),
(779, '菇類', '白茯苓', '樣品狀態:乾貨; 前處理描述:去外皮之白色部份,混合均勻打碎', '松(雲/安/閩)苓,玉(茯)靈,茯兔(龜),松柏芋,松薯,不死麵,萬靈桂(精),更生,金翁', 315.782, 0.99, 0.19, NULL, 79.8968, 80.8632, NULL, 0),
(780, '菇類', '猴頭菇', '樣品狀態:生; 前處理描述:混合均勻打碎', '猴頭蘑,刺蝟菌,蝟菌,花菜菇,圓頭菇,陰陽蘑,對臉蘑', 30.3773, 2.065, 0.2374, 0.0775, 5.8923, 2.266, 0.419, 2.22),
(781, '菇類', '乾猴頭菇', '樣品狀態:乾貨; 前處理描述:混合均勻打碎', '猴頭蘑,刺蝟菌,蝟菌,花菜菇,圓頭菇,陰陽蘑,對臉蘑', 311.17, 12.287, 3.354, 0.9975, 64.3347, 36.5358, 16.936, 3.288),
(782, '菇類', '乾竹笙', '樣品狀態:乾貨; 前處理描述:混合均勻打碎', '竹蓀,竹參(長裙竹蓀)', 312.116, 17.517, 1.9549, 0.254, 64.0664, 32.8983, 5.7544, 28.305),
(783, '菇類', '松茸白菇', '樣品狀態:生; 前處理描述:混合均勻打碎', NULL, 37.8902, 5.073, 0.4825, 0.1331, 5.2719, 3.0887, NULL, 0.955),
(784, '菇類', '金喜菇', '樣品狀態:生; 前處理描述:去菌柄基部,混合均勻打碎', NULL, 39.1662, 2.74, 0.2484, 0.0512, 7.6688, 2.5124, 3.2606, 4.762),
(785, '菇類', '喜來菇', '樣品狀態:生; 前處理描述:混合均勻打碎', NULL, 37.0486, 3.539, 0.4061, 0.0927, 6.2506, 2.2285, NULL, 0.684),
(786, '菇類', '富珍茸', '樣品狀態:生; 前處理描述:混合均勻打碎', NULL, 37.4175, 2.999, 0.3757, 0.0673, 6.7732, 2.4289, 0.3482, 0.601),
(787, '豆類', '白鳳豆平均值', '樣品狀態:生; 前處理描述:混合均勻磨碎', '矮性刀豆,洋刀豆,立刀豆', 336.614, 23.768, 2.061, 0.3453, 58.2035, 19.634, NULL, 0.4786),
(788, '豆類', '白鳳豆(台灣)', '樣品狀態:生; 前處理描述:混合均勻磨碎', '矮性刀豆,洋刀豆,立刀豆', 347.999, 27.393, 2.813, 0.5893, 56.3637, 22.7431, NULL, 0.7908),
(789, '豆類', '白鳳豆(進口)', '樣品狀態:生; 前處理描述:混合均勻磨碎', '矮性刀豆,洋刀豆,立刀豆', 325.229, 20.143, 1.309, 0.1644, 60.0433, 16.5248, NULL, 0.1664),
(790, '豆類', '米豆', '樣品狀態:乾貨; 前處理描述:混合均勻磨碎', '飯豆,蛋白豆,赤山豆,繖形豇豆,島田豇豆', 349.132, 21.7395, 2.4487, 0.9373, 62.2114, 15.7106, 2.376, 18.811),
(791, '豆類', '花豆', '樣品狀態:乾貨; 前處理描述:混合均勻磨碎', '紅花豆,紅(赤)花菜豆,花仔(阿/柳)豆', 328.415, 21.2243, 1.7285, 0.3645, 59.0416, 19.2838, 1.8018, 11.0553),
(792, '豆類', '紅豆', '樣品狀態:乾貨; 前處理描述:混合均勻磨碎', '小豆,赤小豆,赤豆,通常小豆,小紅豆,紅小豆', 327.99, 20.922, 0.6215, 0.1682, 61.4714, 18.4639, 0.4306, 1.4963),
(793, '豆類', '紅雲豆(大紅豆)', '樣品狀態:乾貨(Red kidney bean); 前處理描述:混合均勻磨碎', '紅菜豆,大紅豆', 327.607, 20.186, 1.4074, 0.3406, 60.3886, 20.4632, 1.554, 2.044),
(794, '豆類', '青仁黑豆', '樣品狀態:乾貨; 前處理描述:混合均勻磨碎', '烏豆,枝仔豆,黑大豆', 384.792, 36.9788, 14.2338, 2.3464, 33.7442, 21.4866, 5.7166, 3.5066),
(795, '豆類', '黃仁黑豆', '樣品狀態:乾貨; 前處理描述:混合均勻磨碎', '烏豆,枝仔豆,黑大豆', 253.152, 20.579, 2.107, 0.4957, 40.3211, 23.3233, 2.908, 0.75),
(796, '豆類', '黑豆胚芽', '樣品狀態:生; 前處理描述:混合均勻打碎', NULL, 185.015, 16.079, 7.698, 1.3599, 15.9186, 11.835, 2.628, 1.97),
(797, '豆類', '烘烤黑豆', '前處理描述:混合均勻打碎', '烏豆,枝仔豆,黑大豆', 435.294, 39.02, 20.07, NULL, 32.41, 27.09, NULL, 320.4),
(798, '豆類', '黑豆粉', '前處理描述:混合均勻', '烏豆,枝仔豆,黑大豆', 430.962, 36, 17.6, NULL, 39, 16.95, NULL, 65.4),
(799, '豆類', '毛綠豆', '樣品狀態:乾貨; 前處理描述:混合均勻磨碎', '菉豆,綠小豆,輻莢豆', 345.695, 22.138, 1.2203, 0.4602, 63.5534, 16.3318, 1.03, 2.5715),
(800, '豆類', '綠豆', '樣品狀態:乾貨; 前處理描述:混合均勻磨碎', '菉豆,綠小豆,輻莢豆', 344.472, 22.7713, 1.0997, 0.3814, 62.961, 15.7551, 1.3243, 0.5747),
(801, '豆類', '綠豆仁', '樣品狀態:乾貨; 去皮綠豆仁; 前處理描述:混合均勻打碎', '菉豆,綠小豆,輻莢豆', 338.575, 24.615, 1.2625, 0.5737, 59.6054, 11.2325, 1.311, 1.294),
(802, '豆類', '綠豆粉', '前處理描述:混合均勻', '菉豆,綠小豆,輻莢豆', 344.29, 21.74, 1.54, 0.5419, 62.89, 12.43, NULL, 8.08),
(803, '豆類', '豇豆(莢)', '樣品狀態:生; 前處理描述:去蒂頭及尾端,混合均勻打碎', '長豇豆,長莢豇豆,豆角,菜(筷/江/長/角)豆', 34.5072, 2.3514, 0.1393, 0.0588, 6.1872, 2.3481, 2.0179, 1.7586),
(804, '豆類', '萊豆仁(帶膜)', '樣品狀態:生; 前處理描述:混合均勻打碎', '皇帝豆,皇格豆,白扁豆,觀音豆,雪豆,大馬萊豆,細綿豆', 112.365, 7.8297, 0.4032, 0.1795, 20.1034, 5.076, 0.643, 3.0497),
(805, '豆類', '萊豆仁(去膜)', '樣品狀態:生; 前處理描述:混合均勻打碎', '皇帝豆,皇格豆,白扁豆,觀音豆,雪豆,大馬萊豆,細綿豆', 137.405, 7.403, 1.3536, 0.6097, 24.665, 2.8813, 1.519, 1.7),
(806, '豆類', '粉豆莢', '樣品狀態:生,扁圓莢; 前處理描述:去蒂頭,混合均勻打碎', '菜豆莢,四季豆,雲藕豆,隱之(元)豆,白(花)雲豆,敏(雲/芸/粉/醜)豆', 27.0053, 1.6605, 0.1025, 0, 5.0087, 1.9193, NULL, 7.2373),
(807, '豆類', '敏豆莢', '樣品狀態:生,圓莢; 前處理描述:去蒂頭,混合均勻打碎', '菜豆莢,四季豆,雲藕豆,隱之(元)豆,白(花)雲豆,敏(雲/芸/粉/醜)豆', 29.7036, 1.746, 0.2421, 0.1349, 5.3117, 2.0299, 1.79, 3.744),
(808, '豆類', '冷凍菜豆(莢)', '樣品狀態:冷凍包裝; 前處理描述:混合均勻打碎', '四季豆,雲藕豆,隱之(元)豆,白(花)雲豆,敏(雲/芸/粉/醜)豆', 56.8299, 3.404, 0.114, 0, 10.8265, 2.4504, NULL, 2.4424),
(809, '豆類', '毛豆仁', '樣品狀態:生; 前處理描述:混合均勻打碎', '大豆,青大豆,青皮豆', 129.3, 14.6025, 3.3222, 0.861, 12.4871, 6.419, 0.4387, 1.076),
(810, '豆類', '毛豆莢(高雄13號)', '樣品狀態:生; 前處理描述:去外莢,混合均勻打碎', '大豆,青大豆,青皮豆', 136.811, 11.6, 5.14, 0.8345, 13.154, 5.277, 1.802, 1.28),
(811, '豆類', '冷凍毛豆仁', '樣品狀態:冷凍包裝; 前處理描述:混合均勻打碎', '大豆,青大豆,青皮豆', 134.659, 12.468, 6.1316, 1.2234, 9.8461, 6.4615, 2.4942, 358.859),
(812, '豆類', '黃豆', '樣品狀態:乾貨; 前處理描述:混合均勻磨碎', '大豆,菽', 388.886, 35.615, 15.6693, 2.4335, 32.9607, 14.525, 4.581, 12.07),
(813, '豆類', '黃豆胚芽', '樣品狀態:生; 前處理描述:混合均勻打碎', '大豆胚芽', 169.214, 16.63, 5.355, 0.9174, 16.385, 14.4961, 1.901, 1.73),
(814, '豆類', '黃豆粉', '前處理描述:混合均勻', '大豆', 400.929, 37.36, 16.74, 2.4922, 32.23, 13.06, NULL, 1.89),
(815, '豆類', '黃豆粉(有機)', '前處理描述:混合均勻', '大豆粉(有機)', 434.4, 41.96, 21.9234, 3.5021, 25.8722, 14.1873, 5.701, 1.77),
(816, '豆類', '豆漿(無糖)', '樣品狀態:包裝產品(黃豆,水等); 前處理描述:混合均勻', NULL, 34.987, 3.637, 1.945, 0.4146, 0.7335, 1.2707, 0.354, 2.223),
(817, '豆類', '豌豆仁', '樣品狀態:生; 前處理描述:混合均勻打碎', '荷蓮豆仁,荷仁豆仁,荷蘭豆仁,花蓮豆仁,飛龍豆仁,青豆仁,胡豆仁,畢豆仁,宛豆仁,孫豆仁,丸豆仁,留', 123.365, 9.2025, 0.35, NULL, 21.7452, 7.48, NULL, 3.225),
(818, '豆類', '豌豆莢', '樣品狀態:生; 前處理描述:去蒂頭,混合均勻打碎', '荷蓮豆,荷仁豆,荷蘭豆,花蓮豆,飛龍豆,青豆莢,胡豆莢,畢豆莢,宛豆莢,孫豆莢,丸豆莢,留豆莢,戎菽', 40.6139, 2.945, 0.1699, 0.0639, 7.1186, 3.1531, 3.1718, 3.711),
(819, '豆類', '高山大豌豆莢', '樣品狀態:生; 前處理描述:去蒂頭,混合均勻打碎', '荷蓮豆,荷仁豆,荷蘭豆,花蓮豆,飛龍豆,青豆莢,胡豆莢,畢豆莢,宛豆莢,孫豆莢,丸豆莢,留豆莢,戎菽', 48.5462, 2.37, 0, NULL, 9.9072, 2.2931, NULL, 0.3756),
(820, '豆類', '甜豌豆莢', '樣品狀態:生; 前處理描述:去蒂頭,混合均勻打碎', '甜脆豌豆,甜荷蘭豆,甜荷仁豆', 42.3477, 3.0444, 0.1762, 0.0754, 7.4469, 2.7355, 3.8056, 1.9558),
(821, '豆類', '冷凍豌豆仁', '樣品狀態:冷凍包裝; 前處理描述:混合均勻打碎', '荷蓮豆仁,荷仁豆仁,荷蘭豆仁,花蓮豆仁,飛龍豆仁,青豆仁,胡豆仁,畢豆仁,宛豆仁,孫豆仁,丸豆仁,留', 95.9772, 6.0905, 0.6085, 0.152, 17.1376, 7.9625, 3.8254, 21.44),
(822, '豆類', '鵲豆莢', '樣品狀態:生,綠莢; 前處理描述:去蒂,混合均勻打碎', '肉(扁/藊)豆,峨(蛾/花)眉豆,沿(延)籬豆,隱元豆,膨皮豆', 31.2651, 2.4115, 0.261, NULL, 5.0891, 3.375, NULL, 1.7747),
(823, '豆類', '紅扁豆仁', '樣品狀態:乾貨; 前處理描述:混合均勻磨碎', NULL, 342.79, 25.26, 2.1197, 0.5136, 58.3282, 16.8619, 1.69, 1.087),
(824, '豆類', '鷹嘴豆', '樣品狀態:乾貨; 前處理描述:混合均勻磨碎', '雪蓮子,埃及豆,馬豆,桃爾豆,雞心豆,雞豆,雞屁股豆', 363.965, 19.359, 5.79, 1.0536, 61.014, 12.3588, NULL, 7.9961),
(825, '豆類', '樹豆(白)', '樣品狀態:乾貨; 前處理描述:混合均勻磨碎', '木豆,白樹豆,柳豆,米豆,放屁豆,番仔豆,蒲姜豆', 325.4, 22.1, 0.8133, 0.2754, 59.4362, 26.4961, 2.305, 7.79),
(826, '豆類', '翼豆', '樣品狀態:生; 前處理描述:去蒂,混合均勻打碎', '四角豆、翅豆、羊角豆、 楊桃豆、四稜豆', 30.6793, 2.469, 0.3646, 0.3105, 4.6831, 3.3541, 1.247, 2.14),
(827, '豆類', '天貝(黃豆)', '樣品狀態:生,冷凍袋裝; 前處理描述:混合均勻打碎', NULL, 187.159, 23.561, 9.0078, 1.6713, 7.3728, 5.7579, 0.061, 2.64),
(828, '肉類', '牛小排平均值', '樣品狀態:生,牛肋脊部位,冷凍產品; 前處理描述:去骨,混合均勻打碎', '肥牛肉,小肋排,牛仔骨', 324.989, 15.1305, 28.8672, 13.0515, 0, NULL, 0, 60.497),
(829, '肉類', '去骨牛小排', '樣品狀態:生,牛肋脊部位,冷凍產品; 前處理描述:混合均勻打碎', '肥牛肉,小肋排', 289.828, 17.1365, 24.0194, 10.7611, 0, NULL, 0, 59.469),
(830, '肉類', '帶骨牛小排', '樣品狀態:生,牛肋脊部位,冷凍產品; 前處理描述:去骨,混合均勻打碎', '牛仔骨', 360.151, 13.1245, 33.715, 15.3816, 0.3875, NULL, NULL, 61.525),
(831, '肉類', '無骨牛小排(美牛)', '樣品狀態:生,牛肋脊部位,冷藏; 前處理描述:混合均勻打碎', NULL, 335.141, 15.568, 29.7855, 14.1912, 0.1723, 0, 0, 52.76),
(832, '肉類', '牛肋條', '樣品狀態:生,牛肋脊部位,冷凍產品; 前處理描述:混合均勻打碎', '腩條,條肉', 225.257, 18.638, 16.15, 6.8999, 1.1166, NULL, NULL, 81.3),
(833, '肉類', '牛肋條(2021年取樣)', '樣品狀態:生,牛肋脊部位,冷凍產品; 前處理描述:混合均勻打碎', NULL, 358.087, 15.733, 32.2514, 16.0182, 0.3317, 0, 0, 39.38),
(834, '肉類', '沙朗牛排', '樣品狀態:生,牛肋脊部位,冷凍產品; 前處理描述:混合均勻打碎', '里肌,大里肌,肋眼,修清肋眼肉;修清肉眼', 162.003, 20.432, 8.2881, 4.2534, 1.5127, NULL, 0, 45.7847),
(835, '肉類', '板腱 ', '樣品狀態:生,牛肩胛部位,冷凍產品; 前處理描述:混合均勻打碎', '板腱牛排;白蘭地牛排;上肩胛脊底肌', 166.264, 19.8345, 9.0433, 3.2407, 0.1704, NULL, 0.7, 70.0115),
(836, '肉類', '牛去骨肩胛小排', '樣品狀態:生,牛肩胛部位,冷凍產品; 前處理描述:混合均勻打碎', '肥牛肉', 233.466, 16.906, 17.88, 7.6418, 1.2152, NULL, NULL, 53.13),
(837, '肉類', '牛前胸肉', '樣品狀態:生,牛前胸部位,冷凍產品; 前處理描述:混合均勻打碎', '去骨前胸肉,牛腩', 330.596, 14.79, 29.65, 15.2121, 0, NULL, NULL, 57.81),
(838, '肉類', '牛修清前胸肉', '樣品狀態:生,牛前胸部位,冷凍產品; 前處理描述:混合均勻打碎', '修清牛腩,修清前胸腋肌', 120.482, 22.28, 2.81, 1.2794, 0.9302, NULL, NULL, 44.68),
(839, '肉類', '去骨紐約克牛排', '樣品狀態:生,牛前腰脊部位,冷凍產品; 前處理描述:混合均勻打碎', '外條,西冷,去骨前腰脊肉', 199.581, 21.33, 12.029, 5.9449, 0, NULL, 0.119, 49.29),
(840, '肉類', '腓力牛排', '樣品狀態:生,牛前腰脊部位,冷凍產品; 前處理描述:混合均勻打碎', '菲力牛排,牛柳,小里肌,腰內肉,去脂腰里肌肉,全修清去膜腰裡脊肉', 184.228, 20.6265, 10.66, 5.2764, 0.1333, NULL, NULL, 46.86),
(841, '肉類', '牛後腿肉', '樣品狀態:生,牛後腿部位,冷凍產品; 前處理描述:混合均勻打碎', NULL, 121.914, 19.439, 4.3137, 2.2056, 3.7037, NULL, 0, 58.3605),
(842, '肉類', '牛後腿股肉', '樣品狀態:生,牛後腿部位,冷凍產品; 前處理描述:混合均勻打碎', '和尚頭,牛霖', 152.728, 20.6, 7.1803, 3.5043, 0.7897, NULL, 0.084, 48.37),
(843, '肉類', '牛後腿腱子心', '樣品狀態:生,牛後腿部位,冷凍產品; 前處理描述:混合均勻打碎', '牛腱,腱子', 139.162, 19.8387, 6.0367, 2.5608, 0, NULL, NULL, 79.1733),
(844, '肉類', '牛後腿腱子心(2022年取樣)', '樣品狀態:生,牛後腿部位,冷凍產品; 前處理描述:混合均勻打碎', '牛腱,腱子', 151.081, 23.713, 5.524, 2.308, 3.9516, 0, 0, 63.32),
(845, '肉類', '牛肉火鍋片平均值', '樣品狀態:生,冷凍產品; 前處理描述:混合均勻打碎', NULL, 250.33, 19.0555, 18.7321, 8.88, 0.0172, NULL, 0, 47.5924),
(846, '肉類', '牛五花肉火鍋片', '樣品狀態:生,冷凍產品; 前處理描述:混合均勻打碎', NULL, 430.306, 15.747, 40.2512, 20.892, 0, NULL, 0, 44.536),
(847, '肉類', '牛紐約客火鍋片', '樣品狀態:生,冷凍產品; 前處理描述:混合均勻打碎', NULL, 262.668, 20.128, 19.5922, 9.3278, 0, NULL, 0, 33.713),
(848, '肉類', '牛梅花肉火鍋片', '樣品狀態:生,冷凍產品; 前處理描述:混合均勻打碎', NULL, 119.959, 20.3, 3.6893, 1.7105, 0.9048, NULL, 0, 56.5055),
(849, '肉類', '牛嫩肩里肌火鍋片', '樣品狀態:生,冷凍產品; 前處理描述:混合均勻打碎', NULL, 188.389, 20.047, 11.3956, 4.9848, 1.7868, NULL, 0, 55.615),
(850, '肉類', '牛肚平均值', '樣品狀態:生,牛臟器; 前處理描述:混合均勻打碎', '百葉胃,毛肚,牛百葉,牛百頁,牛草肚(牛之第一胃);蜂巢肚,金錢肚(牛之第二胃)', 55.7672, 11.402, 0.785, 0.417, 0.1171, NULL, NULL, 82.195),
(851, '肉類', '牛肚(瘤胃)', '樣品狀態:生,牛臟器; 前處理描述:混合均勻打碎', '百葉胃,毛肚,牛百葉,牛百頁,牛草肚(牛之第一胃,山鏈狀)', 44.3055, 7.482, 1.37, 0.721, 0, NULL, NULL, 113.1),
(852, '肉類', '牛肚切片(瘤胃)', '樣品狀態:生,牛臟器; 前處理描述:混合均勻打碎', '百葉胃,毛肚,牛百葉,牛百頁,牛草肚(牛之第一胃)', 67.2289, 15.322, 0.2, 0.1072, 0.2776, NULL, NULL, 51.29),
(853, '肉類', '牛肚(蜂巢胃)', '樣品狀態:生,牛臟器; 前處理描述:混合均勻打碎', '蜂巢肚,金錢肚(牛之第二胃)', 106.655, 18.9595, 2.849, 1.4556, 0, NULL, 0, 103.404),
(854, '肉類', '牛筋', '樣品狀態:生,牛臟器,真空冷凍包裝; 前處理描述:混合均勻打碎', '蹄筋', 157.312, 21.694, 7.1706, 1.822, 3.268, NULL, 0, 50.349),
(855, '肉類', '山羊帶皮羊肉塊', '樣品狀態:生; 前處理描述:混合均勻打碎', NULL, 164.368, 20.258, 8.6326, 4.3157, 3.3944, NULL, 0, 80.764),
(856, '肉類', '山羊前腿肉片', '樣品狀態:生,前腿部位; 前處理描述:混合均勻打碎', NULL, 122.521, 21.3, 3.5, 1.6954, 0, NULL, NULL, 60),
(857, '肉類', '山羊後腿肉火鍋片', '樣品狀態:生,後腿部位; 前處理描述:混合均勻打碎', NULL, 170.357, 18.883, 9.9475, 5.1812, 0.074, NULL, 0, 98.9395),
(858, '肉類', '綿羊肉切片', '樣品狀態:生,冷凍切片; 前處理描述:混合均勻打碎', NULL, 197.536, 18.8, 13, 6.5988, 0, NULL, NULL, 73),
(859, '肉類', '法式羊排', '樣品狀態:生,綿羊,冷凍切片; 前處理描述:混合均勻打碎', '羊肋排,羊小排', 260.19, 18.76, 19.965, 10.9861, 0, NULL, NULL, 68.235),
(860, '肉類', '去骨肩頸眼羊肉', '樣品狀態:生,綿羊,冷凍切片; 前處理描述:混合均勻打碎', NULL, 198.061, 17.835, 13.515, 6.3495, 0, NULL, 0.03, 57.357),
(861, '肉類', '小羊腰脊肉', '樣品狀態:生,綿羊,冷凍切片; 前處理描述:混合均勻打碎', '去骨腰脊肉', 142.971, 26.477, 3.3164, 1.6422, 0, NULL, 0, 54.467),
(862, '肉類', '綿羊腹脅肉火鍋片', '樣品狀態:生,綿羊,腹脅部位,冷凍火鍋肉片; 前處理描述:混合均勻打碎', '五花肉火鍋片', 252.441, 16.941, 19.9671, 9.9326, 2.5322, NULL, 0, 76.374),
(863, '肉類', '豬下肩肉', '樣品狀態:生,豬肩胛部位; 前處理描述:去皮及骨,混合均勻打碎', '前腿肉', 200.008, 18.101, 13.605, 5.0464, 0, NULL, NULL, 54.29),
(864, '肉類', '豬下肩瘦肉', '樣品狀態:生,豬肩胛部位; 前處理描述:去肥肉,去皮及骨,混合均勻打碎', '前腿瘦肉', 131.194, 20.0675, 5.045, 1.9272, 0, NULL, NULL, 52.575),
(865, '肉類', '豬上肩肉', '樣品狀態:生,豬肩胛部位; 前處理描述:去皮及骨,混合均勻打碎', '梅花肉', 206.986, 18.8845, 14.0077, 5.4642, 0, NULL, 0, 51.732),
(866, '肉類', '豬肩胛肉', '樣品狀態:生,豬肩胛部位; 前處理描述:去皮及骨,混合均勻打碎', '胛心肉', 294.673, 16.5457, 24.8362, 9.7675, 0, NULL, 0, 52.7137),
(867, '肉類', '豬肩胛排', '樣品狀態:生,豬肩胛部位; 前處理描述:去骨,混合均勻打碎', '中排', 191.428, 17.94, 12.73, 4.8891, 0, NULL, NULL, 97.02),
(868, '肉類', '豬肩胛排(2021年取樣)', '樣品狀態:生,豬肩胛部位; 前處理描述:去骨,混合均勻打碎', NULL, 244.368, 17.76, 18.6844, 7.0579, 0, 0, 0, 63.75),
(869, '肉類', '豬前腿外腱肉', '樣品狀態:生,豬前腿部位; 前處理描述:混合均勻打碎', '豬腱,腱子肉', 146.482, 20.6695, 6.4549, 2.3216, 0, NULL, 0, 71.0995),
(870, '肉類', '豬後腿外腱肉', '樣品狀態:生,豬後腿部位; 前處理描述:混合均勻打碎', '豬腱,外腱', 184.018, 19.011, 11.4015, 4.3504, 0.7915, NULL, 0, 66.37),
(871, '肉類', '豬後腿肉', '樣品狀態:生,豬後腿部位; 前處理描述:去皮及骨,混合均勻打碎', NULL, 122.767, 20.386, 3.96, 1.4575, 0.4183, NULL, NULL, 48.51),
(872, '肉類', '豬後腿瘦肉', '樣品狀態:生,豬後腿部位; 前處理描述:去肥肉,去皮及骨,混合均勻打碎', NULL, 120.424, 21.0705, 3.3762, 1.1543, 0.2628, NULL, 0.146, 41.125),
(873, '肉類', '豬大里肌', '樣品狀態:生,豬背脊部位; 前處理描述:混合均勻打碎', '背脊肉,里肌肉', 211.723, 19.2457, 14.3619, 5.4246, 0.0277, NULL, 0, 40.097),
(874, '肉類', '豬大排', '樣品狀態:生,豬背脊部位; 前處理描述:去骨,混合均勻打碎', '背脊,帶骨里肌', 214.151, 19.1, 14.7, 5.9432, 0, NULL, NULL, 55),
(875, '肉類', '豬小排', '樣品狀態:生,豬背脊部位; 前處理描述:去骨,混合均勻打碎', '里肌小排,肋小排,肋骨排', 287.423, 18.0063, 23.341, 9.5956, 0, NULL, 0, 74.3743),
(876, '肉類', '僧帽肌', '樣品狀態:生,豬背脊部位; 前處理描述:混合均勻打碎', '離緣肉', 208.635, 20.388, 13.4788, 5.5673, 0, NULL, 0, 48.212),
(877, '肉類', '豬小里肌', '樣品狀態:生,豬小里肌部位; 前處理描述:混合均勻打碎', '腰內肉', 139.291, 21.1225, 5.4432, 2.2029, 0, NULL, 0, 45.7805),
(878, '肉類', '豬去皮腹脇肉', '樣品狀態:生,豬腹脇部位; 前處理描述:去皮,混合均勻打碎', '去皮五花肉,去皮三層肉', 359.955, 14.9033, 32.8512, 12.8, 0.4556, NULL, 0, 43.668),
(879, '肉類', '豬帶皮腹脇肉', '樣品狀態:生,豬腹脇部位; 前處理描述:帶皮,混合均勻打碎', '帶皮五花肉,帶皮三層肉', 368.157, 14.54, 33.9325, 13.5165, 0, NULL, 0, 62.2725),
(880, '肉類', '豬腹脇排', '樣品狀態:生,豬腹脇部位; 前處理描述:去軟骨,混合均勻打碎', '腩排,肉排,小排', 266.865, 18.744, 20.7126, 9.0429, 0, NULL, 0, 66.572),
(881, '肉類', '豬肝連', '樣品狀態:生,與豬肝相連之豬肉; 前處理描述:混合均勻打碎', '肝連,隔胸肉,條仔肉(橫隔肌)', 219.883, 14.583, 17.4738, 6.9652, 0, NULL, 0.064, 42.65),
(882, '肉類', '豬頰肉', '樣品狀態:生,與豬舌相連之豬肉; 前處理描述:混合均勻打碎', '豬舌肉,菊花肉', 182.193, 17.52, 11.905, 4.3184, 1.3775, NULL, NULL, 64.9),
(883, '肉類', '豬頰肉(2022年取樣)', '樣品狀態:生,與豬舌相連之豬肉; 前處理描述:混合均勻打碎', '豬舌肉,菊花肉', 156.98, 18.944, 8.4356, 2.4369, 2.1227, 0, 0.073, 66.62),
(884, '肉類', '豬頸肉', '樣品狀態:生; 前處理描述:混合均勻打碎', '松阪豬肉', 283.769, 17.237, 23.3001, 8.4472, 0.8429, NULL, 0.235, 43.289),
(885, '肉類', '豬絞肉平均值', '樣品狀態:生; 前處理描述:混合均勻打碎', NULL, 211.648, 18.738, 14.5939, 5.3689, 0, NULL, 0, 58.24),
(886, '肉類', '豬絞肉(70％瘦肉率)', '樣品狀態:生; 前處理描述:混合均勻打碎', NULL, 217.872, 18.972, 15.1731, 5.6109, 0, NULL, 0, 55.808),
(887, '肉類', '豬絞肉(90％瘦肉率)', '樣品狀態:生; 前處理描述:混合均勻打碎', NULL, 205.425, 18.504, 14.0147, 5.1292, 0, NULL, 0, 60.672),
(888, '肉類', '豬心', '樣品狀態:生,豬臟器; 前處理描述:混合均勻打碎', NULL, 128.003, 13.5745, 7.765, 3.0236, 1.0301, NULL, NULL, 73.63),
(889, '肉類', '豬白管', '樣品狀態:生,豬臟器; 前處理描述:混合均勻打碎', '豬管庭(廷),皇管(豬之胸大動脈)', 92.5513, 14.136, 3.5688, 1.5988, 0, NULL, 0, 67.864),
(890, '肉類', '豬皮', '樣品狀態:生,豬臟器; 前處理描述:混合均勻打碎', NULL, 490.905, 22.119, 43.9531, 14.5045, 0, NULL, 0.012, 108.935),
(891, '肉類', '豬耳', '樣品狀態:生,豬臟器; 前處理描述:混合均勻打碎', NULL, 218.904, 24.163, 12.8301, 4.3491, 0.8706, NULL, 0, 175.36),
(892, '肉類', '豬舌', '樣品狀態:生,豬臟器; 前處理描述:混合均勻打碎', NULL, 185.069, 18.468, 11.775, 4.2852, 0, NULL, NULL, 119.205),
(893, '肉類', '豬血', '樣品狀態:生; 前處理描述:混合均勻打碎', NULL, 29.387, 6.3017, 0.2748, 0.1084, 0.5152, NULL, 0, 178.651),
(894, '肉類', '豬尾', '樣品狀態:生,豬臟器; 前處理描述:去骨,混合均勻打碎', NULL, 294.893, 16.188, 25.03, 8.7458, 7.1377, NULL, NULL, 92.4),
(895, '肉類', '豬肝', '樣品狀態:生,豬臟器; 前處理描述:混合均勻打碎', NULL, 136.532, 20.813, 5.2839, 2.3574, 1.6635, NULL, 0, 83.89),
(896, '肉類', '豬肚', '樣品狀態:生,豬臟器; 前處理描述:混合均勻打碎', '豬胃', 151.958, 12.446, 10.955, 4.6144, 0, NULL, NULL, 61.795),
(897, '肉類', '熟豬肚', '樣品狀態:熟,豬臟器(豬肚),水煮; 前處理描述:混合均勻打碎', '豬胃', 136.549, 16.03, 7.55, 3.7205, 2.7008, NULL, NULL, 29.68),
(898, '肉類', '豬油渣', '前處理描述:豬皮下脂肪以瓦斯爐煉製豬油渣後,混合均勻打碎', NULL, 836.855, 17.388, 84.5464, 30.914, 0, NULL, 0, 152.84),
(899, '肉類', '豬骨湯平均值', '前處理描述:以不同部位豬骨慢火熬煮,取其平均值', '高湯', 7.9266, 0.948, 0.43, 0.1707, 0.0274, NULL, NULL, 14.98),
(900, '肉類', '豬大骨湯', '前處理描述:1082g大骨以2L沸水燙洗2分鐘,再以3.5L沸水熬煮4小時,最後定量至2 L.', '高湯', 7.0102, 1.008, 0.3, 0.1217, 0.4034, NULL, NULL, 23.31),
(901, '肉類', '豬肋骨湯', '前處理描述:603g枝骨以1L沸水燙洗2分鐘,再以3L沸水熬煮4小時,最後定量至2.3L.', '高湯,小骨湯,籤仔骨湯,冰仔骨湯,支骨湯', 8.7319, 0.693, 0.64, 0.2538, 0, NULL, NULL, 5.75),
(902, '肉類', '豬肩骨湯', '前處理描述:736g肩骨以2L沸水燙洗2分鐘,再以3L沸水熬煮4小時,最後定量至2L.', '高湯', 8.0376, 1.143, 0.35, 0.1361, 0.2352, NULL, NULL, 15.88),
(903, '肉類', '豬軟骨', '樣品狀態:生,軟骨帶部份肉; 前處理描述:混合均勻打碎', NULL, 332, 15.648, 29.3994, 11.0866, 0, NULL, 0, 89.88),
(904, '肉類', '豬腎', '樣品狀態:生,豬臟器; 前處理描述:混合均勻打碎', '腰子', 81.5053, 15.0215, 1.925, 0.5959, 1.6766, NULL, NULL, 101.69),
(905, '肉類', '豬脾臟', '樣品狀態:生,豬臟器; 前處理描述:混合均勻打碎', '腰尺', 78.8247, 15.038, 1.62, 0.2931, 2.0056, NULL, NULL, 51.07),
(906, '肉類', '豬大腸', '樣品狀態:生,豬臟器; 前處理描述:混合均勻打碎', NULL, 198.22, 6.592, 18.855, 9.9256, 1.9137, NULL, NULL, 44.72),
(907, '肉類', '豬小腸', '樣品狀態:生,豬臟器; 前處理描述:混合均勻打碎', NULL, 155.984, 12.4805, 11.385, 7.1547, 0.6162, NULL, NULL, 29.725),
(908, '肉類', '豬空腸', '樣品狀態:生,豬臟器; 前處理描述:混合均勻打碎', '粉腸', 185.624, 10.905, 15.4168, 8.3466, 8.6286, NULL, 0.099, 83.9395),
(909, '肉類', '豬前腳', '樣品狀態:生,豬腳; 前處理描述:去骨,混合均勻打碎', '豬腳,豬蹄,短腳', 252.029, 21.887, 17.58, 5.5315, 0, NULL, NULL, 114.185),
(910, '肉類', '豬後腳', '樣品狀態:生,豬腳; 前處理描述:去骨,混合均勻打碎', '豬腳,豬蹄,長腳', 252.93, 19.542, 18.79, 5.4989, 0, NULL, 0, 69.2),
(911, '肉類', '豬蹄膀', '樣品狀態:生,豬蹄膀; 前處理描述:去骨,含皮,混合均勻打碎', '豬腳,蹄膀,圓蹄', 330.989, 17.1, 28.6, 10.5677, 0, NULL, NULL, 50),
(912, '肉類', '豬腳筋', '樣品狀態:生; 前處理描述:混合均勻打碎', '蹄筋,長筋', 71.5662, 14.377, 1.1282, 0.2014, 0, NULL, 0, 44.34),
(913, '肉類', '豬腦', '樣品狀態:生,豬臟器; 前處理描述:混合均勻打碎', NULL, 124.59, 10.8, 8.7, 3.6731, 0, NULL, NULL, 120),
(914, '肉類', '土雞', '樣品狀態:生,全雞肉; 前處理描述:去頭尾,翅膀及腳,去骨及內臟,混合均勻打碎', '放山雞,走地雞', 196.019, 18.983, 12.7452, 3.2181, 0, NULL, 0, 70.02),
(915, '肉類', '肉雞', '樣品狀態:生,全雞肉; 前處理描述:去頭尾,翅膀及腳,去骨及內臟,混合均勻打碎', '飼料雞', 248.154, 16.121, 19.88, 5.1895, 0, NULL, NULL, 44.1),
(916, '肉類', '烏骨雞', '樣品狀態:生,全雞肉; 前處理描述:去頭尾,翅膀及腳,去骨及內臟,混合均勻打碎', '竹絲雞,絲羽烏骨雞,武山雞,烏雞', 212.227, 17.863, 15.0723, 4.1966, 0.8945, NULL, 0, 42.38),
(917, '肉類', '里肌肉平均值', '樣品狀態:生,雞胸部位; 前處理描述:去皮,混合均勻打碎', NULL, 109.069, 24.2488, 0.6127, 0.2172, 0, NULL, 0.201, 57.5465),
(918, '肉類', '里肌肉(土雞)', '樣品狀態:生,雞胸部位; 前處理描述:去皮,混合均勻打碎', NULL, 111.639, 24.845, 0.6154, 0.2313, 0, NULL, 0.201, 71.523),
(919, '肉類', '里肌肉(肉雞)', '樣品狀態:生,雞胸部位; 前處理描述:混合均勻打碎', NULL, 106.498, 23.6525, 0.61, 0.2033, 0, NULL, NULL, 43.57),
(920, '肉類', '帶骨去皮對切胸(肉雞)', '樣品狀態:生,雞胸部位; 前處理描述:去骨,混合均勻打碎', NULL, 103.766, 22.4, 0.9, 0.3414, 0, NULL, NULL, 49),
(921, '肉類', '帶骨帶皮對切胸(肉雞)', '樣品狀態:生,雞胸部位; 前處理描述:含皮,去骨,混合均勻打碎', NULL, 218.638, 19.327, 15.09, 4.5109, 0, NULL, NULL, 46.95),
(922, '肉類', '去皮清肉平均值', '樣品狀態:生,雞胸部位; 前處理描述:混合均勻打碎', NULL, 118.799, 23.335, 2.124, 0.6274, 0, NULL, 0.1585, 50.2085),
(923, '肉類', '去皮清肉(土雞)', '樣品狀態:生,雞胸部位; 前處理描述:混合均勻打碎', '去皮雞胸肉', 120.825, 23.356, 2.3387, 0.6866, 0, NULL, 0.317, 67.152),
(924, '肉類', '去皮清肉(肉雞)', '樣品狀態:生,雞胸部位; 前處理描述:混合均勻打碎', '去皮雞胸肉', 116.773, 23.314, 1.9093, 0.5674, 0.637, NULL, 0, 33.265),
(925, '肉類', '骨腿平均值', '樣品狀態:生,雞腿部位; 前處理描述:去骨,混合均勻打碎', NULL, 162.752, 18.0477, 9.4999, 2.7067, 0.1763, 0, 0, 67.9791),
(926, '肉類', '骨腿(土雞)', '樣品狀態:生,雞腿部位; 前處理描述:去骨,混合均勻打碎', '雞腿', 129.607, 21.708, 4.0924, 1.1926, 0, NULL, 0, 51.889),
(927, '肉類', '骨腿(肉雞)', '樣品狀態:生,雞腿部位; 前處理描述:去骨,混合均勻打碎', '雞腿', 195.898, 14.3874, 14.9073, 4.1503, 1.7137, 0, 0, 84.0691),
(928, '肉類', '清腿平均值', '樣品狀態:生,雞腿部位; 前處理描述:去骨,混合均勻打碎', NULL, 157.48, 18.4827, 8.7094, 2.5104, 0, 0, NULL, 116.896),
(929, '肉類', '清腿(土雞)', '樣品狀態:生,雞腿部位; 前處理描述:去骨,混合均勻打碎', '雞腿', 142.13, 20.4, 6.1, 1.7184, 0, NULL, NULL, 131),
(930, '肉類', '清腿(肉雞)', '樣品狀態:生,雞腿部位; 前處理描述:去骨,混合均勻打碎', '雞腿', 172.829, 16.5654, 11.3187, 3.3365, 0, 0, NULL, 102.791),
(931, '肉類', '棒棒腿平均值', '樣品狀態:生,雞腿部位; 前處理描述:去骨,混合均勻打碎', NULL, 151.192, 18.9143, 7.808, 2.2147, 0, NULL, 0, 138.55),
(932, '肉類', '棒棒腿(土雞)', '樣品狀態:生,雞腿部位; 前處理描述:去骨,混合均勻打碎', '雞腿', 142.888, 21, 5.9, 1.6078, 0, NULL, NULL, 168),
(933, '肉類', '棒棒腿(肉雞)', '樣品狀態:生,雞腿部位; 前處理描述:去骨,混合均勻打碎', '雞腿', 159.495, 16.8285, 9.7159, 2.8642, 0.3234, NULL, 0, 109.1),
(934, '肉類', '雞排平均值', '樣品狀態:生,雞腿部位; 前處理描述:去骨,混合均勻打碎', NULL, 183.236, 17.096, 12.2213, 3.6943, 0, NULL, NULL, 86.255),
(935, '肉類', '雞排(土雞)', '樣品狀態:生,雞腿部位; 前處理描述:去骨,混合均勻打碎', NULL, 158.275, 18.9, 8.6, 2.5121, 0, NULL, NULL, 97),
(936, '肉類', '雞排(肉雞)', '樣品狀態:生,雞腿部位; 前處理描述:去骨,混合均勻打碎', NULL, 208.196, 15.292, 15.8425, 4.9503, 0, NULL, NULL, 75.51),
(937, '肉類', '雞排(肉雞)(2021年取樣)', '樣品狀態:生,雞腿部位; 前處理描述:去骨,混合均勻打碎', NULL, 251.106, 14.897, 20.7867, 5.772, 0, 0, 0, 94.4),
(938, '肉類', '去皮去骨雞腿(肉雞)', '樣品狀態:生,雞腿部位; 前處理描述:去骨,去皮,混合均勻打碎', NULL, 164.654, 19.804, 8.8792, 2.3504, 0, 0, 0, 67.72),
(939, '肉類', '二節翅平均值', '樣品狀態:生,雞翅部位; 前處理描述:去骨,含皮,混合均勻打碎', NULL, 225.569, 18.0893, 16.4444, 4.4462, 0, NULL, 0, 83.08),
(940, '肉類', '二節翅(土雞)', '樣品狀態:生,雞翅部位; 前處理描述:去骨,含皮,混合均勻打碎', NULL, 227.964, 19.8, 15.9, 4.1372, 0, NULL, NULL, 68),
(941, '肉類', '二節翅(肉雞)', '樣品狀態:生,雞翅部位; 前處理描述:去骨,含皮,混合均勻打碎', NULL, 223.174, 16.3785, 16.9887, 4.7662, 0.6317, NULL, 0, 98.16),
(942, '肉類', '三節翅平均值', '樣品狀態:生,雞翅部位; 前處理描述:去骨,含皮,混合均勻打碎', NULL, 210.302, 18.3292, 14.6382, 4.0846, 0, NULL, NULL, 75.3803),
(943, '肉類', '三節翅(土雞)', '樣品狀態:生,雞翅部位; 前處理描述:去骨,含皮,混合均勻打碎', NULL, 198.39, 19, 13, 3.4398, 0, NULL, NULL, 66),
(944, '肉類', '三節翅(肉雞)', '樣品狀態:生,雞翅部位; 前處理描述:去骨,含皮,混合均勻打碎', NULL, 222.213, 17.6583, 16.2763, 4.7766, 0, NULL, NULL, 84.7606),
(945, '肉類', '翅腿(肉雞)', '樣品狀態:生,雞翅部位; 前處理描述:去骨,含皮,混合均勻打碎', '小雞腿', 209.688, 17.759, 14.84, 3.9849, 0.9968, NULL, NULL, 69.82),
(946, '肉類', '雞絞肉', '樣品狀態:生; 前處理描述:混合均勻打碎', NULL, 131.267, 27.44, 1.563, 0.5534, 0, NULL, 0, 38.09),
(947, '肉類', '雞心(肉雞)', '樣品狀態:生,雞臟器; 前處理描述:混合均勻打碎', NULL, 189.682, 13.2535, 14.755, 4.4154, 0.1004, NULL, NULL, 87.125),
(948, '肉類', '雞心(肉雞)(2021年取樣)', '樣品狀態:生,雞臟器; 前處理描述:混合均勻打碎', NULL, 204.427, 14.445, 15.8256, 4.3673, 1.2067, 0, 0, 84.52),
(949, '肉類', '雞尾椎', '樣品狀態:生,雞臟器; 前處理描述:去骨,混合均勻打碎', '雞屁股', 452.267, 8.953, 45.9022, 13.0235, 0.0634, 0, 0.02, 35.056),
(950, '肉類', '雞肝(肉雞)', '樣品狀態:生,雞臟器; 前處理描述:混合均勻打碎', NULL, 111.335, 18.786, 3.45, 1.4893, 2.6984, NULL, NULL, 93.415),
(951, '肉類', '雞胗(肉雞)', '樣品狀態:生,雞臟器; 前處理描述:混合均勻打碎', '雞肫', 88.9813, 16.635, 1.99, 0.6472, 0.2942, NULL, NULL, 57.37),
(952, '肉類', '雞胸骨湯', '前處理描述:560g雞胸骨以1L沸水燙洗2分鐘,再以2L沸水小火熬煮4小時,最後定量至2L.', '雞高湯', 8.8239, 1.475, 0.28, 0.0812, 0.211, NULL, NULL, 24.35),
(953, '肉類', '雞睪丸', '樣品狀態:生,雞臟器; 前處理描述:混合均勻打碎', '雞子,雞弗', 70.6519, 10.572, 2.8281, 1.2086, 0.2333, NULL, 0, 89.932),
(954, '肉類', '雞腳(肉雞)', '樣品狀態:生,雞腳; 前處理描述:去骨,混合均勻打碎', '雞爪,鳳爪', 208.549, 20.6625, 13.3393, 2.8742, 1.2454, NULL, 0, 101.79),
(955, '肉類', '雞膝軟骨(肉雞)', '樣品狀態:生,雞臟器; 前處理描述:混合均勻打碎', '雞軟骨', 107.1, 20.404, 2.2145, 0.6922, 0.4959, NULL, 0, 196.703),
(956, '肉類', '雞皮(肉雞)', '樣品狀態:生,雞臟器; 前處理描述:混合均勻打碎', NULL, 441.716, 11.668, 43.4472, 11.242, 0, 0, 0, 40.08),
(957, '肉類', '太空鴨', '樣品狀態:生,全鴨肉; 前處理描述:去尾巴,去骨,混合均勻打碎', NULL, 319.231, 15.973, 27.83, 9.1239, 0, NULL, NULL, 41.03),
(958, '肉類', '番鴨', '樣品狀態:生,全鴨肉; 前處理描述:去頭腳,去骨及內臟,混合均勻打碎', '麝番鴨,紅面鴨,紅面(正)番鴨', 228.758, 18.23, 16.7313, 5.4127, 0, NULL, 0.231, 51.25),
(959, '肉類', '太空鴨(去皮)', '樣品狀態:生,全鴨肉; 前處理描述:去皮,去頭尾,去翅腳,去骨,混合均勻打碎', NULL, 101.875, 20.075, 1.791, 0.6192, 0, NULL, 0, 64.399),
(960, '肉類', '土番鴨', '樣品狀態:生,全鴨肉; 前處理描述:去皮,去頭腳,去骨及內臟,混合均勻打碎', NULL, 110.891, 20.9, 2.4, 0.743, 0, NULL, NULL, 70),
(961, '肉類', '櫻桃鴨胸肉片', '樣品狀態:生,鴨胸部位; 前處理描述:去骨,混合均勻打碎', NULL, 226.53, 16.701, 17.2081, 4.4689, 4.6863, NULL, 0.942, 37.386),
(962, '肉類', '鴨腿', '樣品狀態:生,鴨腿部位; 前處理描述:去骨,混合均勻打碎', NULL, 282.187, 14.353, 24.49, 7.6824, 3.3766, NULL, NULL, 47.8),
(963, '肉類', '鴨血', '樣品狀態:生; 前處理描述:混合均勻打碎', NULL, 28.79, 6.006, 0.3486, 0.1459, 0, NULL, 0, 130.9),
(964, '肉類', '鴨胗', '樣品狀態:生,鴨臟器; 前處理描述:混合均勻打碎', '鴨肫', 97.2723, 20.499, 1.08, 0.3876, 0.3138, NULL, NULL, 78.53),
(965, '肉類', '去骨鴨掌', '樣品狀態:生; 前處理描述:混合均勻打碎', NULL, 113.489, 12.589, 6.6224, 1.4937, 0, NULL, 0, 77.83),
(966, '肉類', '鴨腸', '樣品狀態:生,鴨臟器; 前處理描述:混合均勻打碎', NULL, 93.6642, 13.787, 3.8574, 1.4605, 0, NULL, 0, 52.965),
(967, '肉類', '鴨翅', '樣品狀態:生; 前處理描述:去骨,混合均勻打碎', NULL, 170.289, 22.751, 8.1089, 2.3779, 0, 0, 0, 67.45),
(968, '肉類', '鴨頭', '樣品狀態:生; 前處理描述:去骨,取可食部分(包含腦隨)混合均勻打碎', NULL, 199.043, 16.497, 14.2573, 4.1907, 0, 0, 0, 73.62),
(969, '肉類', '鴨舌', '樣品狀態:生; 前處理描述:去骨,混合均勻打碎', NULL, 187.169, 16.006, 13.1733, 2.7622, 0, 0, 0, 57.07),
(970, '肉類', '鵝肉', '樣品狀態:生,全鵝肉; 前處理描述:含皮,去頭腳,去骨及內臟,混合均勻打碎', NULL, 187.48, 15.6, 13.4, 3.484, 2.4, NULL, NULL, 54),
(971, '肉類', '鵝胸肉', '樣品狀態:生,鵝胸部位; 前處理描述:去皮,混合均勻打碎', NULL, 120.331, 23.46, 2.2347, 0.6774, 0.2075, NULL, 0, 50.673),
(972, '肉類', '鵝腿肉', '樣品狀態:生,鵝腿部位; 前處理描述:去皮,去骨,混合均勻打碎', NULL, 130.411, 21.692, 4.1891, 1.1064, 0, NULL, 0, 75.144),
(973, '肉類', '鵝心', '樣品狀態:生,鵝臟器; 前處理描述:混合均勻打碎', NULL, 241.374, 14.512, 19.89, 5.0546, 0, NULL, 0, 71.807),
(974, '肉類', '鵝肝', '樣品狀態:生,鵝臟器; 前處理描述:混合均勻打碎', NULL, 122.993, 20.487, 3.9372, 1.822, 0.6418, NULL, 0, 391.934),
(975, '肉類', '鵝胗', '樣品狀態:生,鵝臟器; 前處理描述:混合均勻打碎', '鵝肫', 95.2911, 17.359, 2.3468, 0.752, 2.8204, NULL, 0, 76.592),
(976, '肉類', '鵝腸', '樣品狀態:生,鵝臟器; 前處理描述:混合均勻打碎', NULL, 62.9221, 9.2195, 2.6114, 0.8644, 0.7315, NULL, 0, 109.989),
(977, '肉類', '火雞肉', '樣品狀態:生,全火雞; 前處理描述:含皮,去頭腳,去骨及內臟,混合均勻打碎', '七面鳥,吐綬雞', 140.609, 21.1, 5.6, 2.0793, 0, NULL, NULL, 51),
(978, '肉類', '鴕鳥菲力肉排', '樣品狀態:生,鴕鳥上肉部位,冷凍產品; 前處理描述:混合均勻打碎', '鴕鳥腓力,鴕鳥里肌肉', 105.059, 22.8285, 0.8405, 0.2576, 0.7987, NULL, 0.18, 59.2235),
(979, '肉類', '鴕鳥沙朗肉排', '樣品狀態:生,鴕鳥上肉部位,冷凍產品; 前處理描述:混合均勻打碎', NULL, 96.6667, 20.899, 0.8235, 0.2805, 6.0579, NULL, 0.263, 54.883),
(980, '肉類', '鴕腱肉', '樣品狀態:生,鴕鳥其他肉部位,冷凍產品; 前處理描述:混合均勻打碎', '屈肌,伸肌', 107.47, 18.714, 3.0556, 1.0296, 0.2231, NULL, 0, 75.023),
(981, '肉類', '鴕腩肉', '樣品狀態:生,鴕鳥其他肉部位,冷凍產品; 前處理描述:混合均勻打碎', NULL, 143.598, 21.166, 5.9001, 2.0402, 0.6619, NULL, 0, 85.927),
(982, '肉類', '山豬肉片', '樣品狀態:生,冷凍包裝; 前處理描述:混合均勻打碎', '山豬肉', 465.562, 11.881, 45.99, 10.1912, 0, 0, 0, 30.36),
(983, '肉類', '虎皮蛙', '樣品狀態:生,人工養殖; 前處理描述:去頭,去皮,去骨及內臟,混合均勻打碎', '虎斑蛙,虎紋蛙,水雞,田雞,台灣青蛙', 93.705, 21.1, 0.4, 0.1212, 0.6, NULL, NULL, 70),
(984, '肉類', '蛇肉', '樣品狀態:生; 前處理描述:含皮,去頭,去骨及內臟,混合均勻打碎', NULL, 84.738, 19, 0.4, 0.1285, 0, NULL, NULL, 29),
(985, '魚貝類', '雙髻鯊', '樣品狀態:生; 前處理描述:去鱗,含皮,去頭尾,去內臟及骨刺,混合均勻打碎', '丫髻鯊(鮫),犛頭沙,雙髻鯊,雙過仔', 117.326, 27.35, 0.06, 0.0234, 0, NULL, NULL, 82.76),
(986, '魚貝類', '雙髻鯊腹肉', '樣品狀態:生; 前處理描述:取腹部附近魚身一段,去皮,去骨刺及筋,混合均勻打碎', '丫髻鯊(鮫),犛頭沙,雙髻鯊,雙過仔', 110.166, 25.8, 0, NULL, 0, NULL, NULL, 142),
(987, '魚貝類', '鯊魚切片', '樣品狀態:生; 前處理描述:混合均勻打碎', '沙魚', 105.983, 24.7865, 0.016, 0.0061, 0, NULL, NULL, 61.5837),
(988, '魚貝類', '魟魚', '樣品狀態:生; 前處理描述:去鱗,含皮,去頭尾,去內臟及骨刺,混合均勻打碎', NULL, 106.357, 24.76, 0.07, 0.006, 0, NULL, NULL, 167.63),
(989, '魚貝類', '日本鰻鱺魚片(生)', '樣品狀態:生; 前處理描述:混合均勻打碎', '白鰻,日本鰻,正鰻,白鱔,鰻鱺,土鰻(澎湖),淡水鰻(澎湖) ', 253.695, 18.091, 19.5617, 5.6723, 0, NULL, 0, 46.97),
(990, '魚貝類', '灰海鰻', '樣品狀態:生; 前處理描述:去鱗,去皮,去頭尾,去內臟及硬骨,混合均勻打碎(有軟刺未完全去除)', '虎鰻,海鰻,錢鰻(臺東)', 96.555, 20.5, 1, 0.4239, 0, NULL, NULL, 83),
(991, '魚貝類', '魩仔魚', '樣品狀態:生; 前處理描述:混合均勻打碎', '魩仔', 55.617, 11.0715, 0.9248, 0.3769, 0, NULL, 0, 455.745),
(992, '魚貝類', '魩仔魚平均值(加工)', '樣品狀態:熟,水煮; 前處理描述:混合均勻打碎', '魩仔', 123.831, 26.213, 1.3195, 0.3268, 0.9992, NULL, NULL, 1840.57),
(993, '魚貝類', '魩仔魚(加工,大)', '樣品狀態:熟,水煮; 前處理描述:混合均勻打碎', '魩仔', 96.9106, 20.672, 0.958, 0.1995, 1.0598, NULL, NULL, 851.341),
(994, '魚貝類', '魩仔魚(加工,小)', '樣品狀態:熟,水煮; 前處理描述:混合均勻打碎', '魩仔', 150.752, 31.754, 1.681, 0.4826, 0.9386, NULL, NULL, 2829.8),
(995, '魚貝類', '魩仔魚(加工)', '樣品狀態:熟,水煮; 前處理描述:混合均勻打碎', NULL, 105.244, 23.03, 0.7656, 0.3813, 0, 0, 0, 1447.54),
(996, '魚貝類', '鱙仔魚(加工)', '樣品狀態:熟,水煮; 前處理描述:混合均勻打碎', '針魩仔,鱙仔,寮仔魚', 101.484, 20.986, 1.3164, 0.1722, 0, NULL, 0, 705.482),
(997, '魚貝類', '日本銀帶鯡(加工)', '樣品狀態:熟,水煮; 前處理描述:混合均勻打碎', '針嘴鰮,丁香魚,魩仔,丁香,鱙仔,灰海荷鰮', 111.239, 21.54, 2.1356, 1.0731, 1.1599, NULL, 0.132, 735.962),
(998, '魚貝類', '日本銀帶鯡魚干(丁香魚脯)', '樣品狀態:乾貨; 前處理描述:混合均勻打碎', '針嘴鰮,丁香魚,魩仔,丁香,鱙仔,灰海荷鰮', 274.76, 51.766, 5.9556, 3.3482, 1.7404, NULL, 0.075, 1276.21),
(999, '魚貝類', '虱目魚平均值(去皮)', '樣品狀態:生; 前處理描述:去鱗,去皮,去頭尾,去內臟及骨刺,混合均勻打碎', '麻虱目仔,麻虱(蝨)目,蝨(遮/塞)目魚,虱麻魚,海草魚,安平魚,國姓(聖)魚', 178.851, 21.84, 9.4894, 3.2798, 0.1554, NULL, NULL, 41.3935),
(1000, '魚貝類', '虱目魚(2月)', '樣品狀態:生; 前處理描述:去鱗,去皮,去頭尾,去內臟及骨刺,混合均勻打碎', '海草魚,遮目魚,殺目魚,安平魚,國姓魚,麻虱目仔,虱目/麻虱目(澎湖)', 179.895, 19.787, 10.577, 4.115, 1.3422, NULL, NULL, 43.979),
(1001, '魚貝類', '虱目魚(5月)', '樣品狀態:生; 前處理描述:去鱗,去皮,去頭尾,去內臟及骨刺,混合均勻打碎', '海草魚,遮目魚,殺目魚,安平魚,國姓魚,麻虱目仔,虱目/麻虱目(澎湖)', 189.405, 22.329, 10.428, 3.031, 0, NULL, NULL, 26.9028),
(1002, '魚貝類', '虱目魚(8月)', '樣品狀態:生; 前處理描述:去鱗,去皮,去頭尾,去內臟及骨刺,混合均勻打碎', '海草魚,遮目魚,殺目魚,安平魚,國姓魚,麻虱目仔,虱目/麻虱目(澎湖)', 124.35, 23.731, 2.552, 0.8088, 0.4842, NULL, NULL, 41.8856),
(1003, '魚貝類', '虱目魚(9月)', '樣品狀態:生; 前處理描述:去鱗,去皮,去頭尾,去內臟及骨刺,混合均勻打碎', '海草魚,遮目魚,殺目魚,安平魚,國姓魚,麻虱目仔,虱目/麻虱目(澎湖)', 208.271, 21.99, 12.68, 4.6209, 0, NULL, NULL, 40.83),
(1004, '魚貝類', '虱目魚(12月)', '樣品狀態:生; 前處理描述:去鱗,去皮,去頭尾,去內臟及骨刺,混合均勻打碎', '海草魚,遮目魚,殺目魚,安平魚,國姓魚,麻虱目仔,虱目/麻虱目(澎湖)', 192.334, 21.363, 11.21, 4.1148, 0.0824, NULL, NULL, 53.37),
(1005, '魚貝類', '虱目魚(含皮)', '樣品狀態:生; 前處理描述:去鱗,含皮,去頭尾,去內臟及骨刺,混合均勻打碎', '海草魚,遮目魚,殺目魚,安平魚,國姓魚,麻虱目仔,虱目/麻虱目(澎湖)', 200.424, 21.8, 11.9, 4.7124, 0, NULL, NULL, 96),
(1006, '魚貝類', '虱目魚(2022年取樣)', '樣品狀態:生; 前處理描述:去鱗,含皮,去頭尾,去內臟及骨刺,混合均勻打碎', '海草魚,遮目魚,殺目魚,安平魚,國姓魚,麻虱目仔,虱目/麻虱目(澎湖)', 242.54, 20.073, 17.3867, 5.8978, 1.4442, 0, 0, 46.21),
(1007, '魚貝類', '虱目魚腹肉(虱目魚肚)', '樣品狀態:生,冷凍包裝; 前處理描述:去皮及骨刺,混合均勻打碎', NULL, 341.828, 17.431, 29.645, 8.9724, 0, NULL, 0.683, 47.046),
(1008, '魚貝類', '草魚切片', '樣品狀態:生; 前處理描述:去皮及骨刺,混合均勻打碎', '鯇,鯤,池魚,草根魚,草鰱(高屏地區) ', 166.406, 21.381, 8.327, 1.9885, 2.0674, NULL, 0.022, 52.816),
(1009, '魚貝類', '草魚(含皮)', '樣品狀態:生; 前處理描述:去鱗,含皮,去頭尾,去內臟及骨刺,混合均勻打碎', '鯇,鯤,池魚,草根魚,草鰱(高屏地區) ', 91.484, 17.2, 2, 0.5418, 0.8, NULL, NULL, 37),
(1010, '魚貝類', '鯉', '樣品狀態:生; 前處理描述:去鱗,含皮,去頭尾,去內臟及骨刺,混合均勻打碎', '鮘仔,在來鯉,財神魚', 90.779, 14.5, 3.2, 0.7251, 2.1, NULL, NULL, 38),
(1011, '魚貝類', '鱅', '樣品狀態:生; 前處理描述:去鱗,含皮,去頭尾,去內臟及骨刺,混合均勻打碎', '黑鰱,大頭鰱(魚),花鰱,胖頭鰱 ', 144.793, 18.7, 7.2, 1.7712, 0, NULL, NULL, 24),
(1012, '魚貝類', '鬍鯰', '樣品狀態:生; 前處理描述:去鱗,含皮,去頭尾,去內臟及骨刺,混合均勻打碎', '鬍子鯰,土殺,本土土虱,塘虱魚', 194.077, 16.3, 13.8, 5.3213, 0, NULL, NULL, 37),
(1013, '魚貝類', '斑海鯰', '樣品狀態:生; 前處理描述:去鱗,含皮,去頭尾,去內臟及骨刺,混合均勻打碎', '成仔魚,成仔丁,銀成,白肉成,臭臊成,生仔魚,鰻鯰,賓士魚', 86.0051, 19.17, 0.46, 0.1726, 0, NULL, NULL, 114.95),
(1014, '魚貝類', '長體油胡瓜魚', '樣品狀態:生; 前處理描述:去頭,含魚卵,混合均勻打碎', '柳葉魚', 103.793, 15.002, 4.4051, 0.8965, 0, NULL, 0, 104.468),
(1015, '魚貝類', '香魚', '樣品狀態:生; 前處理描述:去鱗,去皮,去頭尾,去內臟及骨刺,混合均勻打碎', '桀(加魚邊)魚,Ayu,年魚', 146.838, 18.524, 7.51, 2.7438, 0, NULL, NULL, 52.56),
(1016, '魚貝類', '銀魚', '樣品狀態:生; 前處理描述:混合均勻打碎', '水晶魚,小銀魚', 69.3265, 14.343, 0.896, 0.1968, 0.8935, NULL, NULL, 56.0616),
(1017, '魚貝類', '白肉鮭魚切片', '樣品狀態:生; 前處理描述:去皮及骨刺,混合均勻打碎', NULL, 151.23, 22.563, 6.0849, 1.6648, 0.2913, NULL, NULL, 53.0993),
(1018, '魚貝類', '紅肉鮭魚切片', '樣品狀態:生; 前處理描述:去皮及骨刺,混合均勻打碎', NULL, 157.85, 24.331, 5.9819, 3.0668, 0, NULL, NULL, 71.9615),
(1019, '魚貝類', '大西洋鮭魚平均值(去皮)', '樣品狀態:生; 前處理描述:去鱗,去皮,去頭尾,去內臟及骨刺,混合均勻打碎', NULL, 220.634, 20.1954, 14.9001, 4.0489, 0, NULL, 0.0733, 44.6452),
(1020, '魚貝類', '大西洋鮭魚(台灣養殖)', '樣品狀態:生; 前處理描述:去鱗,去皮,去頭尾,去內臟及骨刺,混合均勻打碎', NULL, 154.92, 23.63, 5.9889, 1.6689, 0, NULL, 0.3667, 45.403),
(1021, '魚貝類', '大西洋鮭魚切片(中段)', '樣品狀態:生; 前處理描述:去皮及骨刺,混合均勻打碎', NULL, 173.671, 20.697, 9.4562, 2.5864, 0, NULL, 0, 39.459),
(1022, '魚貝類', '大西洋鮭魚切片(尾段)', '樣品狀態:生; 前處理描述:去皮及骨刺,混合均勻打碎', NULL, 203.548, 20.6735, 12.7796, 3.6626, 0, NULL, 0, 60.953),
(1023, '魚貝類', '大西洋鮭魚生魚片', '樣品狀態:生; 前處理描述:混合均勻打碎', NULL, 221.849, 19.623, 15.3059, 4.0766, 0, NULL, 0, 35.626),
(1024, '魚貝類', '大西洋鮭魚腹肉', '樣品狀態:生,腹部肉; 前處理描述:去皮及骨刺,混合均勻打碎', NULL, 349.18, 16.3535, 30.9701, 7.8526, 0, NULL, 0, 41.785),
(1025, '魚貝類', '麥奇鈎吻鮭(去皮)', '樣品狀態:生; 前處理描述:去鱗,去皮,去頭尾,去內臟及骨刺,混合均勻打碎', '鱒魚,虹鱒,麥奇鉤吻鱒', 159.838, 20.861, 7.845, 2.3896, 0, NULL, NULL, 48.4935),
(1026, '魚貝類', '麥奇鈎吻鮭(含皮)', '樣品狀態:生; 前處理描述:去鱗,含皮,去頭尾,去內臟及骨刺,混合均勻打碎', '鱒魚,虹鱒,麥奇鉤吻鱒', 147.163, 20.1, 6.8, 2.1882, 0.4, NULL, NULL, 23),
(1027, '魚貝類', '姬魚', '樣品狀態:生; 前處理描述:去鱗,含皮,去頭尾,去內臟及骨刺,混合均勻打碎', '仙女魚,狗母,汕狗母', 104.488, 24.09, 0.18, 0.0205, 0, NULL, NULL, 88.43),
(1028, '魚貝類', '印度鐮齒魚', '樣品狀態:生; 前處理描述:去鱗,含皮,去頭尾,去內臟及骨刺,混合均勻打碎', '水狗母,粉粘,那哥,那個魚', 48.6261, 10.395, 0.47, 0.1333, 0.375, NULL, NULL, 192.24),
(1029, '魚貝類', '狗母魚(蛇鯔)', '樣品狀態:生; 前處理描述:去鱗,含皮,去頭尾,去內臟及骨刺,混合均勻打碎', '狗母梭,狗母', 103.105, 20.83, 1.57, 0.5897, 0.14, NULL, NULL, 59.65),
(1030, '魚貝類', '鮟鱇', '樣品狀態:生; 前處理描述:去鱗,去皮,去頭尾,去內臟及骨刺,混合均勻打碎', NULL, 67.6823, 14.876, 0.4614, 0.1602, 0.5815, NULL, 0.002, 117.032),
(1031, '魚貝類', '鯔平均值(去皮)', '樣品狀態:生(不含魚卵); 前處理描述:去鱗,去皮,去頭尾,去內臟及骨刺,混合均勻打碎', '烏(鯔/信/聖)魚,青頭仔(幼魚),奇目仔(成魚),正(大)烏,正(回)頭烏,日本鯔', 152.414, 20.6176, 7.1371, 2.3339, 0.2659, NULL, 0, 50.2403),
(1032, '魚貝類', '鯔(2月)', '樣品狀態:生(不含魚卵); 前處理描述:去鱗,去皮,去頭尾,去內臟及骨刺,混合均勻打碎', '青頭仔(幼魚),奇目仔(成魚),信魚,正烏,烏魚,正頭烏,回頭烏,大烏(澎湖) ', 137.055, 20.403, 5.536, 2.0577, 1.6031, NULL, NULL, 42.414),
(1033, '魚貝類', '鯔(4月)', '樣品狀態:生(不含魚卵); 前處理描述:去鱗,去皮,去頭尾,去內臟及骨刺,混合均勻打碎', '青頭仔(幼魚),奇目仔(成魚),信魚,正烏,烏魚,正頭烏,回頭烏,大烏(澎湖)', 132.507, 20.415, 5.026, 1.5797, 0.9421, NULL, NULL, 43.4522),
(1034, '魚貝類', '鯔(8月)', '樣品狀態:生(已去鱗及內臟,不含魚卵); 前處理描述:去皮,去頭尾及骨刺,混合均勻打碎', '青頭仔(幼魚),奇目仔(成魚),信魚,正烏,烏魚,正頭烏,回頭烏,大烏(澎湖)', 223.931, 17.267, 16.652, 5.8365, 0, NULL, NULL, 73.1235),
(1035, '魚貝類', '鯔(11月,雄魚)', '樣品狀態:生(不含魚精囊); 前處理描述:去鱗,去皮,去頭尾,去內臟及骨刺,混合均勻打碎', '青頭仔(幼魚),奇目仔(成魚),信魚,正烏,烏魚,正頭烏,回頭烏,大烏(澎湖)', 129.075, 21.314, 4.22, 1.3766, 0, NULL, NULL, 63.21),
(1036, '魚貝類', '鯔(11月,雌魚)', '樣品狀態:生(不含魚卵); 前處理描述:去鱗,去皮,去頭尾,去內臟及骨刺,混合均勻打碎', '青頭仔(幼魚),奇目仔(成魚),信魚,正烏,烏魚,正頭烏,回頭烏,大烏(澎湖)', 140.922, 21.469, 5.46, 1.8143, 0, NULL, NULL, 56.59),
(1037, '魚貝類', '鯔(12月,雄魚)', '樣品狀態:生(不含魚精囊); 前處理描述:去鱗,去皮,去頭尾,去內臟及骨刺,混合均勻打碎', '青頭仔(幼魚),奇目仔(成魚),信魚,正烏,烏魚,正頭烏,回頭烏,大烏(澎湖)', 137.079, 21.055, 5.23, 1.8918, 0.9479, NULL, NULL, 59.138),
(1038, '魚貝類', '鯔(12月,雌魚)', '樣品狀態:生(不含魚卵); 前處理描述:去鱗,去皮,去頭尾,去內臟及骨刺,混合均勻打碎', '青頭仔(幼魚),奇目仔(成魚),信魚,正烏,烏魚,正頭烏,回頭烏,大烏(澎湖)', 149.143, 21.789, 6.22, 1.7594, 0.2489, NULL, NULL, 36.988),
(1039, '魚貝類', '鯔切片', '樣品狀態:生,冷凍包裝; 前處理描述:去皮,混合均勻打碎', '青頭仔(幼魚),奇目仔(成魚),信魚,正烏,烏魚,正頭烏,回頭烏,大烏(澎湖)', 169.6, 21.229, 8.753, 2.4198, 0.0244, NULL, 0, 27.007),
(1040, '魚貝類', '鯔(含皮)', '樣品狀態:生; 前處理描述:去鱗,含皮,去頭尾,去內臟及骨刺,混合均勻打碎', '青頭仔(幼魚),奇目仔(成魚),信魚,正烏,烏魚,正頭烏,回頭烏,大烏(澎湖)', 154.851, 20.64, 7.3967, 2.629, 0, NULL, NULL, 49.4533),
(1041, '魚貝類', '斑鰭飛魚', '樣品狀態:生; 前處理描述:去鱗,含皮,去頭尾,去內臟及骨刺,混合均勻打碎', '小烏,飛烏,花烏(澎湖)', 94.486, 21.98, 0.07, 0.0285, 0.19, NULL, NULL, 53.81),
(1042, '魚貝類', '斑鱵', '樣品狀態:生; 前處理描述:去鱗,含皮,去頭尾,去內臟及骨刺,混合均勻打碎', '補網師,水針,莎優莉,簪針(澎湖),七星針(南部)', 90.9765, 20.63, 0.32, 0.1442, 0.3121, NULL, NULL, 78.84),
(1043, '魚貝類', '鱷形叉尾鶴鱵', '樣品狀態:生; 前處理描述:去鱗,含皮,去頭尾,去內臟及骨刺,混合均勻打碎', '青旗,學仔,白天青旗,圓學(澎湖)', 97.6895, 22.35, 0.25, 0.0876, 0.15, NULL, NULL, 63.5),
(1044, '魚貝類', '金鱗魚', '樣品狀態:生; 前處理描述:去鱗,含皮,去頭尾,去內臟及骨刺,混合均勻打碎', NULL, 84.6607, 19.51, 0.15, 0.0594, 1.26, NULL, NULL, 60.89),
(1045, '魚貝類', '鱗馬鞭魚', '樣品狀態:生; 前處理描述:去鱗,去皮,去頭尾,去內臟及骨刺,混合均勻打碎', '馬鞭魚,馬戍,槍管,火管,剃仔,土管(臺東) ', 83.8395, 18.512, 0.5314, 0.2038, 0, NULL, 0.034, 120.609),
(1046, '魚貝類', '黃鱔', '樣品狀態:生; 前處理描述:去頭及腸管內臟,混合均勻打碎', '鱔魚,田鱔,田鰻,長魚,血魚,羅魚,無鱗公子', 88.1099, 17.616, 1.429, 0.4429, 0.9618, NULL, 0, 54.763),
(1047, '魚貝類', '石狗公', '樣品狀態:生; 前處理描述:去鱗,含皮,去頭尾,去內臟及骨刺,混合均勻打碎', '石頭魚,獅甕(澎湖),紅鱠仔', 80.04, 18.28, 0.22, 0.0254, 0, NULL, NULL, 67.3),
(1048, '魚貝類', '環紋簑鮋', '樣品狀態:生; 前處理描述:去鱗,含皮,去頭尾,去內臟及骨刺,混合均勻打碎', '龍鬚簑鮋,獅子魚,長獅,魔鬼,國公,石狗敢,虎魚,雞公,紅虎,火烘,石頭魚', 79.47, 18.4, 0.1, 0.0354, 0, NULL, NULL, 145),
(1049, '魚貝類', '深海鱗角魚', '樣品狀態:生; 前處理描述:去鱗,含皮,去頭尾,去內臟及骨刺,混合均勻打碎', '深海角魚,雞角,角仔魚', 80.0463, 17.69, 0.5, 0.1682, 0, NULL, NULL, 104.99),
(1050, '魚貝類', '尖嘴鱸(去皮)', '樣品狀態:生(已去鱗及內臟); 前處理描述:去皮,去頭尾及骨刺,混合均勻打碎', '金目鱸,盲槽,扁紅目鱸', 98.2869, 20.571, 1.1584, 0.3379, 0.1486, NULL, NULL, 48.2306),
(1051, '魚貝類', '尖嘴鱸(含皮)', '樣品狀態:生; 前處理描述:去鱗,含皮,去頭尾,去內臟及骨刺,混合均勻打碎', '金目鱸,盲槽,扁紅目鱸', 107.144, 19.6, 2.6, 1.0429, 0, NULL, NULL, 51),
(1052, '魚貝類', '日本花鱸平均值', '樣品狀態:生; 前處理描述:去鱗,去皮,去頭尾,去內臟及骨刺,混合均勻打碎', '七星鱸,花鱸,青鱸,鱸魚,日本真鱸 ', 97.9124, 19.8504, 1.458, 0.4228, 0.8831, NULL, NULL, 61.5287),
(1053, '魚貝類', '日本花鱸(2月)', '樣品狀態:生; 前處理描述:去鱗,去皮,去頭尾,去內臟及骨刺,混合均勻打碎', '七星鱸,花鱸,青鱸,鱸魚,日本真鱸 ', 94.8013, 20.14, 0.976, 0.2658, 1.9139, NULL, NULL, 44.115),
(1054, '魚貝類', '日本花鱸((3月)', '樣品狀態:生; 前處理描述:去鱗,去皮,去頭尾,去內臟及骨刺,混合均勻打碎', '七星鱸,花鱸,青鱸,鱸魚,日本真鱸 ', 99.7437, 19.992, 1.594, 0.4547, 0.5122, NULL, NULL, 64.9345),
(1055, '魚貝類', '日本花鱸((8月)', '樣品狀態:生; 前處理描述:去鱗,去皮,去頭尾,去內臟及骨刺,混合均勻打碎', '七星鱸,花鱸,青鱸,鱸魚,日本真鱸 ', 95.3352, 18.968, 1.59, 0.4942, 1.4975, NULL, NULL, 56.924),
(1056, '魚貝類', '日本花鱸((11月)', '樣品狀態:生; 前處理描述:去鱗,去皮,去頭尾,去內臟及骨刺,混合均勻打碎', '七星鱸,花鱸,青鱸,鱸魚,日本真鱸 ', 99.1356, 20.534, 1.27, 0.3712, 0.0894, NULL, NULL, 63.74),
(1057, '魚貝類', '日本花鱸((12月)', '樣品狀態:生; 前處理描述:去鱗,去皮,去頭尾,去內臟及骨刺,混合均勻打碎', '七星鱸,花鱸,青鱸,鱸魚,日本真鱸 ', 100.546, 19.618, 1.86, 0.5379, 0.4023, NULL, NULL, 77.93),
(1058, '魚貝類', '日本花鱸(含皮)', '樣品狀態:生; 前處理描述:去鱗,含皮,去頭尾,去內臟及骨刺,混合均勻打碎', '七星鱸,花鱸,青鱸,鱸魚,日本真鱸 ', 111.138, 19.2, 3.2322, 1.0537, 0.7678, NULL, 0, 55),
(1059, '魚貝類', '白鱸', '樣品狀態:生; 前處理描述:去鱗,含皮,去頭尾,去內臟及骨刺,混合均勻打碎', NULL, 76.481, 17.7, 0.1, 0.035, 1, NULL, NULL, 55),
(1060, '魚貝類', '條紋狼鱸', '樣品狀態:生,已去鱗及內臟; 前處理描述:去皮,去頭尾及骨刺,混合均勻打碎', NULL, 146.815, 21.3585, 6.1657, 1.5854, 0, NULL, 0.2493, 68.6124),
(1061, '魚貝類', '鱖', '樣品狀態:生; 前處理描述:去鱗,去皮,去頭尾,去內臟及骨刺,混合均勻打碎', NULL, 89.3019, 17.678, 1.5318, 0.5467, 0, NULL, 0, 46.565),
(1062, '魚貝類', '白緣星鱠', '樣品狀態:生; 前處理描述:去鱗,去皮,去頭尾,去內臟及骨刺,混合均勻打碎', '闊嘴格仔,鱠,過魚,石斑,紅朱鱠(臺東),粉條(澎湖)', 101.013, 19.933, 1.7627, 0.823, 0, NULL, 0, 70.279),
(1063, '魚貝類', '青星九刺鮨平均值', '樣品狀態:生; 前處理描述:去鱗,含皮,去頭尾,去內臟及骨刺,混合不同部位', '紅鱠(條/格),七星斑,紅格仔,過(鯌/髻/郭)魚,石斑,條舅,青星九棘鱸,仔石斑,夕鱠', 93.5025, 20.927, 0.4595, 0.2062, 0, NULL, 0, 45.8065),
(1064, '魚貝類', '青星九刺鮨', '樣品狀態:生; 前處理描述:去鱗,含皮,去頭尾,去內臟及骨刺,混合均勻打碎', '紅鱠,紅格仔,過魚,石斑,條舅,紅條,鱠仔(臺東) ', 83.313, 19.3, 0.1, 0.038, 0.5, NULL, NULL, 47),
(1065, '魚貝類', '青星九刺鮨魚片', '樣品狀態:生; 前處理描述:混合均勻打碎', '紅鱠,紅格仔,過魚,石斑,條舅,紅條,鱠仔(臺東) ', 103.692, 22.554, 0.8189, 0.4236, 0, NULL, 0, 44.613),
(1066, '魚貝類', '斑帶石斑魚', '樣品狀態:生,已去鱗及內臟; 前處理描述:去頭尾,骨刺及魚皮,混合均勻打碎', '石斑,過魚,罔仔,竹節鱠,擬青石斑魚', 90.4736, 20.181, 0.4768, 0.22, 0, NULL, 0, 90.984),
(1067, '魚貝類', '龍虎石斑魚', '樣品狀態:生; 前處理描述:去鱗,含皮,去頭尾,去內臟及骨刺,混合均勻打碎', '龍虎斑,巴龍膽,珍珠龍膽,虎膽', 121.778, 20.573, 3.7618, 0.982, 1.1661, 0, 0.119, 68.94),
(1068, '魚貝類', '斑點九刺鮨(去皮)', '樣品狀態:生,已去鱗片及內臟; 前處理描述:去皮,去頭尾及骨刺,混合均勻打碎', '眼斑鱠,過魚,石斑,油鱠,青貓,黑鱠僅,黑鱠仔(澎湖) ', 81.6928, 18.801, 0.1566, NULL, 0.9202, NULL, 0, 156.803),
(1069, '魚貝類', '斑點九刺鮨(含皮)', '樣品狀態:生; 前處理描述:去鱗,含皮,去頭尾,去內臟及骨刺,混合均勻打碎', '眼斑鱠,過魚,石斑,油鱠,青貓,黑鱠僅,黑鱠仔(澎湖) ', 83.7875, 19.39, 0.11, 0.0597, 0, NULL, NULL, 58.97),
(1070, '魚貝類', '棕點石斑魚', '樣品狀態:生,已去鱗片及內臟; 前處理描述:去皮,去頭尾及骨刺,混合均勻打碎', '老虎斑,過魚', 115.27, 19.083, 3.7456, 1.4416, 0, NULL, 0, 78.821),
(1071, '魚貝類', '鞍帶石斑魚片', '樣品狀態:生; 前處理描述:混合均勻打碎', '龍膽石斑,過魚,槍頭石斑魚,倒吞鱟,鴛鴦鱠,龍躉(香港) ', 155.358, 19.112, 8.1762, 2.8506, 0.2161, NULL, 0, 118.325),
(1072, '魚貝類', '駝背鱸', '樣品狀態:生; 前處理描述:去鱗,含皮,去頭尾,去內臟及骨刺,混合均勻打碎', '老鼠斑,鰵魚,烏丸稅,尖嘴鱠仔,觀音鱠,斟鰻鱠(澎湖)', 82.699, 18.1, 0.6, 0.2618, 0, NULL, NULL, 93),
(1073, '魚貝類', '橫紋九刺鮨', '樣品狀態:生,已去鱗及內臟; 前處理描述:去皮,去頭尾及骨刺,混合均勻打碎', '橫帶鱠,過魚,石斑,黑貓仔,黑絲貓,竹鱠仔,黑青貓仔(澎湖),烏絲(香港) ', 85.3076, 19.25, 0.3448, 0.1499, 0, NULL, 0, 80.918),
(1074, '魚貝類', '大口黑鱸', '樣品狀態:生,已去鱗及內臟; 前處理描述:去鱗,去皮,去頭尾,去內臟及骨刺,混合均勻打碎', '黑鱸,加州鱸,淡水鱸', 129.982, 20.684, 4.6188, 1.1772, 0, NULL, NULL, 101.1),
(1075, '魚貝類', '日本紅目大眼鯛', '樣品狀態:生; 前處理描述:去鱗,含皮,去頭尾,內臟及骨刺,混合均勻打碎', '紅目鰱,嚴公仔,大目仔(臺東),紅目孔(澎湖),嚴公舅(澎湖) ', 97.222, 19.6, 1.5, 0.498, 0, NULL, NULL, 63),
(1076, '魚貝類', '血斑異大眼鯛', '樣品狀態:生; 前處理描述:去鱗,去皮,去頭尾,去內臟及骨刺,混合均勻打碎', '紅目鰱,嚴公仔', 93.374, 20.6, 0.6, 0.2436, 0, NULL, NULL, 119),
(1077, '魚貝類', '多鱗沙鮻', '樣品狀態:生; 前處理描述:去鱗,含皮,去頭尾,去內臟及骨刺,混合均勻打碎', '沙腸仔,kiss 魚', 90.246, 18.6, 1.2, 0.4698, 0.6, NULL, NULL, 96),
(1078, '魚貝類', '日本馬頭魚', '樣品狀態:生; 前處理描述:去鱗,含皮,去頭尾,去內臟及骨刺,混合均勻打碎', '馬頭,方頭魚,吧唄,紅尾,吧口弄,紅馬頭,紅甘鯛 ', 85.071, 18.74, 0.56, 0.2093, 0, NULL, NULL, 85.88),
(1079, '魚貝類', '白馬頭魚', '樣品狀態:生; 前處理描述:去鱗,含皮,去頭尾,去內臟及骨刺,混合均勻打碎', '馬頭,方頭魚,馬頭,方頭魚,白馬頭,拉崙(澎湖),白甘鯛 ', 91.004, 19.2, 1, 0.4084, 0.1, NULL, NULL, 63),
(1080, '魚貝類', '鬼頭刀魚片', '樣品狀態:生; 前處理描述:混合均勻打碎', '鱰魚,萬魚,飛烏虎,鬼頭刀(臺東),鱰,萬引,扁頭刀(澎湖),九萬仔(澎湖)', 77.7927, 17.237, 0.4646, 0.1608, 0.0378, NULL, 0.029, 177.842),
(1081, '魚貝類', '鬼頭刀', '樣品狀態:生; 前處理描述:去鱗,含皮,去頭尾,去內臟及骨刺,混合均勻打碎', '鱰魚,萬魚,飛烏虎,鬼頭刀(臺東),鱰,萬引,扁頭刀(澎湖),九萬仔(澎湖)', 106.616, 21.8, 1.5, 0.4713, 0, NULL, NULL, 55),
(1082, '魚貝類', '海鱺', '樣品狀態:生; 前處理描述:去鱗,去皮,去頭尾,去內臟及骨刺,混合均勻打碎', '海麗仔,軍曹魚,海龍魚,黑魽,海麗(臺東),海魚戾魚,錫臘白,海鱺/鱺魚/紅目鱺(澎湖) ', 106.05, 20.4, 2.1, 1.0681, 0, NULL, NULL, 131),
(1083, '魚貝類', '海鱺魚片', '樣品狀態:生; 前處理描述:去皮及骨刺,混合均勻打碎', '海麗仔,軍曹魚,海龍魚,黑魽,海麗(臺東),海魚戾魚,錫臘白,海鱺/鱺魚/紅目鱺(澎湖) ', 264.013, 19.317, 20.1252, 7.2429, 0, NULL, 0.051, 49.952),
(1084, '魚貝類', '大口逆鈎鰺', '樣品狀態:生; 前處理描述:去鱗,含皮,去頭尾,去內臟及骨刺,混合均勻打碎', '七星仔,棘蔥仔,鬼平,龜濱,龜柄,油面仔(臺東),歸秉/龜秉/肥柄(澎湖)', 103.008, 21.8, 1.1, 0.4577, 0.1, NULL, NULL, 54),
(1085, '魚貝類', '大甲鰺', '樣品狀態:生; 前處理描述:去鱗,含皮,去頭尾,去內臟及骨刺,混合均勻打碎', '鐵甲,扁甲,大目巴攏,大甲鰺', 104.956, 21.2, 1.6, 0.6584, 0.4, NULL, NULL, 90),
(1086, '魚貝類', '日本竹筴魚', '樣品狀態:生; 前處理描述:去鱗,去皮,去頭尾,去內臟及骨刺,混合均勻打碎', '巴攏,竹莢魚,瓜仔魚,真鰺,巴蘭,瓜魚,巴弄/硬尾(澎湖),黑尾', 116.359, 23.01, 2.0074, 0.7125, 0, NULL, 0, 88.103),
(1087, '魚貝類', '布氏鯧鰺(去皮)', '樣品狀態:生; 前處理描述:去鱗,去皮,去頭尾,去內臟及骨刺,混合均勻打碎', '金槍,金鯧,紅杉,紅沙瓜仔,長鰭黃臘鰺,甘仔魚(臺東),紅紗(澎湖) ', 191.812, 20.271, 11.669, 4.0077, 0, NULL, 0, 49.435),
(1088, '魚貝類', '布氏鯧鰺(含皮)', '樣品狀態:生; 前處理描述:去鱗,含皮,去頭尾,去內臟及骨刺,混合均勻打碎', '金槍,金鯧,紅杉,紅沙瓜仔,長鰭黃臘鰺,甘仔魚(臺東),紅紗(澎湖)', 190.181, 17.5, 12.8, 5.4835, 0, NULL, NULL, 36),
(1089, '魚貝類', '杜氏鰤', '樣品狀態:生; 前處理描述:去鱗,含皮,去頭尾,去內臟及骨刺,混合均勻打碎', '紅甘,紅甘鰺,竹午,汕午,紅頭午 ', 115.028, 21.89, 2.39, 0.9234, 0.23, NULL, NULL, 40.94),
(1090, '魚貝類', '長鰭鰤魚', '樣品狀態:生; 前處理描述:去鱗,含皮,去頭尾,去內臟及骨刺,混合均勻打碎,', '油甘,黃尾鰺,甘仔,扁午,扁甘,柴魽', 114.408, 22.763, 1.908, 0.9024, 2.668, 0, 0.084, 87.23),
(1091, '魚貝類', '范氏副葉鰺', '樣品狀態:生,已去鱗及內臟; 前處理描述:去皮,去頭尾,去骨刺,混合均勻打碎', '甘仔魚', 108.333, 20.941, 2.097, 1.0235, 2.0759, NULL, 0, 61.731),
(1092, '魚貝類', '泰勃圓鰺', '樣品狀態:生; 前處理描述:去鱗,含皮,去頭尾,去內臟及骨刺,混合均勻打碎', '硬尾', 112.562, 22.77, 1.7, 0.5592, 1.36, NULL, NULL, 61.64),
(1093, '魚貝類', '烏鯧', '樣品狀態:生; 前處理描述:去鱗,含皮,去頭尾,去內臟及骨刺,混合均勻打碎', '烏昌,三角昌,昌鼠魚,黑鯧,暗鯧,黑鰭,燕尾鯧', 94.1662, 20.4, 0.7825, 0.3716, 0, NULL, 0.055, 114),
(1094, '魚貝類', '無斑圓鰺', '樣品狀態:生; 前處理描述:去鱗,去皮,去頭尾,去內臟及骨刺,混合均勻打碎', '紅瓜魚,巴攏,紅扁鰺,赤尾仔(臺東),赤尾,馬尾冬,紅瓜鰺,紅尾巴弄(澎湖) ', 119.191, 23.9, 1.9, 0.7463, 0, NULL, NULL, 130),
(1095, '魚貝類', '藍圓鰺', '樣品狀態:生; 前處理描述:去鱗,含皮,去頭尾,去內臟及骨刺,混合均勻打碎', '硬尾,廣仔,甘廣,四破,巴攏,金鼓,吧弄,巴弄/孔仔(澎湖)', 114.097, 24.0125, 1.282, 0.5228, 0, NULL, 0.804, 57.2585),
(1096, '魚貝類', '雙帶鰺', '樣品狀態:生; 前處理描述:去鱗,含皮,去頭尾,去內臟及骨刺,混合均勻打碎', '海草,拉侖,拉崙/柴魚/青甘(澎湖)', 118.15, 22.6, 2.4, 0.9792, 0, NULL, NULL, 43),
(1097, '魚貝類', '眼眶魚', '樣品狀態:生; 前處理描述:去鱗,含皮,去頭尾,去內臟及骨刺,混合均勻打碎', '皮刀,眼眶魚,庖刀魚,皮鞋刀,菜刀魚,剃頭刀(澎湖)', 112.626, 20.25, 2.9, 1.2663, 0.2, NULL, NULL, 108),
(1098, '魚貝類', '斯氏長鰭烏魴', '樣品狀態:生; 前處理描述:去鱗,含皮,去頭尾,去內臟及骨刺,混合均勻打碎', '深海三角仔,黑飛刀,黑皮刀,三角仔(臺東),大鱗烏鯧(澎湖) ', 96.55, 22.4, 0.1, 0.0323, 0, NULL, NULL, 40),
(1099, '魚貝類', '史氏紅諧魚', '樣品狀態:生,已去鱗及內臟; 前處理描述:去皮,去頭尾,骨刺,混合均勻打碎', '紅鰱魚,紅肉欉仔,紅嘴唇仔,紅唇仔,紅魚仔,白肉蒜,紅肉蒜', 96.6845, 21.133, 0.7147, 0.2498, 0, NULL, 0, 74.605),
(1100, '魚貝類', '希氏姬鯛', '樣品狀態:生; 前處理描述:去鱗,含皮,去頭尾,去內臟及骨刺,混合均勻打碎', '鎖吾,散午,紅魚仔,紅臭魚仔,紅臭魚(臺東),白肉蒜', 90.9136, 21.08, 0.1, 0.0313, 0.48, NULL, NULL, 56.57),
(1101, '魚貝類', '赤鰭笛鯛', '樣品狀態:生; 前處理描述:去鱗,含皮,去頭尾,去內臟及骨刺,混合均勻打碎', '紅雞仔,赤海雞,赤筆仔(臺東),赤筆,赤海,紅魚,紅鰭赤海/鐵汕婆(澎湖) ', 88.01, 20.4, 0.1, NULL, 0, NULL, NULL, 91),
(1102, '魚貝類', '孟加拉笛鯛', '樣品狀態:生; 前處理描述:去鱗,含皮,去頭尾,去內臟及骨刺,混合均勻打碎', '赤筆仔,黃雞母(澎湖)', 87.2509, 19.842, 0.28, 0.116, 0.038, NULL, NULL, 62.44),
(1103, '魚貝類', '前鱗笛鯛', '樣品狀態:生,已去鱗及內臟; 前處理描述:去皮,去頭尾,去骨刺,混合均勻打碎', '赤筆仔', 101.282, 21.997, 0.8154, 0.4309, 0.9059, NULL, 0, 60.374),
(1104, '魚貝類', '馬拉巴笛鯛', '樣品狀態:生; 前處理描述:去鱗,含皮,去頭尾,去內臟及骨刺,混合均勻打碎', '赤海,赤筆仔', 86.2967, 20.21, 0, 0, 0, NULL, NULL, 95.5),
(1105, '魚貝類', '單斑笛鯛', '樣品狀態:生; 前處理描述:去鱗,含皮,去頭尾,去內臟及骨刺,混合均勻打碎', '點記,黑點仔,黃翅,赤筆仔,點誌仔,龍王(臺東) ', 105.527, 20.7, 1.9, 0.8094, 0, NULL, NULL, 45),
(1106, '魚貝類', '黃擬烏尾鮗', '樣品狀態:生; 前處理描述:去鱗,含皮,去頭尾,去內臟及骨刺,混合均勻打碎', '黃雞仔,包公雞,貢仔,黃腳佳仔,黃加甲(臺東),烏尾冬/青雞仔(澎湖)', 80.3427, 18.71, 0.05, 0.0181, 0.27, NULL, NULL, 81.68),
(1107, '魚貝類', '葉唇笛鯛', '樣品狀態:生; 前處理描述:去鱗,去皮,去頭尾,去內臟及骨刺,混合均勻打碎', '厚唇仔,紅魚', 118.11, 19.944, 3.6529, 1.6671, 0, NULL, 0, 75.185),
(1108, '魚貝類', '松鯛', '樣品狀態:生; 前處理描述:去鱗,含皮,去頭尾,去內臟及骨刺,混合均勻打碎', '打鐵婆,枯葉,石鯽,睡魚,庫羅黛,睏魚,海南洋仔,南洋鱸魚,海吳郭,流魚/柴魚/打鐵鱸(澎湖)', 98.46, 18.2, 2.3, 1.0095, 0.1, NULL, NULL, 76),
(1109, '魚貝類', '三線磯鱸', '樣品狀態:生; 前處理描述:去鱗,含皮,去頭尾,去內臟及骨刺,混合均勻打碎', '三線雞魚,黃雞仔,雞仔魚,番仔加誌,黃公仔魚,黃雞魚,三爪仔,雞魚(澎湖),青筆', 129.838, 19, 5.4, 2.3279, 0.6, NULL, NULL, 58),
(1110, '魚貝類', '星雞魚', '樣品狀態:生; 前處理描述:去鱗,含皮,去頭尾,去內臟及骨刺,混合均勻打碎', '雞仔魚,石鱸,厚鱸,頭額/金龍/刣額(澎湖) ', 98.5202, 20.58, 1.18, 0.5374, 0.387, NULL, NULL, 73.27),
(1111, '魚貝類', '密點少棘胡椒鯛', '樣品狀態:生; 前處理描述:去鱗,含皮,去頭尾,去內臟及骨刺,混合均勻打碎', '雞仔魚,加志,少棘石鱸,圭誌/烏嘉誌(澎湖) ', 94.089, 19.5, 1.2, 0.5123, 0, NULL, NULL, 74),
(1112, '魚貝類', '金線魚', '樣品狀態:生; 前處理描述:去鱗,去皮,去頭尾,去內臟及骨刺,混合均勻打碎', '金線鰱,黃線,紅杉', 119.009, 20.9, 3.3, 1.4517, 0, NULL, NULL, 103),
(1113, '魚貝類', '青嘴龍占魚', '樣品狀態:生,已去鱗片及內臟; 前處理描述:去皮,去頭尾及骨刺,混合均勻打碎', '龍尖,龍占,青嘴仔,青嘴/尖嘴仔(澎湖)', 127.876, 22.689, 3.4361, 1.2097, 0, NULL, 0, 86.697),
(1114, '魚貝類', '網紋龍占魚', '樣品狀態:生; 前處理描述:去鱗,含皮,去頭尾,去內臟及骨刺,混合均勻打碎', '龍尖,龍占(臺東)', 101.228, 21.7, 0.95, 0.3777, 0, NULL, NULL, 89.5),
(1115, '魚貝類', '平鯛', '樣品狀態:生(養殖),已去鱗片及內臟; 前處理描述:去頭尾及骨刺,混合均勻打碎', '黃錫鯛,枋頭,邦頭/枋頭/白嘉鱲(澎湖)', 158.337, 21.027, 7.6, 1.9063, 0.5007, 0, 0, 31.65),
(1116, '魚貝類', '阿部牙鯛', '樣品狀態:生; 前處理描述:去鱗,去皮,去頭尾,去內臟及骨刺,混合均勻打碎', '赤鯮,阿部赤鯮', 123.706, 18.861, 4.786, 1.9101, 0.0051, NULL, NULL, 64.505),
(1117, '魚貝類', '真鯛平均值(去皮)', '樣品狀態:生; 前處理描述:去鱗,去皮,去頭尾,去內臟及骨刺,混合均勻打碎', '嘉鱲魚,正鯛,加臘,加蚋,加魶,真鯛,加幾魚,銅盆魚,棘鬣魚  ', 110.098, 20.5763, 2.4653, 0.9273, 0.1747, NULL, NULL, 59.7487),
(1118, '魚貝類', '真鯛(1月)', '樣品狀態:生; 前處理描述:去鱗,去皮,去頭尾,去內臟及骨刺,混合均勻打碎', '嘉鱲魚,正鯛,加臘,加蚋,加魶,真鯛,加幾魚,銅盆魚,棘鬣魚  ', 100.022, 20.112, 1.568, 0.5688, 0.7276, NULL, NULL, 54.228),
(1119, '魚貝類', '真鯛(3月)', '樣品狀態:生; 前處理描述:去鱗,去皮,去頭尾,去內臟及骨刺,混合均勻打碎', '嘉鱲魚,正鯛,加臘,加蚋,加魶,真鯛,加幾魚,銅盆魚,棘鬣魚  ', 100.618, 20.801, 1.308, 0.4603, 0.7257, NULL, NULL, 63.6329),
(1120, '魚貝類', '真鯛(5月)', '樣品狀態:生; 前處理描述:去鱗,去皮,去頭尾,去內臟及骨刺,混合均勻打碎', '嘉鱲魚,正鯛,加臘,加蚋,加魶,真鯛,加幾魚,銅盆魚,棘鬣魚  ', 86.7392, 20.02, 0.139, 0.0534, 0, NULL, NULL, 64.0466),
(1121, '魚貝類', '真鯛(8月)', '樣品狀態:生; 前處理描述:去鱗,去皮,去頭尾,去內臟及骨刺,混合均勻打碎', '嘉鱲魚,正鯛,加臘,加蚋,加魶,真鯛,加幾魚,銅盆魚,棘鬣魚  ', 175.992, 20.584, 9.767, 3.9681, 1.672, NULL, NULL, 50.8249),
(1122, '魚貝類', '真鯛(9月)', '樣品狀態:生; 前處理描述:去鱗,去皮,去頭尾,去內臟及骨刺,混合均勻打碎', '嘉鱲魚,正鯛,加臘,加蚋,加魶,真鯛,加幾魚,銅盆魚,棘鬣魚  ', 92.232, 21.6, 0, NULL, 0, NULL, NULL, 60),
(1123, '魚貝類', '真鯛(11月)', '樣品狀態:生; 前處理描述:去鱗,去皮,去頭尾,去內臟及骨刺,混合均勻打碎', '嘉鱲魚,正鯛,加臘,加蚋,加魶,真鯛,加幾魚,銅盆魚,棘鬣魚  ', 104.986, 20.341, 2.01, 0.7544, 0, NULL, NULL, 65.76),
(1124, '魚貝類', '黃鰭棘鯛', '樣品狀態:生; 前處理描述:去鱗,去皮,去頭尾,去內臟及骨刺,混合均勻打碎', '黃鰭鯛,黃鰭,赤翅仔,赤翅,花身,鏡鯛 ', 136.284, 19.221, 6.01, 1.8579, 0.5923, NULL, NULL, 70.23),
(1125, '魚貝類', '黑棘鯛(去皮)', '樣品狀態:生; 前處理描述:去鱗,去皮,去頭尾,去內臟及骨刺,混合均勻打碎', '黑鯛,烏格,黑格,厚唇,烏毛,烏鱠,黑頰(澎湖)', 136.29, 20.287, 5.506, 1.5654, 0.5781, NULL, NULL, 45.8414),
(1126, '魚貝類', '黑棘鯛(含皮)', '樣品狀態:生; 前處理描述:去鱗,含皮,去頭尾,去內臟及骨刺,混合均勻打碎', '黑鯛,烏格,黑格,厚唇,烏毛,烏鱠,黑頰(澎湖)', 164.561, 19.5, 9.0128, 2.5301, 0, NULL, 0.054, 66),
(1127, '魚貝類', '多鱗四指馬鮁', '樣品狀態:生; 前處理描述:去鱗,含皮,去頭尾,去內臟及骨刺,混合均勻打碎', '四絲馬鮁,四指馬鮁,竹午,大午,午仔,鬚午仔/發鬚午仔(澎湖)', 145.905, 18.9695, 7.1957, 2.5905, 0, NULL, NULL, 69.0846),
(1128, '魚貝類', '大黃魚', '樣品狀態:生; 前處理描述:去鱗,去皮,去頭尾,去內臟及骨刺,混合均勻打碎', '黃魚,黃瓜,黃花魚,黃口,火口,大黃花', 142.115, 16.78, 7.812, 2.9288, 0.1612, NULL, NULL, 39.8452),
(1129, '魚貝類', '小黃魚(去皮)', '樣品狀態:生; 前處理描述:去鱗,去皮,去頭尾,去內臟及骨刺,混合均勻打碎', '黃魚,小黃瓜,厚鱗仔,黃口,黃順,黃瓜,紅瓜', 99.832, 20, 1.6, 0.6336, 0, NULL, NULL, 92),
(1130, '魚貝類', '小黃魚(含皮)', '樣品狀態:生; 前處理描述:去鱗,含皮,去頭尾,去內臟及骨刺,混合均勻打碎', '黃魚,小黃瓜,厚鱗仔,黃口,黃順,黃瓜,紅瓜', 100.076, 19.36, 1.93, 0.6079, 0, NULL, NULL, 76.37),
(1131, '魚貝類', '白姑魚', '樣品狀態:生; 前處理描述:去鱗,含皮,去頭尾,去內臟及骨刺,混合均勻打碎', '白口,帕頭,黃順,加網(澎湖)', 96.512, 18.8, 1.8, 0.8451, 0, NULL, NULL, 85),
(1132, '魚貝類', '眼斑擬石首魚', '樣品狀態:生,已去鱗及內臟; 前處理描述:去皮,去頭尾及骨刺,混合均勻打碎', '紅鼓魚', 94.5811, 19.701, 1.1594, 0.3576, 0.8861, NULL, NULL, 70.9798),
(1133, '魚貝類', '黃姑魚', '樣品狀態:生; 前處理描述:去鱗,含皮,去頭尾,去內臟及骨刺,混合均勻打碎', '春子,假黃魚,黃婆,紅花(臺南安平)  ', 88.9668, 19.42, 0.67, 0.2425, 0, NULL, NULL, 71.18),
(1134, '魚貝類', '黑䱛 ', '樣品狀態:生; 前處理描述:去鱗,含皮,去頭尾,去內臟及骨刺,混合均勻打碎', '黑口,烏喉,黑喉(臺東),加正,烏加網,黑喉,臭魚', 149.082, 17.93, 8.04, 3.1359, 1.24, NULL, NULL, 55.8),
(1135, '魚貝類', '鮸', '樣品狀態:生; 前處理描述:去鱗,去皮,去頭尾,去內臟及骨刺,混合均勻打碎', '鮸仔,敏魚,米魚,水鮸仔', 103.62, 23.312, 0.4521, 0.1583, 0, NULL, 0, 51.898),
(1136, '魚貝類', '鱗鰭叫姑魚', '樣品狀態:生; 前處理描述:去鱗,含皮,去頭尾,去內臟及骨刺,混合均勻打碎', '春子,油口/臭肚仔/金線加網(澎湖) ', 99.314, 18.4, 2.3, 1.1748, 0.3, NULL, NULL, 78),
(1137, '魚貝類', '黑斑海緋鯉', '樣品狀態:生; 前處理描述:去鱗,含皮,去頭尾,去內臟及骨刺,混合均勻打碎', '秋姑,鬚哥,黑點秋哥/外海秋哥(澎湖) ', 96.512, 18.8, 1.8, 0.805, 0, NULL, NULL, 55),
(1138, '魚貝類', '斑點雞籠鯧', '樣品狀態:生; 前處理描述:去鱗,含皮,去頭尾,去內臟及骨刺,混合均勻打碎', '銅盤仔,鏡鯧,金鏡,定盤,咬破埔,金鐘(澎湖) ', 96.8622, 21.945, 0.35, 0.1443, 0, NULL, NULL, 71.15),
(1139, '魚貝類', '花身鯻', '樣品狀態:生; 前處理描述:去鱗,含皮,去頭尾,去內臟及骨刺,混合均勻打碎', '花身仔,斑吾,雞仔魚,三抓仔,花身鯻,邦五/斑午/兵舅仔/斑龜仔(澎湖) ', 157.229, 19.5, 8.2, 2.8101, 0, NULL, NULL, 60),
(1140, '魚貝類', '花尾唇指翁(翁加魚邊) ', '樣品狀態:生; 前處理描述:去鱗,含皮,去頭尾,去內臟及骨刺,混合均勻打碎', '咬破布,三康,金花,萬年瘦,瘦仔/蝨鬢(澎湖)', 115.532, 19.79, 3.44, 1.3443, 0.63, NULL, NULL, 71.04),
(1141, '魚貝類', '尼羅口孵非鯽(去皮)', '樣品狀態:生; 前處理描述:去鱗,去皮,去頭尾,去內臟及骨刺,混合均勻打碎', '南洋鯽仔,尼羅吳郭魚', 112.934, 20.356, 2.884, 0.8358, 0, NULL, NULL, 62.2255),
(1142, '魚貝類', '尼羅口孵非鯽(含皮)', '樣品狀態:生; 前處理描述:去鱗,含皮,去頭尾,去內臟及骨刺,混合均勻打碎', '南洋鯽仔,尼羅吳郭魚', 124.978, 19.425, 4.66, 1.5157, 0, NULL, NULL, 41.645),
(1143, '魚貝類', '尼羅口孵非鯽(含皮)(2022年取樣)', '樣品狀態:生; 前處理描述:去鱗,含皮,去頭尾,去內臟及骨刺,混合均勻打碎', '南洋鯽仔,尼羅吳郭魚', 121.841, 20.386, 3.8573, 1.0447, 2.9732, 0, 0, 61.66),
(1144, '魚貝類', '花身副麗魚', '樣品狀態:生; 前處理描述:去鱗,去皮,去頭尾,去內臟及骨刺,混合均勻打碎', '珍珠石斑,淡水石斑,馬拉麗體魚', 112.466, 17.665, 4.106, 1.4428, 1.0753, NULL, NULL, 49.1328),
(1145, '魚貝類', '紅色吳郭魚', '樣品狀態:生,去鱗及內臟; 前處理描述:去皮,去頭尾及骨刺,混合均勻打碎', '尼羅魚;台灣鯛,紅色尼羅魚,姬鯛,紅吳郭魚,濱鯛', 107.846, 18.268, 3.3084, 1.0894, 1.2726, NULL, NULL, 67.7792),
(1146, '魚貝類', '台灣鯛魚片(生)', '樣品狀態:生,冷凍包裝; 前處理描述:混合均勻打碎', NULL, 109.846, 18.1545, 3.5839, 1.0402, 2.5148, NULL, NULL, 46.0712),
(1147, '魚貝類', '台灣鯛魚片(生)(2021年)', '樣品狀態:生,冷凍包裝; 前處理描述:混合均勻打碎', NULL, 109.371, 17.884, 3.6592, 1.3234, 1.549, 0, 0.11, 30.96),
(1148, '魚貝類', '台灣鯛魚片(水煮)', '前處理描述:魚片解凍後,切小塊放入1000mL之水中以中小火煮15分鐘,撈出魚塊瀝乾均質', NULL, 129.939, 23.4255, 3.3162, 1.0721, 1.3238, NULL, NULL, 33.9652),
(1149, '魚貝類', '台灣鯛魚片(油煎)', '前處理描述:魚片解凍後,以已熱油不沾鍋(加1大匙葵花油),每片約煎7~8分鐘,兩面煎熟,取出放冷均質', NULL, 161.874, 23.1, 6.8564, 1.3424, 1.9415, NULL, NULL, 67.3044),
(1150, '魚貝類', '台灣鯛魚片(烤,190℃,10分鐘)', '前處理描述:魚片解凍後,切小塊,烤箱預熱20分鐘,以190℃烤10分鐘,待冷卻連同湯汁一起均質', NULL, 111.075, 19.6635, 3.0057, 0.9179, 1.773, NULL, NULL, 47.7656),
(1151, '魚貝類', '台灣鯛魚片(烤,190℃,20分鐘)', '前處理描述:魚片解凍後,切小塊,烤箱預熱20分鐘,以190℃烤20分鐘,待冷卻連同湯汁一起均質', NULL, 134.189, 22.958, 4.0087, 1.2481, 2.0858, NULL, NULL, 53.8324),
(1152, '魚貝類', '台灣鯛魚片(烤,230℃,10分鐘)', '前處理描述:魚片解凍後,切小塊,烤箱預熱20分鐘,以230℃烤10分鐘,待冷卻連同湯汁一起均質', NULL, 126.649, 21.277, 3.9685, 1.2053, 1.4974, NULL, NULL, 49.5878),
(1153, '魚貝類', '台灣鯛魚片(烤,230℃,20分鐘)', '前處理描述:魚片解凍後,切小塊,烤箱預熱20分鐘,以230℃烤20分鐘,待冷卻連同湯汁一起均質', NULL, 142.18, 24.583, 4.1253, 1.2795, 2.5167, NULL, NULL, 65.4641),
(1154, '魚貝類', '台灣鯛魚片(清蒸)', '前處理描述:魚片解凍後,以鋁箔紙包裹放入電鍋中,外鍋加水,加熱35分鐘,待冷卻連同湯汁一起均質', NULL, 112.04, 19.2995, 3.285, 1.0107, 2.1751, NULL, NULL, 58.8712),
(1155, '魚貝類', '台灣鯛魚片(微波)', '前處理描述:魚片解凍後,置於微波盒中,每片加水10mL,以強微波加熱6分鐘,待冷卻連同湯汁一起均質', NULL, 139.945, 24.871, 3.7412, 1.1402, 1.3955, NULL, NULL, 85.3654);
INSERT INTO `nutrition_facts` (`id`, `food_category`, `sample_name`, `content_description`, `alias`, `kcal`, `protein`, `fat`, `saturated_fat`, `carbohydrate`, `fiber`, `total_sugar`, `sodium`) VALUES
(1156, '魚貝類', '台灣鯛魚湯(水煮)', '前處理描述:魚片解凍後,切小塊放入1000mL水中,以中小火煮15分鐘,瀝取魚湯汁並補水至850mL', NULL, 5.4858, 0.9085, 0.1781, 0.0551, 0.0368, NULL, NULL, 12.514),
(1157, '魚貝類', '莫三比克口孵非鯽', '樣品狀態:生; 前處理描述:去鱗,去皮,去頭尾,去內臟及骨刺,混合均勻打碎', '非洲仔,南洋鯽仔,在來吳郭魚,吳郭魚/鹹水吳郭(澎湖)  ', 111.819, 19.512, 3.16, 1.0011, 0, NULL, NULL, 91.3932),
(1158, '魚貝類', '薔薇項鰭魚(去皮)', '樣品狀態:生; 前處理描述:去鱗,去皮,去頭尾,去內臟及骨刺,混合均勻打碎', '薔薇連鰭唇魚,扁礫仔,紅姑娘仔,紅新娘,豎停仔,胭脂冷,角龍,平倍良,薔薇楔鯛,薔薇離鰭鯛,薔薇虹彩', 95.8916, 17.345, 2.42, 1.1701, 0, NULL, NULL, 138.04),
(1159, '魚貝類', '薔薇項鰭魚(含皮)', '樣品狀態:生; 前處理描述:去鱗,含皮,去頭尾,去內臟及骨刺,混合均勻打碎', '薔薇連鰭唇魚,扁礫仔,紅姑娘仔,紅新娘,豎停仔,胭脂冷,角龍,平倍良,薔薇楔鯛,薔薇離鰭鯛,薔薇虹彩', 92.669, 17.9, 1.8, 0.9005, 0, NULL, NULL, 126),
(1160, '魚貝類', '藍豬齒魚', '樣品狀態:生; 前處理描述:去鱗,含皮,去頭尾,去內臟及骨刺,混合均勻打碎', '石老,四齒仔,西齒,簾仔,寒鯛,鰱仔(澎湖)', 80.799, 18.5, 0.2, 0.0758, 0.2, NULL, NULL, 65),
(1161, '魚貝類', '福氏鸚哥魚(去皮)', '樣品狀態:生; 前處理描述:去鱗,去皮,去頭尾,去內臟及骨刺,混合均勻打碎', '紅鸚哥,青鸚哥仔,青衣,青衫(雄),蠔魚(雌),紅海逮,紅咬齒,番仔魚(臺東)', 84.1852, 19.631, 0.04, 0.0148, 0.168, NULL, NULL, 85.57),
(1162, '魚貝類', '橫紋鸚哥魚(含皮)', '樣品狀態:生; 前處理描述:去鱗,含皮,去頭尾,去內臟及骨刺,混合均勻打碎', '鸚哥', 80.5797, 18.85, 0.01, 0.0031, 0, NULL, NULL, 89),
(1163, '魚貝類', '藍點鸚哥魚', '樣品狀態:生; 前處理描述:去鱗,去皮,去頭尾,去內臟及骨刺,混合均勻打碎', '鸚哥,黃衣魚,青衫(雄),紅蠔魚(雌),紅衫,蠔魚(雌)(澎湖) ', 86.4787, 20.147, 0.05, NULL, 0.5898, NULL, NULL, 60.53),
(1164, '魚貝類', '金錢魚', '樣品狀態:生; 前處理描述:去鱗,含皮,去頭尾,去內臟及骨刺,混合均勻打碎', '變身苦,遍身苦(澎湖),金鼓', 196.025, 19.27, 12.61, 4.8899, 0, NULL, NULL, 70.11),
(1165, '魚貝類', '褐臭肚魚', '樣品狀態:生; 前處理描述:去鱗,含皮,去頭尾,去內臟及骨刺,混合均勻打碎', '臭肚,象魚,樹魚,羊鍋,疏網,茄冬仔,象耳/臭肚仔/羊矮仔/盧矮仔(澎湖)', 164.159, 19.94, 8.76, 3.3749, 0.63, NULL, NULL, 52.18),
(1166, '魚貝類', '杜氏刺尾鯛', '樣品狀態:生; 前處理描述:去鱗,含皮,去頭尾,去內臟及骨刺,混合均勻打碎', '眼紋倒吊,粗皮仔,倒吊(臺東)', 137.268, 19.05, 6.2, 2.805, 0.61, NULL, NULL, 38.17),
(1167, '魚貝類', '後刺尾鯛', '樣品狀態:生,已去鱗及內臟; 前處理描述:去皮,去頭尾及骨刺,混合均勻打碎', '倒吊,粗皮仔,番倒吊(澎湖),半水吊', 102.078, 20.392, 1.6634, 0.8963, 0, NULL, 0, 93.542),
(1168, '魚貝類', '鋸尾鯛', '樣品狀態:生; 前處理描述:去鱗,含皮,去頭尾,去內臟及骨刺,混合均勻打碎', '黑豬哥,黑將軍,打鐵婆,剝皮仔,老娘(澎湖) ', 93.1362, 18.96, 1.35, 0.5297, 0.2891, NULL, NULL, 56.8),
(1169, '魚貝類', '大眼金梭魚', '樣品狀態:生; 前處理描述:去鱗,含皮,去頭尾,去內臟及骨刺,混合均勻打碎', '針梭,竹梭,巴拉庫答', 157.128, 21.8, 7.1, 3.0104, 0, NULL, NULL, 71),
(1170, '魚貝類', '鱗網帶鰆切片', '樣品狀態:生; 前處理描述:去皮及骨刺,混合均勻打碎', '油魚,細鱗仔,玉梭魚,白玉豚', 272.453, 17.258, 22.0356, 0.5333, 0, NULL, NULL, 84.3982),
(1171, '魚貝類', '鱗網帶鰆(含皮)', '樣品狀態:生; 前處理描述:去鱗,含皮,去頭尾,去內臟及骨刺,混合均勻打碎', '油魚,細鱗仔,玉梭魚,白玉豚', 263.484, 18, 20.69, 8.6691, 0, NULL, NULL, 31.39),
(1172, '魚貝類', '白帶魚', '樣品狀態:生; 前處理描述:去鱗,含皮,去頭尾,去內臟及骨刺,混合均勻打碎', '白魚,裙帶,肥帶,油帶,天竺帶魚,白帶魚,黃稜油帶(澎湖) ', 101.732, 19.6, 2, 0.883, 0, NULL, NULL, 54),
(1173, '魚貝類', '大目鮪', '樣品狀態:生; 前處理描述:去鱗,含皮,去頭尾,去內臟及骨刺,混合均勻打碎', '大目仔,大眼鮪,大目串,短墩,串仔(澎湖),短鮪 ', 103.487, 23.94, 0.14, 0.021, 0, NULL, NULL, 41.31),
(1174, '魚貝類', '正鰹', '樣品狀態:生; 前處理描述:去鱗,含皮,去頭尾,去內臟及骨刺,混合均勻打碎', '煙仔虎,煙仔,小串,柴魚,肥煙,鯤(臺東),煙仔魚,卓鮶/大煙(澎湖)', 149.149, 23.1, 5.6, 1.7024, 0, NULL, NULL, 50),
(1175, '魚貝類', '花腹鯖', '樣品狀態:生; 前處理描述:去鱗,含皮,去頭尾,去內臟及骨刺,混合均勻打碎', '花飛,青輝,飛威/青飛/胡麻鯖 ', 138.095, 23.9, 3.9958, 1.5469, 0.1042, NULL, 0, 36),
(1176, '魚貝類', '高麗馬加鰆', '樣品狀態:生; 前處理描述:去鱗,含皮,去頭尾,去內臟及骨刺,混合均勻打碎', '破北,闊北,闊腹仔,高麗鰆,破腹 ', 118.638, 19.44, 3.95, 1.6419, 0.26, NULL, NULL, 46.35),
(1177, '魚貝類', '康氏馬加鰆切片(去皮)', '樣品狀態:生; 前處理描述:去皮,去骨刺,混合均勻打碎', '土魠,馬加,馬鮫,梭齒,頭魠,鰆,土托,康氏馬發,塗魠(澎湖)', 192.793, 18.6645, 12.5383, 3.1143, 0, NULL, 0.451, 52.3427),
(1178, '魚貝類', '康氏馬加鰆切片(含皮)', '樣品狀態:生; 前處理描述:含皮,去骨刺,混合均勻打碎', '土魠,馬加,馬鮫,梭齒,頭魠,鰆,土托,康氏馬發,塗魠(澎湖)', 176.347, 19.33, 10.4, 5.1467, 1.52, NULL, NULL, 54.4),
(1179, '魚貝類', '臺灣馬加鰆', '樣品狀態:生; 前處理描述:去鱗,含皮,去頭尾,去內臟及骨刺,混合均勻打碎', '白北,白腹仔', 180.062, 20.2, 10.4, 4.6852, 0, NULL, NULL, 51),
(1180, '魚貝類', '鮪魚生魚片', '樣品狀態:生; 前處理描述:混合均勻打碎', NULL, 100.393, 23.3, 0.1, 0.0314, 0, NULL, NULL, 27),
(1181, '魚貝類', '鯖魚(生)', '樣品狀態:生; 前處理描述:去鱗,含皮,去頭尾,去內臟及骨刺,混合均勻打碎', NULL, 416.976, 14.36, 39.43, 9.132, 0.1804, NULL, NULL, 55.53),
(1182, '魚貝類', '鯖魚(炒)', '前處理描述:去鱗,含皮,去骨刺及內臟,以5g沙拉油炒5分鐘', NULL, 410.19, 16.7, 37.57, 8.5246, 0.0845, NULL, NULL, 67.63),
(1183, '魚貝類', '鯖魚(炸)', '前處理描述:去鱗,含皮,去骨刺及內臟,以100g沙拉油在180℃炸3分鐘', NULL, 555.212, 17.16, 53.43, 11.8027, 0.0708, NULL, NULL, 75.42),
(1184, '魚貝類', '鯖魚(烤,150度,10分)', '前處理描述:去鱗,含皮,去骨刺及內臟,以150℃烤10分鐘', NULL, 411.629, 16.53, 37.81, 8.3598, 0, NULL, NULL, 57.9),
(1185, '魚貝類', '鯖魚(烤,150度,20分)', '前處理描述:去鱗,含皮,去骨刺及內臟,以150℃烤20分鐘', NULL, 395.51, 19.05, 34.83, 8.1293, 0, NULL, NULL, 82.11),
(1186, '魚貝類', '鯖魚(烤,150度,30分)', '前處理描述:去鱗,含皮,去骨刺及內臟,以150℃烤30分鐘', NULL, 535.983, 19.86, 50.02, 11.4646, 0, NULL, NULL, 78.73),
(1187, '魚貝類', '鯖魚(烤,180度,10分)', '前處理描述:去鱗,含皮,去骨刺及內臟,以180℃烤10分鐘', NULL, 373.052, 20.17, 31.81, 7.3608, 0, NULL, NULL, 82.18),
(1188, '魚貝類', '鯖魚(烤,210度,10分)', '前處理描述:去鱗,含皮,去骨刺及內臟,以210℃烤10分鐘', NULL, 472.46, 19.01, 43.38, 10.0208, 0, NULL, NULL, 74.18),
(1189, '魚貝類', '鯖魚(煮)', '前處理描述:去鱗,含皮,去骨刺及內臟,以100℃煮10分鐘', NULL, 374.813, 14.9, 34.5, 8.5008, 0.4381, NULL, NULL, 51.23),
(1190, '魚貝類', '鯖魚(煎)', '前處理描述:去鱗,含皮,去骨刺及內臟,以10g沙拉油煎6分鐘', NULL, 403.331, 20.01, 35.94, 8.622, 0, NULL, NULL, 86.19),
(1191, '魚貝類', '鯖魚(蒸)', '前處理描述:去鱗,含皮,去骨刺及內臟,以100℃蒸10分鐘', NULL, 391.743, 14.64, 36.5, 8.7819, 0.7209, NULL, NULL, 52.36),
(1192, '魚貝類', '旗魚切片', '樣品狀態:生; 前處理描述:混合均勻打碎', '翹翅仔,白肉旗魚,闊胸仔,立翅旗魚,白皮丁挽,白皮旗魚', 110.9, 25.972, 0, 0, 0.8241, NULL, NULL, 36.4887),
(1193, '魚貝類', '旗魚腹肉', '樣品狀態:生; 前處理描述:去皮,混合均勻打碎', '翹翅仔,白肉旗魚,闊胸仔,立翅旗魚,白皮丁挽,白皮旗魚', 104.677, 22.197, 1.0971, 0.4468, 0, NULL, 0, 130.653),
(1194, '魚貝類', '刺鯧(去皮)', '樣品狀態:生; 前處理描述:去鱗,去皮,去頭尾,去內臟及骨刺,混合均勻打碎', '肉魚,肉鯽仔,土肉,肉鯽,瓜仔鯧,刺鯧', 94.5503, 18.837, 1.565, 0.6205, 0.102, NULL, NULL, 161.789),
(1195, '魚貝類', '刺鯧(含皮)', '樣品狀態:生; 前處理描述:去鱗,含皮,去頭尾,去內臟及骨刺,混合均勻打碎', '肉魚,肉鯽仔,土肉,肉鯽,瓜仔鯧,刺鯧', 154.526, 17.779, 8.715, 3.5537, 0, NULL, NULL, 178.6),
(1196, '魚貝類', '星斑真鯧', '樣品狀態:生,已去鱗片及內臟; 前處理描述:去皮,去頭尾及骨刺,混合均勻打碎', '(市售稱\"花鯧\")', 213.623, 15.55, 16.322, 4.4445, 0, NULL, 0.02, 60.008),
(1197, '魚貝類', '銀鯧平均值(去皮)', '樣品狀態:生; 前處理描述:去鱗,去皮,去頭尾,去內臟及骨刺,混合均勻打碎', '白(正/暗)鯧,白鯧魚,鯧仔魚,黑鰭,車片魚', 114.987, 17.7126, 4.363, 2.0445, 0.1991, NULL, NULL, 248.439),
(1198, '魚貝類', '銀鯧(2月)', '樣品狀態:生; 前處理描述:去鱗,去皮,去頭尾,去內臟及骨刺,混合均勻打碎', '白鯧,正鯧,銀鯧,支子', 122.598, 17.862, 5.136, 1.487, 0, NULL, NULL, 92.621),
(1199, '魚貝類', '銀鯧(3月)', '樣品狀態:生; 前處理描述:去鱗,去皮,去頭尾,去內臟及骨刺,混合均勻打碎', '白鯧,正鯧,銀鯧,支子', 119.668, 17.554, 4.957, 2.3093, 0.7332, NULL, NULL, 64.8165),
(1200, '魚貝類', '銀鯧(5月)', '樣品狀態:生; 前處理描述:去鱗,去皮,去頭尾,去內臟及骨刺,混合均勻打碎', '白鯧,正鯧,銀鯧,支子', 105.171, 16.375, 3.908, 1.9668, 0, NULL, NULL, 344.681),
(1201, '魚貝類', '銀鯧(8月)', '樣品狀態:生; 前處理描述:去鱗,去皮,去頭尾,去內臟及骨刺,混合均勻打碎', '白鯧,正鯧,銀鯧,支子', 101.378, 17.692, 2.864, 1.607, 1.558, NULL, NULL, 646.913),
(1202, '魚貝類', '銀鯧(12月)', '樣品狀態:生; 前處理描述:去鱗,去皮,去頭尾,去內臟及骨刺,混合均勻打碎', '白鯧,正鯧,銀鯧,支子', 126.121, 19.08, 4.95, 2.5897, 0.1866, NULL, NULL, 93.163),
(1203, '魚貝類', '銀鯧(含皮)', '樣品狀態:生; 前處理描述:去鱗,含皮,去頭尾,去內臟及骨刺,混合均勻打碎', '白鯧,正鯧,銀鯧,支子', 124.017, 16.8, 5.7961, 2.8041, 1.1039, NULL, 0, 315),
(1204, '魚貝類', '斑鱧', '樣品狀態:生; 前處理描述:去鱗,含皮,去頭尾,去內臟及骨刺,混合均勻打碎', '鮕鮘,雷魚,南鱧,臺灣雷魚,臺灣魚虎', 118.731, 18.3, 4.5, 1.1966, 0, NULL, NULL, 54),
(1205, '魚貝類', '大口鰜切片(含皮)', '樣品狀態:生; 前處理描述:去鱗,含皮,去頭尾,去內臟及骨刺,混合均勻打碎', '咬龍狗,左口,扁魚,皇帝魚,比目魚,咬網狗/肉瞇仔(澎湖)', 166.499, 14.7, 11.5, 2.3863, 0, NULL, NULL, 93),
(1206, '魚貝類', '鰈魚切片', '樣品狀態:生; 前處理描述:去皮及骨刺,混合均勻打碎', '大比目魚(扁鱈)', 201.188, 13.203, 16.0544, 3.4794, 0, NULL, 0, 80.3894),
(1207, '魚貝類', '雙線鬚鰨', '樣品狀態:生; 前處理描述:去鱗,含皮,去頭尾,去內臟及骨刺,混合均勻打碎', '牛舌,龍舌,扁魚,皇帝魚,比目魚', 92.189, 19.9, 0.8, 0.3355, 0.3, NULL, NULL, 63),
(1208, '魚貝類', '單角革單棘魨(去皮)', '樣品狀態:生,已去頭尾,內臟及粗皮; 前處理描述:去鱗,骨刺,混合均勻打碎', '白達仔,一角剝,薄葉剝,光復魚,剝皮魚,狄仔魚(興達),掃帚', 78.6532, 17.158, 0.5974, 0.2149, 0, NULL, 0.142, 181.179),
(1209, '魚貝類', '單角革單棘魨(含皮)', '樣品狀態:生; 前處理描述:去鱗,含皮,去頭尾,去內臟及骨刺,混合均勻打碎', '白達仔,一角剝,薄葉剝,光復魚,剝皮魚,狄仔魚(興達),掃帚', 76.433, 17.9, 0, 0, 0, NULL, NULL, 87),
(1210, '魚貝類', '克氏兔頭魨', '樣品狀態:生; 前處理描述:去鱗,含皮,去頭尾,去內臟及骨刺,混合均勻打碎', '鯖河魨,煙仔規,黃魚規,烏魚規,青皮魚規,金紙規,規仔,金規(澎湖)', 76.908, 17.8, 0.1, 0.0318, 0, NULL, NULL, 134),
(1211, '魚貝類', '翻車魨腹肉', '樣品狀態:生; 前處理描述:混合均勻打碎', '翻車魚,蜇魴,蜇魚,海蟲(澎湖),曼波(成功) ', 47.4541, 10.208, 0.4286, 0.2654, 0.692, NULL, 0, 52.385),
(1212, '魚貝類', '犬牙南極魚切片', '樣品狀態:生; 前處理描述:去皮及骨刺,混合均勻打碎', '南極鱈,美露鱈,黑狗鱈,智利海鱸(圓鱈)', 281.826, 12.1075, 25.513, 6.1897, 0, NULL, 0, 79.0315),
(1213, '魚貝類', '低眼無齒芒魚片(芒加魚邊)', '樣品狀態:生,冷凍產品; 前處理描述:混合均勻打碎', NULL, 75.6232, 14.171, 1.6755, 0.7628, 0, NULL, 0, 285.256),
(1214, '魚貝類', '秋刀魚', '樣品狀態:生; 前處理描述:去鱗,去皮,去頭尾,去內臟及骨刺,混合均勻打碎', '竹刀魚,山瑪魚', 276.64, 18.8, 21.7698, 5.6251, 4.1302, NULL, 0.111, 55),
(1215, '魚貝類', '毛鱗魚', '樣品狀態:生,冷凍袋裝,含卵; 前處理描述:混合均勻打碎', '喜相逢,多春魚,樺太柳葉魚（日文）', 145.134, 14.098, 9.4164, 1.9086, 0.4135, 0, 0.074, 309.7),
(1216, '魚貝類', '圓鱈魚鰓肉', '樣品狀態:生,冷凍產品; 前處理描述:混合均勻打碎', NULL, 84.0575, 14.503, 2.4534, 0.673, 3.9245, NULL, 0.031, 224.82),
(1217, '魚貝類', '鯛魚下巴', '樣品狀態:生,冷凍產品; 前處理描述:去皮及骨刺,混合均勻打碎', '鯛魚喉', 245.06, 16.052, 19.5696, 5.2599, 0, NULL, 0, 38.419),
(1218, '魚貝類', '鯊魚翅', '樣品狀態:生; 前處理描述:經復水處理,混合均勻打碎', '魚翅', 185.745, 43.5, 0, NULL, 0, NULL, NULL, 7),
(1219, '魚貝類', '魚翅唇', '樣品狀態:生,冷凍產品; 前處理描述:混合均勻打碎', NULL, 47.466, 9.933, 0.5601, 0.1686, 0, NULL, 0, 34.73),
(1220, '魚貝類', '翻車魨魚皮', '樣品狀態:生,切片(進口); 前處理描述:混合均勻打碎', '曼波魚皮,翻車魚皮', 27.6696, 6.48, 0, 0, 0.01, 0, 0, 205.46),
(1221, '魚貝類', '鯊魚皮', '樣品狀態:生; 前處理描述:混合均勻打碎', NULL, 54.416, 12.402, 0.1618, NULL, 0, NULL, 0, 47.255),
(1222, '魚貝類', '魚漿(旗魚)', '樣品狀態:生; 前處理描述:混合均質', NULL, 110.101, 16.838, 1.2622, 0.4803, 7.8472, 2.6443, 3.905, 754.69),
(1223, '魚貝類', '鮸魚卵(加工)', '樣品狀態:熟; 前處理描述:混合均勻打碎', NULL, 184.093, 21.856, 10.063, 2.3739, 3.6045, NULL, NULL, 150.49),
(1224, '魚貝類', '鯔魚卵', '樣品狀態:生(烏魚卵); 前處理描述:混合均勻打碎', '烏魚卵', 256.066, 26.318, 15.93, 2.5908, 3.1944, NULL, NULL, 72.954),
(1225, '魚貝類', '鰆魚卵', '樣品狀態:生; 前處理描述:混合均勻打碎', '土魠魚卵', 192.51, 23.496, 10.2198, 2.9494, 0.245, NULL, 0, 89.001),
(1226, '魚貝類', '鰹魚卵', '樣品狀態:生; 前處理描述:混合均勻打碎', NULL, 183.689, 21.493, 10.19, 2.9467, 0.6398, NULL, NULL, 128.81),
(1227, '魚貝類', '鯔魚精囊', '樣品狀態:生; 前處理描述:混合均勻打碎', '鯔(烏)魚鰾(膘)', 88.8234, 17.274, 1.67, 0.5631, 0, NULL, NULL, 60.916),
(1228, '魚貝類', '鮟鱇魚肝', '樣品狀態:生; 前處理描述:取魚肝; 混合均勻打碎', NULL, 135.827, 13.617, 8.6122, 3.1521, 1.9139, NULL, 0.858, 188.375),
(1229, '魚貝類', '旗魚肚', '樣品狀態:生; 前處理描述:混合均勻打碎', NULL, 99.4642, 22.491, 0.38, NULL, 2.894, NULL, NULL, 291.62),
(1230, '魚貝類', '鮪魚肚', '樣品狀態:生; 前處理描述:混合均勻打碎', NULL, 105.788, 23.352, 0.6735, 0.2781, 0, NULL, 0, 35.4693),
(1231, '魚貝類', '小魚干', '樣品狀態:乾貨; 前處理描述:混合均勻打碎', NULL, 335.172, 69.2, 4.4, 2.0504, 0, NULL, NULL, 1753),
(1232, '魚貝類', '扁魚干', '樣品狀態:乾貨; 前處理描述:混合均勻打碎', NULL, 354.275, 66.2917, 7.8946, 3.2137, 1.0648, NULL, NULL, 406.206),
(1233, '魚貝類', '柴魚片', '樣品狀態:乾貨; 前處理描述:混合均勻打碎', NULL, 382.579, 76.5, 6.2, 2.7943, 2.6, NULL, NULL, 433),
(1234, '魚貝類', '羅氏沼蝦', '樣品狀態:生; 前處理描述:去殼,去頭尾及腸泥,混合均勻打碎', '泰國蝦,泰國長臂大蝦,淡水長臂大蝦', 88.034, 20.3, 0.15, 0.0734, 0.2115, NULL, NULL, 103.6),
(1235, '魚貝類', '北方長額蝦(加工)', '樣品狀態:熟; 前處理描述:去殼,去頭尾,混合均勻打碎', '北極蝦,北極甜蝦,冷水蝦', 121.981, 19.94, 4.0839, 0.8604, 2.662, NULL, NULL, 562.373),
(1236, '魚貝類', '東方異腕蝦', '樣品狀態:生; 前處理描述:去殼,去頭尾及腸泥,混合均勻打碎', '米諾蝦,鐵甲蝦,蝦母,大頭蝦', 78.4606, 17.72, 0.31, 0.0776, 0, NULL, NULL, 456.74),
(1237, '魚貝類', '胭脂蝦', '樣品狀態:生; 前處理描述:去頭尾及外殼,混合均勻打碎', '文蝦(\"葉狀擬鬚蝦或雄壯鬚蝦\")', 114.385, 13.832, 6.1333, 1.223, 0.7144, NULL, 0.18, 461.583),
(1238, '魚貝類', '日本玻璃蝦', '樣品狀態:熟,冷凍包裝; 前處理描述:混合均勻打碎', '水晶蝦,白丁', 82.5617, 16.248, 1.4615, 0.4299, 1.9755, NULL, 0.54, 565.916),
(1239, '魚貝類', '相模後海螯蝦', '樣品狀態:生; 前處理描述:去殼,去頭尾及腸泥,混合均勻打碎', '相模角蝦,小龍蝦,鐵甲蝦,角蝦,蝦猴', 79.1294, 17.94, 0.28, 0.024, 0, NULL, NULL, 316.94),
(1240, '魚貝類', '中國對蝦', '樣品狀態:生; 前處理描述:去殼,去頭尾及腸泥,混合均勻打碎', '對蝦;明蝦;大蝦;黃蝦;青蝦;大正蝦', 84.215, 19.3, 0.2, 0.0622, 1, NULL, NULL, 196),
(1241, '魚貝類', '日本對蝦平均值', '樣品狀態:生; 前處理描述:去殼,去頭尾及腸泥,混合均勻打碎', '斑節蝦,雷公蝦,明蝦,九節蝦', 96.7925, 21.2825, 0.6559, 0.1852, 0.3962, NULL, 0, 286.965),
(1242, '魚貝類', '日本對蝦(大)', '樣品狀態:生; 前處理描述:去殼,去頭尾及腸泥,混合均勻打碎', '斑節蝦,雷公蝦,明蝦,九節蝦', 97.2737, 21.632, 0.5438, 0.1436, 0, NULL, 0, 254.749),
(1243, '魚貝類', '日本對蝦(小)', '樣品狀態:生; 前處理描述:去殼,去頭尾及腸泥,混合均勻打碎', '斑節蝦,雷公蝦,明蝦,九節蝦', 96.3113, 20.933, 0.768, 0.231, 1.8173, NULL, 0, 319.181),
(1244, '魚貝類', '白對蝦平均值', '樣品狀態:生; 前處理描述:去殼,去頭尾及腸泥,混合均勻打碎', '南美白蝦,美洲白蝦,南美白對蝦,白蝦', 99.354, 21.3463, 0.9097, 0.3492, 0, 0, 0.136, 209.521),
(1245, '魚貝類', '白對蝦(大)', '樣品狀態:生,冷凍包裝; 前處理描述:去殼,去頭尾及腸泥,混合均勻打碎', '南美白蝦,美洲白蝦,南美白對蝦,白蝦', 109.238, 22.325, 1.5421, 0.4705, 0, NULL, 0, 305.688),
(1246, '魚貝類', '白對蝦(小)', '樣品狀態:生; 前處理描述:去殼,去頭尾及腸泥,混合均勻打碎', '南美白蝦,美洲白蝦,南美白對蝦,白蝦', 96.1628, 21.39, 0.5352, 0.1908, 0, NULL, 0, 177.645),
(1247, '魚貝類', '白對蝦(小)(2022年取樣)', '樣品狀態:生,冷凍包裝; 前處理描述:去殼,去頭尾及腸泥,混合均勻打碎', '南美白蝦,美洲白蝦,南美白對蝦,白蝦', 92.6618, 20.324, 0.6517, 0.3193, 1.3149, 0, 0.408, 145.23),
(1248, '魚貝類', '哈氏彷對蝦', '樣品狀態:生; 前處理描述:去殼,去頭尾及腸泥,混合均勻打碎', '長角仿對蝦,劍蝦,紅(正)劍,硬槍蝦', 81.9359, 18.724, 0.22, 0.0719, 0.566, NULL, NULL, 293.5),
(1249, '魚貝類', '草對蝦', '樣品狀態:生; 前處理描述:去殼,去頭尾及腸泥,混合均勻打碎', '草蝦;烏斑節仔', 100.208, 22, 0.6949, 0.2706, 1.0051, NULL, 0.282, 150),
(1250, '魚貝類', '藍對蝦', '樣品狀態:生; 前處理描述:去殼,去頭尾及腸泥,混合均勻打碎', '藍蝦', 95.204, 20.924, 0.6495, 0.1855, 0, NULL, 0, 135.318),
(1251, '魚貝類', '鬚赤蝦', '樣品狀態:生; 前處理描述:去殼,去頭尾及腸泥,混合均勻打碎', '鬚赤對蝦,厚殼蝦(仔),火燒蝦,狗蝦,大厚殼', 92.0872, 20.7, 0.41, 0.1204, 0.58, NULL, NULL, 341.13),
(1252, '魚貝類', '大管鞭蝦', '樣品狀態:生; 前處理描述:去殼,去頭尾及腸泥,混合均勻打碎', '憂鬱管鞭蝦,大頭紅蝦,大頭蝦,紅中蝦,蔥頭蝦', 87.6555, 19.81, 0.34, 0.0993, 0.62, NULL, NULL, 270.16),
(1253, '魚貝類', '隆脊管鞭蝦', '樣品狀態:生; 前處理描述:去殼,去頭尾及腸泥,混合均勻打碎', '大頭紅蝦,大頭蝦,紅蝦,蔥頭蝦', 96.171, 22.1, 0.2, 0.0649, 0.6, NULL, NULL, 207),
(1254, '魚貝類', '螳螂蝦', '樣品狀態:生; 前處理描述:去殼,去頭尾及腸泥,混合均勻打碎', '蝦蛄,蝦猴,蝦姑仔,攋尿蝦(常誤寫為瀨或賴)', 66.828, 14.7, 0.45, 0.1625, 0, NULL, NULL, 343.54),
(1255, '魚貝類', '日本龍蝦', '樣品狀態:生; 前處理描述:去殼,去頭尾及腸泥,混合均勻打碎', '龍蝦;台灣龍蝦;紅腳蝦;紅殼仔;正龍蝦;紅龍蝦', 92.707, 21.5, 0.1, 0.0219, 1, NULL, NULL, 234),
(1256, '魚貝類', '正櫻蝦(生)', '樣品狀態:生; 前處理描述:帶殼,混合均勻打碎', '櫻花蝦,花殼仔,櫻桃蝦,玫瑰蝦,火焰蝦 ', 88.4371, 17.895, 1.3332, 0.4159, 0, NULL, 0, 386.162),
(1257, '魚貝類', '正櫻蝦(熟)', '樣品狀態:熟; 前處理描述:帶殼,混合均勻打碎', '櫻花蝦,花殼仔,櫻桃蝦,玫瑰蝦,火焰蝦 ', 96.6951, 19.642, 1.4217, 0.437, 0, NULL, 0, 503.585),
(1258, '魚貝類', '正櫻蝦乾', '樣品狀態:乾貨; 前處理描述:混合均勻打碎', '櫻花蝦,花殼仔,櫻桃蝦,玫瑰蝦,火焰蝦 ', 252.689, 52.557, 3.1342, 0.4598, 13.429, NULL, NULL, 1345.22),
(1259, '魚貝類', '大頭蝦仁', '樣品狀態:生,冷凍包裝; 前處理描述:混合均勻打碎', NULL, 39.9111, 8.842, 0.239, 0.0923, 0, NULL, NULL, 764.74),
(1260, '魚貝類', '明蝦仁', '樣品狀態:生; 前處理描述:混合均勻打碎', NULL, 51.6975, 11.879, 0.108, 0.0381, 0, NULL, NULL, 251.591),
(1261, '魚貝類', '紅蝦仁', '樣品狀態:生,冷凍包裝; 前處理描述:混合均勻打碎', NULL, 43.3707, 9.464, 0.3281, 0.1072, 1.543, NULL, 0, 596.387),
(1262, '魚貝類', '海鱸蝦仁', '樣品狀態:生; 前處理描述:混合均勻打碎', NULL, 73.4793, 16.275, 0.4418, 0.1427, 1.2765, NULL, 0, 225.136),
(1263, '魚貝類', '草蝦仁', '樣品狀態:生; 前處理描述:混合均勻打碎', NULL, 43.9958, 9.682, 0.2942, 0.1236, 0.8956, NULL, 0, 430.645),
(1264, '魚貝類', '鳳尾蝦仁', '樣品狀態:生,冷凍包裝; 前處理描述:去尾殼,混合均勻打碎', NULL, 64.4543, 13.368, 0.8174, 0.3, 0.3063, NULL, 0, 356.956),
(1265, '魚貝類', '鬚赤蝦仁', '樣品狀態:生; 前處理描述:混合均勻打碎', '火燒蝦仁', 79.563, 17.103, 0.7243, 0.2936, 0, NULL, 0.355, 279.129),
(1266, '魚貝類', '蝦皮', '樣品狀態:乾貨; 前處理描述:混合均勻打碎', NULL, 155.198, 33.6, 1.3, 0.5398, 2.7, NULL, NULL, 4273),
(1267, '魚貝類', '蝦米', '樣品狀態:乾貨; 前處理描述:混合均勻打碎', NULL, 263.7, 57.1, 2.2043, 0.8175, 0, NULL, 0, 3186),
(1268, '魚貝類', '金鉤蝦乾', '樣品狀態:乾貨; 前處理描述:混合均勻打碎', '海米,扁米,開洋', 256.737, 54.64, 2.5969, 1.0856, 0, NULL, 1.262, 2553.32),
(1269, '魚貝類', '紅蟳', '樣品狀態:生; 前處理描述:取可食部位,混合均勻打碎', '青蟳(蟹)(交配後卵巢成熟雌蟹),菜蟳', 121.715, 20.9, 3.6, 1.7568, 6.5, NULL, NULL, 309),
(1270, '魚貝類', '蛙形蟹', '樣品狀態:生; 前處理描述:取可食部位,混合均勻打碎', '旭蟹,蝦姑頭,候貝切,紅面猴,海臭蟲,西姑麻', 71.8315, 16.59, 0.11, 0.0192, 2.76, NULL, NULL, 342.96),
(1271, '魚貝類', '蟹腳肉', '樣品狀態:生; 前處理描述:混合均勻打碎', NULL, 52.6282, 11.643, 0.3229, 0.1201, 1.1756, NULL, 0, 591.43),
(1272, '魚貝類', '竹蟶(冷凍)', '樣品狀態:生,冷凍包裝; 前處理描述:去殼,混合均勻打碎', '竹蛤,竹蚶,蟶仔,竹節蟶', 41.5107, 8.991, 0.3458, 0.1635, 1.1801, NULL, 0, 498.502),
(1273, '魚貝類', '真牡蠣平均值', '樣品狀態:生; 前處理描述:去殼,混合均勻打碎', '正(大/長/鑄大)牡蠣,正(青)蚵,蚵仔,蚵,蠔', 54.28, 9.3878, 1.5737, 0.6228, 4.2387, NULL, 0.352, 148.344),
(1274, '魚貝類', '真牡蠣', '樣品狀態:生; 前處理描述:混合均勻打碎', '正(大/長/鑄大)牡蠣,正(青)蚵,蚵仔,蚵,蠔', 49.3481, 8.9855, 1.2173, 0.4909, 1.7674, NULL, 0.352, 193.817),
(1275, '魚貝類', '帶殼真牡蠣(生蠔)', '樣品狀態:生; 前處理描述:去殼,混合均勻打碎', '正(大/長/鑄大)牡蠣,正(青)蚵,蚵仔,蚵,蠔', 59.2119, 9.79, 1.93, 0.7494, 6.71, NULL, NULL, 102.87),
(1276, '魚貝類', '黑齒牡蠣', '樣品狀態:生; 前處理描述:去殼,混合均勻打碎', '石蚵', 55.4267, 9.739, 1.5345, 0.613, 3.105, NULL, 2.151, 748.512),
(1277, '魚貝類', '蝦夷海扇蛤', '樣品狀態:生; 前處理描述:混合均勻打碎', '扇貝,立帆蛤,帆立貝', 69.612, 13.7155, 1.2247, 0.4212, 2.3343, NULL, 0, 283.234),
(1278, '魚貝類', '綠殼菜蛤', '樣品狀態:生; 前處理描述:去殼,混合均勻打碎', '孔雀蛤,淡菜,翡翠貽貝', 95.55, 17.772, 2.18, 0.6749, 2.6441, NULL, NULL, 300.67),
(1279, '魚貝類', '綠殼菜蛤干', '樣品狀態:乾貨; 前處理描述:混合均勻打碎', '孔雀蛤干,淡菜干,翡翠貽貝干', 263.105, 43.651, 8.505, 3.5993, 23.929, NULL, NULL, 865.37),
(1280, '魚貝類', '西施舌', '樣品狀態:生; 前處理描述:去殼,混合均勻打碎', '紫貝,西肚舌,西刀舌(蚶),紫晃肉,雙線血蚶,獅刀舌,西施貝', 52.8599, 8.915, 1.64, 0.6562, 5.365, NULL, NULL, 35.69),
(1281, '魚貝類', '台灣蜆', '樣品狀態:生; 前處理描述:去殼,混合均勻打碎', '蜆(蜊/拉)仔,河蜆', 51.1626, 8.94, 1.44, 0.6293, 9.7723, NULL, NULL, 20.19),
(1282, '魚貝類', '大文蛤', '樣品狀態:生; 前處理描述:去殼,混合均勻打碎', '文蛤,普通文蛤', 20.5066, 4.38, 0.2, NULL, 1.5142, NULL, NULL, 773.79),
(1283, '魚貝類', '文蛤', '樣品狀態:生; 前處理描述:去殼,混合均勻打碎', '粉蟯,蚶仔,麗文蛤,普通文蛤', 36.9374, 7.6105, 0.4923, 0.1957, 2.7132, NULL, 0, 446.244),
(1284, '魚貝類', '波紋橫簾蛤 ', '樣品狀態:生; 前處理描述:去外殼,混合均勻打碎', '波紋巴非蛤,山瓜仔(子),海瓜仔(子)', 48.3223, 9.184, 1.0096, 0.4083, 4.6406, NULL, 1.495, 377.027),
(1285, '魚貝類', '菲律賓簾蛤', '樣品狀態:生; 前處理描述:去外殼,混合均勻打碎', '菲律賓蛤仔,海瓜子(仔)蛤,花蛤', 36.8107, 7.52, 0.5211, 0.2121, 4.0743, NULL, 1.424, 441.684),
(1286, '魚貝類', '環文蛤', '樣品狀態:生; 前處理描述:去外殼,混合均勻打碎', '赤嘴蛤,赤嘴仔,青蛤,海蜆,公代', 45.9777, 8.738, 0.9608, 0.4476, 3.677, NULL, 1.362, 760.042),
(1287, '魚貝類', '干貝(冷凍)', '樣品狀態:冷凍包裝; 前處理描述:混合均勻打碎', '元貝,瑤柱', 57.4595, 12.668, 0.3733, 0.0846, 1.676, NULL, 0, 948.628),
(1288, '魚貝類', '干貝(乾)平均值', '樣品狀態:乾貨; 前處理描述:混合均勻打碎', NULL, 242.243, 53.7005, 1.4349, 0.5723, 10.8178, NULL, 0, 2751.21),
(1289, '魚貝類', '干貝(乾)', '樣品狀態:乾貨; 前處理描述:混合均勻打碎', '元貝,瑤柱', 256.109, 58.5, 0.7, NULL, 15.5, NULL, NULL, 2424),
(1290, '魚貝類', '珠貝(乾)', '樣品狀態:乾貨; 前處理描述:混合均勻打碎', '珍珠干貝', 228.378, 48.901, 2.1697, 0.8653, 6.1355, NULL, 0, 3078.42),
(1291, '魚貝類', '牡蠣干', '樣品狀態:乾貨; 前處理描述:混合均勻打碎', '蚵干', 242.72, 41, 7.5, 3.225, 26.2, NULL, NULL, 1316),
(1292, '魚貝類', '真烏賊平均值', '樣品狀態:生; 前處理描述:去皮膜,去內臟,去口器及眼睛,混合均勻打碎', '花枝,墨魚,金烏賊,烏鰂,墨鬥魚', 57.1921, 12.1775, 0.5759, 0.2273, 3.6793, NULL, 0, 68.0375),
(1293, '魚貝類', '真烏賊(大)', '樣品狀態:生; 前處理描述:去皮膜,去內臟,去口器及眼睛,混合均勻打碎', '花枝,墨魚,金烏賊,烏鰂,墨鬥魚', 61.3945, 13.85, 0.25, 0.0849, 0.75, NULL, NULL, 106),
(1294, '魚貝類', '真烏賊(小)', '樣品狀態:生; 前處理描述:去皮膜,去內臟,去口器及眼睛,混合均勻打碎', '花枝,墨魚,金烏賊,烏鰂,墨鬥魚', 52.9897, 10.505, 0.9017, 0.4053, 6.6085, NULL, 0, 30.075),
(1295, '魚貝類', '章魚', '樣品狀態:生,小型; 前處理描述:混合均勻打碎', '厚嘴仔,石居,八爪魚,坐蛸,石吸,望潮,死牛', 60.922, 13, 0.6, NULL, 0.9, NULL, NULL, 230),
(1296, '魚貝類', '阿根廷魷', '樣品狀態:生; 前處理描述:去外皮及骨刺,混合均勻打碎', '阿根廷滑柔魚', 70.7838, 12.439, 1.9589, 0.7199, 0.3703, NULL, 0, 57.039),
(1297, '魚貝類', '泡魷魚', '樣品狀態:生; 前處理描述:混合均勻打碎', NULL, 50.253, 11.283, 0.23, 0, 2.9877, NULL, NULL, 239.077),
(1298, '魚貝類', '台灣鎖管', '樣品狀態:生; 前處理描述:去內臟,去口器及眼睛,混合均勻打碎', '鎖管,小卷 ', 71.928, 16, 0.4, 0.153, 1.6, NULL, NULL, 249),
(1299, '魚貝類', '尖鎖管 ', '樣品狀態:生; 前處理描述:去眼及口器,去內臟不可食部份,混合均勻打碎', '尖仔鎖管,詩博加槍烏賊,尖仔,小卷(幼體)', 100.081, 20.2, 1.5329, 0.6579, 2.3604, NULL, 0, 211.401),
(1300, '魚貝類', '軟翅仔', '樣品狀態:生; 前處理描述:去皮膜,去內臟,去口器及眼睛,混合均勻打碎', '萊氏擬烏賊,軟翅鎖管,軟翅(薯/絲),泥障鰂,擬烏賊,柔魚', 69.9598, 14.681, 0.8062, 0.2891, 0.8415, NULL, 0, 399.656),
(1301, '魚貝類', '香螺 ', '樣品狀態:生; 前處理描述:去殼,混合均勻打碎', '小天狗剌螺,雪螺', 86.0218, 19.9365, 0.099, 0.0206, 0, NULL, NULL, 165.995),
(1302, '魚貝類', '象牙鳳螺', '樣品狀態:生; 前處理描述:去殼,混合均勻打碎', '鳳(花/風/皇)螺,象牙螺', 78.1302, 16.917, 0.6535, 0.2027, 3.5796, NULL, NULL, 372.067),
(1303, '魚貝類', '泥螺', '樣品狀態:生,冷凍包裝; 前處理描述:混合均勻打碎', '黃泥螺', 94.5793, 21.535, 0.291, 0.0804, 0.2805, NULL, NULL, 166.198),
(1304, '魚貝類', '雪螺', '樣品狀態:生; 前處理描述:混合均勻打碎', NULL, 40.232, 8.877, 0.258, 0, 0, NULL, NULL, 57.6656),
(1305, '魚貝類', '九孔螺', '樣品狀態:生; 前處理描述:去殼,混合均勻打碎', '九孔;雜色鮑;石決明 ', 73.07, 15, 1, 0.4487, 5.8, NULL, NULL, 327),
(1306, '魚貝類', '鮑魚', '樣品狀態:生; 前處理描述:混合均勻打碎', '鰒魚;石決明;石決明貝', 68.6773, 15.7985, 0.135, 0.0401, 9.5466, NULL, NULL, 198.58),
(1307, '魚貝類', '蝸牛肉', '樣品狀態:生; 前處理描述:混合均勻打碎', NULL, 77.5601, 16.714, 0.6864, 0.2095, 0, NULL, 0, 72.329),
(1308, '魚貝類', '烏賊精囊', '樣品狀態:生; 前處理描述:混合均勻打碎', '烏賊鰾(膘),花枝鰾(膘)', 43.4905, 9.788, 0.188, 0, 6.444, NULL, NULL, 428.399),
(1309, '魚貝類', '小卷干', '樣品狀態:生; 前處理描述:混合均勻打碎', '鎖管干(乾)', 246.402, 53.202, 2.1319, 0.7926, 4.6951, NULL, NULL, 1378.24),
(1310, '魚貝類', '白海參', '樣品狀態:生,已泡發; 前處理描述:去內臟,混合均勻打碎', '海蚯蚓,沙糞', 32.4037, 7.399, 0.0898, 0.0384, 0, NULL, 0, 50.926),
(1311, '魚貝類', '仿刺參', '樣品狀態:生,已泡發; 前處理描述:去內臟,混合均勻打碎', '刺參', 35.7906, 8.234, 0.07, NULL, 0.8001, NULL, NULL, 52.61),
(1312, '魚貝類', '南美刺參', '樣品狀態:生,已泡發; 前處理描述:去內臟,混合均勻打碎', NULL, 51.5209, 11.961, 0.0496, 0.0178, 0, NULL, 0, 85.618),
(1313, '魚貝類', '紅海參', '樣品狀態:生,已泡發; 前處理描述:去內臟,混合均勻打碎', NULL, 32.7196, 7.462, 0.095, 0, 0.0318, NULL, NULL, 86.768),
(1314, '魚貝類', '黑烏參', '樣品狀態:生,已泡發; 前處理描述:去內臟,混合均勻打碎', NULL, 28.7669, 6.497, 0.1136, 0.0425, 0, NULL, 0, 64.019),
(1315, '魚貝類', '海蜇皮', '樣品狀態:生,已泡發; 前處理描述:混合均勻打碎', '瑝魚,海蛇,紅(面)蜇,鮓魚', 18.7368, 4.388, 0, NULL, 2.221, NULL, NULL, 8126.86),
(1316, '蛋類', '雞蛋平均值', '樣品狀態:生; 前處理描述:去殼,混合均質', NULL, 135.403, 12.6727, 8.8859, 3.0753, 1.633, 0, 0.2206, 138.031),
(1317, '蛋類', '雞蛋(白殼)', '樣品狀態:生; 前處理描述:去殼,混合均質', NULL, 138.96, 12.8837, 9.1782, 3.1725, 1.2752, 0, 0.137, 129.085),
(1318, '蛋類', '雞蛋(黃殼)', '樣品狀態:生; 前處理描述:去殼,混合均質', NULL, 131.846, 12.4617, 8.5935, 2.9778, 1.9907, NULL, 0.3042, 146.977),
(1319, '蛋類', '土雞蛋', '樣品狀態:生; 前處理描述:去殼,混合均質', NULL, 129.093, 12.9475, 8.0534, 2.4963, 1.6916, NULL, 0.436, 140.419),
(1320, '蛋類', '土雞蛋(2022年取樣)', '樣品狀態:生; 前處理描述:去殼,混合均質', NULL, 137.018, 12.164, 9.3107, 3.2988, 1.8187, 0, 0.304, 152.25),
(1321, '蛋類', '烏骨雞蛋', '樣品狀態:生; 前處理描述:去殼,混合均質', NULL, 159.743, 12.66, 11.5904, 3.9298, 2.4437, NULL, 0.3397, 119.599),
(1322, '蛋類', '雞蛋(高DHA)', '樣品狀態:生; 前處理描述:去殼,混合均質', NULL, 131.945, 12.537, 8.568, 3.031, 1.8487, NULL, NULL, 140.634),
(1323, '蛋類', '雞蛋(高次亞麻油酸)', '樣品狀態:生; 前處理描述:去殼,混合均質', NULL, 139.077, 12.431, 9.41, 3.0519, 2.8026, NULL, NULL, 137.11),
(1324, '蛋類', '雞蛋(高亞麻油酸)', '樣品狀態:生; 前處理描述:去殼,混合均質', NULL, 132.625, 13.02, 8.41, 2.3959, 0.8307, NULL, NULL, 161.16),
(1325, '蛋類', '初卵雞蛋', '樣品狀態:生,雞蛋(新生初產母雞1~6週生產之雞蛋); 前處理描述:去殼,混合均質', NULL, 136.087, 12.279, 9.152, 3.2349, 1.3608, NULL, 0.3186, 114.745),
(1326, '蛋類', '雞蛋(高維生素A&E)', '樣品狀態:生; 前處理描述:去殼,混合均質', NULL, 134.026, 12.1, 9.01, 2.8429, 0, NULL, NULL, 151.31),
(1327, '蛋類', '雞蛋(高維生素E)', '樣品狀態:生; 前處理描述:去殼,混合均質', NULL, 143.151, 12.786, 9.69, 3.0799, 1.4127, NULL, NULL, 139.48),
(1328, '蛋類', '雞蛋白平均值', '樣品狀態:生; 前處理描述:去殼及蛋黃,混合均質', NULL, 50.0184, 11.171, 0.1456, 0.1027, 0.5265, NULL, 0.305, 183.487),
(1329, '蛋類', '雞蛋白(白殼)', '樣品狀態:生; 前處理描述:去殼及蛋黃,混合均質', NULL, 47.5857, 10.705, 0.1011, 0.0713, 0, NULL, 0.305, 153.563),
(1330, '蛋類', '雞蛋白(黃殼)', '樣品狀態:生; 前處理描述:去殼及蛋黃,混合均質', NULL, 52.4511, 11.637, 0.19, NULL, 1.1781, NULL, NULL, 213.41),
(1331, '蛋類', '烏骨雞蛋白', '樣品狀態:生; 前處理描述:去殼及蛋黃,混合均質', NULL, 46.85, 10.643, 0.0495, 0.0172, 1.6638, NULL, 0, 183.734),
(1332, '蛋類', '雞蛋黃平均值', '樣品狀態:生; 前處理描述:去殼及蛋白,混合均質', NULL, 307.992, 15.2217, 26.7878, 9.2118, 3.5698, NULL, 0, 56.3197),
(1333, '蛋類', '雞蛋黃(白殼)', '樣品狀態:生; 前處理描述:去殼及蛋白,混合均質', NULL, 330.058, 15.9843, 28.8655, 9.9015, 1.561, NULL, 0, 52.4994),
(1334, '蛋類', '雞蛋黃(黃殼)', '樣品狀態:生; 前處理描述:去殼及蛋白,混合均質', NULL, 285.925, 14.459, 24.71, 8.5185, 5.5786, NULL, NULL, 60.14),
(1335, '蛋類', '烏骨雞蛋黃', '樣品狀態:生; 前處理描述:去殼及蛋白,混合均質', NULL, 343.672, 15.51, 30.604, 10.8552, 1.4401, NULL, 0.238, 49.717),
(1336, '蛋類', '雞蛋黃(高維生素E)', '樣品狀態:生; 前處理描述:去殼及蛋白,混合均質', NULL, 314.329, 16.236, 27, 9.0418, 5.3503, NULL, NULL, 57.07),
(1337, '蛋類', '溫泉蛋', '樣品狀態:熟,真空包裝(雞蛋,醬油,鹽,糖等); 前處理描述:去殼,混合均勻打碎', NULL, 137.492, 12.945, 7.8417, 2.8294, 3.7843, NULL, 0.584, 493.758),
(1338, '蛋類', '雞水煮蛋', '前處理描述:約7L一次水以大火煮25分鐘,水滾後續煮10分鐘,撈出瀝乾均質', NULL, 144.219, 14.001, 9.2211, 3.0802, 1.7098, NULL, NULL, 123.765),
(1339, '蛋類', '雞水煮蛋白', '前處理描述:約7L一次水以大火煮25分鐘,水滾後續煮10分鐘,撈出瀝乾,取蛋白均質', NULL, 60.7781, 13.557, 0.1851, 0.0906, 1.5401, NULL, NULL, 170.041),
(1340, '蛋類', '雞水煮蛋黃', '前處理描述:約7L一次水以大火煮25分鐘,水滾後續煮10分鐘,撈出瀝乾,取蛋黃均質', NULL, 342.56, 15.544, 30.4643, 10.0924, 2.9185, NULL, NULL, 50.2446),
(1341, '蛋類', '茶葉蛋平均值', '樣品狀態:熟,雞蛋製品; 前處理描述:去殼,混合均勻打碎', NULL, 145.046, 13.6533, 9.0607, 3.1438, 2.2218, NULL, 1.7515, 443.951),
(1342, '蛋類', '茶葉蛋(市售)', '樣品狀態:熟,雞蛋製品; 前處理描述:去殼,混合均勻打碎', NULL, 146.718, 13.522, 8.7314, 3.1332, 3.5119, NULL, 1.7515, 429.544),
(1343, '蛋類', '茶葉蛋(浸泡隔夜)', '前處理描述:以白煮蛋煮2小時後(水1.5L,鹽45g,烏龍茶葉40g),原液浸泡隔夜,撈出瀝乾均質', NULL, 143.375, 13.7846, 9.39, 3.1466, 0.9316, NULL, NULL, 458.358),
(1344, '蛋類', '茶葉蛋白(浸泡隔夜)', '前處理描述:以白煮蛋煮2小時後(水1.5L,鹽45g,烏龍茶葉40g),原液浸泡隔夜,取蛋白均質', NULL, 54.4229, 12.932, 0.1265, 0.0448, 0.3891, NULL, NULL, 555.352),
(1345, '蛋類', '茶葉蛋黃(浸泡隔夜)', '前處理描述:以白煮蛋煮2小時後(水1.5L,鹽45g,烏龍茶葉40g),原液浸泡隔夜,取蛋黃均質', NULL, 344.104, 15.7065, 30.2935, 10.1492, 2.1592, NULL, NULL, 239.403),
(1346, '蛋類', '雞皮蛋平均值', '樣品狀態:雞蛋製品; 前處理描述:去殼,混合均勻打碎', NULL, 134.337, 12.496, 8.0598, 2.7276, 2.9538, NULL, 0, 599.147),
(1347, '蛋類', '雞皮蛋', '樣品狀態:雞蛋製品(雞蛋,食鹽,鹼液等); 前處理描述:去殼,混合均勻打碎', NULL, 141.895, 12.757, 8.5105, 2.6755, 3.5682, NULL, NULL, 615.533),
(1348, '蛋類', '土雞皮蛋', '樣品狀態:雞蛋製品(雞蛋,食鹽,鹼液等); 前處理描述:去殼,混合均勻打碎', NULL, 126.778, 12.235, 7.609, 2.758, 2.3393, NULL, 0, 582.761),
(1349, '蛋類', '滷蛋平均值', '樣品狀態:熟,雞蛋製品; 前處理描述:混合均勻打碎', NULL, 183.77, 16.4022, 11.0762, 3.8032, 4.6187, NULL, 4.3393, 1155.92),
(1350, '蛋類', '雞滷蛋(市售)', '樣品狀態:熟,雞蛋製品(雞蛋,醬油,調味料等); 前處理描述:混合均勻打碎', NULL, 190.791, 15.6803, 11.4042, 4.0536, 6.3581, NULL, 4.3393, 582.563),
(1351, '蛋類', '雞滷蛋(現煮)', '前處理描述:將水煮蛋加醬油與一次水各2L,以小火煮約2小時,撈出瀝乾均質', NULL, 178.449, 16.579, 11.0665, 3.7372, 3.1336, NULL, NULL, 1277.89),
(1352, '蛋類', '雞滷蛋(浸泡隔夜)', '前處理描述:將水煮蛋加醬油與一次水各2L,以小火煮約2小時,以原滷液浸泡隔夜,撈出瀝乾均質', NULL, 182.069, 16.9473, 10.758, 3.6249, 4.3645, NULL, NULL, 1607.3),
(1353, '蛋類', '滷蛋白平均值', '樣品狀態:熟,雞蛋製品; 前處理描述:去蛋黃,混合均勻打碎', NULL, 86.7077, 16.6855, 0.1959, 0.0749, 4.5508, NULL, NULL, 1794.4),
(1354, '蛋類', '雞滷蛋白(現煮)', '前處理描述:將水煮蛋加醬油與一次水各2L,以小火煮約2小時,瀝乾,取蛋白均質', NULL, 83.947, 16.64, 0.1962, 0.076, 3.9053, NULL, NULL, 1623.16),
(1355, '蛋類', '雞滷蛋白(浸泡隔夜)', '前處理描述:將白煮蛋加醬油與一次水各2L,以小火煮約2小時,原滷液浸泡隔夜,瀝乾,取蛋白均質', NULL, 89.4683, 16.731, 0.1955, 0.0737, 5.1962, NULL, NULL, 1965.63),
(1356, '蛋類', '滷蛋黃平均值', '樣品狀態:熟,雞蛋製品; 前處理描述:混合均勻打碎', NULL, 379.055, 17.0285, 33.6838, 11.361, 1.9468, NULL, NULL, 697.487),
(1357, '蛋類', '雞滷蛋黃(現煮)', '前處理描述:將水煮蛋加醬油與一次水各2L以小火煮約2小時後,瀝乾,取蛋黃均質', NULL, 375.741, 16.6395, 33.7644, 11.4012, 1.3258, NULL, NULL, 562.843),
(1358, '蛋類', '雞滷蛋黃(浸泡隔夜)', '前處理描述:將水煮蛋加醬油與一次水各2L,以小火煮約2小時,以原液浸泡隔夜,瀝乾,取蛋黃均質', NULL, 382.369, 17.4175, 33.6031, 11.3209, 2.5678, NULL, NULL, 832.131),
(1359, '蛋類', '雞鐵蛋', '樣品狀態:熟,雞蛋製品; 前處理描述:混合均勻打碎', NULL, 287.5, 26.6, 17.5, 6.2458, 5.9, NULL, NULL, 766),
(1360, '蛋類', '雞水波蛋', '樣品狀態:熟; 前處理描述:約3L一次水滾後打入蛋,改以小火煮2~3分鐘,撈出瀝乾均質', '(不帶殼水煮蛋)', 146.959, 11.584, 10.6932, 3.6141, 0.8217, NULL, NULL, 92.4088),
(1361, '蛋類', '荷包蛋(不加油)', '前處理描述:不沾鍋中不加油,待鍋熱打入蛋,約1~2分鐘後翻面,每粒約煎2~3分鐘,取出放冷均質', NULL, 161.909, 13.9765, 11.1942, 3.8014, 1.4475, NULL, NULL, 151.337),
(1362, '蛋類', '荷包蛋(加油1小匙)', '前處理描述:不沾鍋中加入1小匙油,待油熱打入蛋,約1~2分鐘後翻面,每粒約煎2~3分鐘,取出放冷均質', NULL, 192.239, 13.0145, 14.8524, 3.0916, 1.6273, NULL, NULL, 140.402),
(1363, '蛋類', '煎蛋(不加油)', '前處理描述:雞蛋去殼打勻,小火加熱不沾鍋2~3分鐘,分五次倒入蛋液,兩面煎熟後,取出放冷均質', NULL, 160.532, 13.506, 11.2689, 3.7829, 4.8791, NULL, NULL, 145.331),
(1364, '蛋類', '炒蛋(加油3大匙)', '前處理描述:雞蛋去殼打勻,於不沾鍋中加入3大匙油,熱鍋2分鐘,倒入蛋液以小火快炒3分鐘,取出放冷均質', NULL, 214.542, 12.9025, 16.0664, 2.9616, 4.5836, NULL, NULL, 125.864),
(1365, '蛋類', '蒸蛋平均值', '樣品狀態:熟,雞蛋製品; 前處理描述:混合均勻打碎', NULL, 64.4478, 5.2615, 4.6017, 1.7143, 2.1604, NULL, NULL, 151.078),
(1366, '蛋類', '蒸蛋(市售)', '樣品狀態:熟,雞蛋製品(不含調味包); 前處理描述:混合均勻打碎', '芙蓉豆腐', 31.5742, 3.58, 1.77, 0.6461, 3.373, NULL, NULL, 326.56),
(1367, '蛋類', '蒸蛋(微波爐)', '前處理描述:雞蛋去殼加入等重一次水打勻,倒入容器,蓋上保鮮膜,以強微波加熱7.5分鐘後,取出放冷均質', NULL, 82.2243, 6.3665, 6.0384, 2.4405, 1.7743, NULL, NULL, 65.0659),
(1368, '蛋類', '蒸蛋(電鍋)', '前處理描述:雞蛋去殼加入等重一次水打勻,分裝70mL蛋液於鋼杯中,電鍋加熱25分鐘,放冷均質', NULL, 79.5448, 5.838, 5.9968, 2.0893, 1.334, NULL, NULL, 61.6071),
(1369, '蛋類', '鴨蛋', '樣品狀態:生,鴨全蛋; 前處理描述:去殼,混合均質', NULL, 187.019, 13.147, 14.3789, 4.5885, 0.211, NULL, 0, 148.733),
(1370, '蛋類', '紅面番鴨蛋', '樣品狀態:生; 前處理描述:去殼,混合均質', NULL, 198.002, 13.14, 15.6, 4.8962, 0, NULL, NULL, 129.18),
(1371, '蛋類', '鴨蛋白', '樣品狀態:生; 前處理描述:去殼及蛋黃,混合均質', NULL, 47.088, 10.8, 0, NULL, 1.4, NULL, NULL, 163),
(1372, '蛋類', '鴨蛋黃', '樣品狀態:生; 前處理描述:去殼及蛋白,混合均質', NULL, 346.704, 15.8, 30.8, 10.0008, 2, NULL, NULL, 50),
(1373, '蛋類', '鴨皮蛋', '樣品狀態:鴨蛋製品(鴨蛋,鹼液,鹽,茶葉等); 前處理描述:去殼,混合均勻打碎', NULL, 163.946, 12.7715, 11.3539, 3.5617, 2.6687, NULL, 0, 590.06),
(1374, '蛋類', '鴨鹹蛋平均值', '樣品狀態:鴨蛋製品; 前處理描述:去殼,混合均勻打碎', NULL, 184.626, 13.3108, 14.1293, 4.5755, 1.0546, NULL, 0.103, 1672.23),
(1375, '蛋類', '鴨生鹹蛋', '樣品狀態:生,鴨蛋製品; 前處理描述:去殼,混合均勻打碎', NULL, 177.716, 12.492, 14.71, 4.5742, 0, NULL, NULL, 1681.36),
(1376, '蛋類', '鴨熟鹹蛋', '樣品狀態:熟,鴨蛋製品; 前處理描述:去殼,混合均勻打碎', NULL, 182.619, 13.71, 13.8417, 4.548, 0.801, NULL, 0.206, 2068.08),
(1377, '蛋類', '鴨熟鹹蛋(薄鹽)', '樣品狀態:熟,鴨蛋製品; 前處理描述:去殼,混合均勻打碎', NULL, 193.542, 13.7305, 13.8363, 4.5933, 3.5234, NULL, 0, 1267.24),
(1378, '蛋類', '鴨鹹蛋黃', '樣品狀態:熟,鴨蛋製品; 前處理描述:混合均勻打碎', NULL, 528.324, 23.62, 47.6391, 15.2729, 1.273, NULL, 0.013, 396.501),
(1379, '蛋類', '鵪鶉蛋', '樣品狀態:生; 前處理描述:去殼,混合均質', '鳥蛋', 172.196, 12.666, 12.9681, 4.757, 1.1517, NULL, 0.395, 142.193),
(1380, '蛋類', '鵪鶉水煮蛋', '樣品狀態:熟,鵪鶉蛋製品; 前處理描述:混合均勻打碎', '鳥蛋', 162.807, 12.301, 12.1036, 4.4863, 0.0476, NULL, 0.013, 89.1257),
(1381, '蛋類', '鵪鶉皮蛋', '樣品狀態:鵪鶉蛋製品; 前處理描述:去殼,混合均勻打碎', '鳥蛋', 160.357, 13.8085, 10.891, 3.8766, 1.7759, NULL, 0, 790.655),
(1382, '蛋類', '鵪鶉鹹蛋', '樣品狀態:熟,鵪鶉蛋製品(鵪鶉蛋,鹽,香辛料,自來水等); 前處理描述:去殼,混合均勻打碎', '鳥蛋', 173.223, 13.73, 12.2926, 4.3971, 1.9173, NULL, 0.224, 1809.83),
(1383, '蛋類', '鵪鶉滷蛋', '樣品狀態:熟,鵪鶉蛋製品,真空包裝(鵪鶉蛋,醬油,糖,鹽,調味料等); 前處理描述:混合均勻打碎', '鳥蛋', 238.232, 16.197, 14.3321, 5.4326, 11.1139, NULL, 4.965, 314.792),
(1384, '蛋類', '鵪鶉鐵蛋', '樣品狀態:熟,鵪鶉蛋製品,真空包裝(鵪鶉蛋.蜂蜜.醬油等); 前處理描述:去殼,混合均勻打碎', '鳥蛋', 439.13, 28.82, 26.93, 9.8731, 20.37, NULL, NULL, 193.63),
(1385, '蛋類', '鴿蛋', '樣品狀態:生; 前處理描述:去殼,混合均質', '鳥蛋', 96.1596, 10.18, 5.74, 1.5309, 2.535, NULL, NULL, 142.99),
(1386, '蛋類', '鵝蛋', '樣品狀態:生; 前處理描述:去殼,混合均質', NULL, 178.81, 10, 14.99, 5.4877, 3.194, NULL, NULL, 133.7),
(1387, '乳品類', '高脂鮮乳', '樣品狀態:高脂(≧3.8%)鮮乳; 前處理描述:混合均勻', '牛乳,牛奶', 72.5358, 3.191, 3.9956, 2.7439, 6.147, NULL, 4.99, 38.82),
(1388, '乳品類', '全脂鮮乳平均值', '樣品狀態:全脂(3.0-3.8%)鮮乳; 前處理描述:混合均勻', '牛乳,牛奶', 63.1961, 3.112, 3.5829, 2.4696, 4.7582, 0, 4.4116, 37.4138),
(1389, '乳品類', '全脂鮮乳(1月取樣)', '樣品狀態:全脂(3.0-3.8%)鮮乳; 前處理描述:混合均勻', '牛乳,牛奶', 62.3801, 2.926, 3.61, 2.5154, 4.691, NULL, NULL, 39.77),
(1390, '乳品類', '全脂鮮乳(4月取樣)', '樣品狀態:全脂(3.0-3.8%)鮮乳; 前處理描述:混合均勻', '牛乳,牛奶', 61.798, 2.936, 3.5582, 2.54, 4.6472, NULL, 4.881, 34.59),
(1391, '乳品類', '全脂鮮乳(6月取樣)', '樣品狀態:全脂(3.0-3.8%)鮮乳; 前處理描述:混合均勻', '牛乳,牛奶', 62.6849, 3.187, 3.5687, 2.471, 4.5756, NULL, 3.986, 35.976),
(1392, '乳品類', '全脂鮮乳(9月取樣)', '樣品狀態:全脂(3.0-3.8%)鮮乳; 前處理描述:混合均勻', '牛乳,牛奶', 63.8406, 2.78, 3.5816, 2.4143, 5.294, NULL, 4.2965, 32.865),
(1393, '乳品類', '全脂鮮乳(10月取樣)', '樣品狀態:全脂(3.0-3.8%)鮮乳; 前處理描述:混合均勻', '牛乳,牛奶', 64.0486, 3.04, 3.7049, 2.5596, 4.7808, NULL, 4.4513, 35.7895),
(1394, '乳品類', '全脂鮮乳(11月取樣)', '樣品狀態:全脂(3.0-3.8%)鮮乳; 前處理描述:混合均勻', '牛乳,牛奶', 61.794, 3.075, 3.5, 2.4421, 4.625, NULL, NULL, 46.75),
(1395, '乳品類', '全脂鮮乳(12月取樣)', '樣品狀態:全脂(3.0-3.8%)鮮乳; 前處理描述:混合均勻', '牛乳,牛奶', 64.2362, 3.225, 3.435, 2.3593, 5.2382, NULL, NULL, 41.7),
(1396, '乳品類', '全脂鮮乳(7月取樣)', '樣品狀態:全脂(3.0-3.8%)鮮乳; 前處理描述:混合均勻', '牛乳,牛奶', 64.786, 3.727, 3.7047, 2.4508, 4.2138, 0, 4.443, 31.87),
(1397, '乳品類', '中脂鮮乳', '樣品狀態:中脂(1.5-3.0%)鮮乳; 前處理描述:混合均勻', '牛乳,牛奶', 48.4924, 3.1333, 1.8667, 1.3002, 4.8333, NULL, NULL, 46.3333),
(1398, '乳品類', '低脂鮮乳', '樣品狀態:低脂(0.5-1.5%)鮮乳; 前處理描述:混合均勻', '牛乳,牛奶', 42.611, 3.284, 1.0551, 0.7356, 4.9907, 0, 4.667, 28.186),
(1399, '乳品類', '高脂強化鮮乳(鈣強化)', '樣品狀態:高脂強化鮮乳(生乳,異麥芽寡糖,鹿角菜膠,碳酸鈣,維生素D3等); 前處理描述:混合均勻', '牛乳,牛奶', 68.0868, 3.156, 3.9352, 2.6706, 5.1732, NULL, 4.6, 36.113),
(1400, '乳品類', '高脂強化鮮乳(寡醣強化)', '樣品狀態:高脂強化鮮乳(生乳,寡醣等); 前處理描述:混合均勻', '牛乳,牛奶', 69.1527, 3.2, 4.08, 2.8522, 5.0712, NULL, NULL, 43.78),
(1401, '乳品類', '中脂強化鮮乳(脂肪酸調整)', '樣品狀態:中脂強化鮮乳; 前處理描述:混合均勻', '牛乳,牛奶', 59.3384, 2.02, 1.99, 1.3875, 8.5842, NULL, NULL, 36.54),
(1402, '乳品類', '低脂強化鮮乳(維生素E強化)', '樣品狀態:低脂強化鮮乳; 前處理描述:混合均勻', '牛乳,牛奶', 40.6785, 3, 1.3381, 0.966, 4.1619, NULL, 4.974, 43),
(1403, '乳品類', '低脂強化鮮乳(寡醣強化)', '樣品狀態:低脂強化鮮乳(生乳,寡糖等); 前處理描述:混合均勻', '牛乳,牛奶', 46.1904, 3.138, 1.3267, 0.901, 5.4598, NULL, 4.48, 32.902),
(1404, '乳品類', '脫脂強化鮮乳(鈣強化)', '樣品狀態:脫脂(<0.5%)強化鮮乳(脫脂生乳等); 前處理描述:混合均勻', '牛乳,牛奶', 42.1957, 3.53, 0.33, 0.2423, 6.2589, NULL, NULL, 49.21),
(1405, '乳品類', '脫脂強化鮮乳(寡醣強化)', '樣品狀態:脫脂(<0.5%)強化鮮乳(生乳,寡醣等); 前處理描述:混合均勻', '牛乳,牛奶', 36.4877, 3.1145, 0.3669, 0.2301, 5.1586, NULL, 4.6115, 32.7025),
(1406, '乳品類', '脫脂強化鮮乳(鐵強化)', '樣品狀態:脫脂(<0.5%)強化鮮乳; 前處理描述:混合均勻', '牛乳,牛奶', 40.8342, 4.15, 0.17, 0.11, 5.5864, NULL, NULL, 59.46),
(1407, '乳品類', '中脂調味乳(巧克力)', '樣品狀態:中脂調味乳(生乳,可可粉,水,砂糖,果糖,鹽,海藻酸鈉,鈣質等); 前處理描述:混合均勻', '牛乳,牛奶', 62.5491, 1.941, 1.9799, 1.3598, 9.2415, 0.79, 6.874, 29.8),
(1408, '乳品類', '中脂調味乳(多穀類)', '樣品狀態:中脂調味乳(生乳,大麥,杏仁豆,白芝麻,燕麥,糙米等); 前處理描述:混合均勻', '牛乳,牛奶', 67.4732, 2.39, 3.07, 2.0532, 7.5708, 1.1346, NULL, 44.61),
(1409, '乳品類', '中脂調味乳(果汁)', '樣品狀態:中脂(0.5-1.5%)調味乳; 前處理描述:混合均勻', '牛乳,牛奶', 54.2095, 1.6, 1.5619, 1.1714, 8.4381, NULL, 9.863, 39),
(1410, '乳品類', '中脂調味乳(鈣強化)', '樣品狀態:中脂(≧1.5%)調味乳; 前處理描述:混合均勻', '牛乳,牛奶', 67.99, 2.3, 2.558, 1.8439, 8.942, NULL, 4.137, 63),
(1411, '乳品類', '中脂調味乳(維生素強化)', '樣品狀態:中脂(≧1.5%)調味乳; 前處理描述:混合均勻', '牛乳,牛奶', 59.6305, 2, 1.9261, 1.3465, 8.5739, NULL, 7.091, 30),
(1412, '乳品類', '中脂調味乳(纖維&維生素E強化)', '樣品狀態:中脂(≧1.5%)調味乳; 前處理描述:混合均勻', '牛乳,牛奶', 65.7, 2.4, 2.1, 1.4532, 9.3, 0.3, NULL, 50),
(1413, '乳品類', '低脂調味乳(木瓜)', '樣品狀態:低脂(0.5-1.5%)調味乳; 前處理描述:混合均勻', '牛乳,牛奶', 60.9245, 1.8, 1.3049, 0.9254, 10.4951, NULL, 9.484, 58),
(1414, '乳品類', '高脂保久乳', '樣品狀態:高脂(≧3.8%)保久乳(生乳); 前處理描述:混合均勻', '牛乳,牛奶', 71.0198, 3.107, 5.0787, 3.4667, 3.3879, NULL, 4.573, 31.542),
(1415, '乳品類', '全脂保久乳', '樣品狀態:全脂(3.0-3.8%)保久乳; 前處理描述:混合均勻', '牛乳,牛奶', 61.9816, 2.954, 3.3772, 2.5599, 5.0859, NULL, 4.454, 54.795),
(1416, '乳品類', '中脂保久乳', '樣品狀態:中脂(1.5-3.0%)保久乳; 前處理描述:混合均勻', '牛乳,牛奶', 48.4554, 3.2265, 1.8185, 1.4116, 4.8304, NULL, 6.118, 52.245),
(1417, '乳品類', '低脂強化保久乳(寡糖強化)', '樣品狀態:低脂(0.5-1.5%)強化保久乳(生乳,寡糖等); 前處理描述:混合均勻', '牛乳,牛奶', 45.945, 3.204, 1.0465, 0.6953, 5.96, NULL, 4.755, 32.916),
(1418, '乳品類', '中脂調味保久乳(巧克力)', '樣品狀態:中脂調味保久乳(生乳,可可粉,砂糖,果糖,鹽,海藻酸鈉,鈣質等); 前處理描述:混合均勻', '牛乳,牛奶', 60.3041, 1.897, 1.7369, 1.2596, 9.271, 0.4841, 8.363, 33.765),
(1419, '乳品類', '中脂調味保久乳(布丁)', '樣品狀態:中脂調味保久乳; 前處理描述:混合均勻', '牛乳,牛奶', 60.9, 1.6, 1.7, 1.3263, 9.8, NULL, NULL, 51),
(1420, '乳品類', '全脂奶粉', '樣品狀態:全脂(26-42%)奶粉; 前處理描述:混合均勻', '乳粉', 504.156, 26.379, 28.2449, 19.2866, 37.0143, NULL, 36.408, 336.565),
(1421, '乳品類', '部份脫脂奶粉', '樣品狀態:部份脫脂(1.5-26%)奶粉; 前處理描述:混合均勻', '乳粉', 420.477, 32.8, 11.6101, 7.9845, 46.0899, NULL, 44.723, 352),
(1422, '乳品類', '部份脫脂奶粉(即溶)', '樣品狀態:部份脫脂(1.5-26%)奶粉; 前處理描述:混合均勻', '乳粉', 445.26, 23.664, 16.43, 12.4374, 51.6267, NULL, NULL, 303.38),
(1423, '乳品類', '部份脫脂低乳糖奶粉', '樣品狀態:部份脫脂(1.5-26%)低乳糖奶粉(低脂牛乳,大豆卵磷脂等); 前處理描述:混合均勻', '乳粉', 415.846, 34.63, 10.39, 7.6964, 45.6455, NULL, NULL, 401.45),
(1424, '乳品類', '脫脂奶粉', '樣品狀態:脫脂(<1.5%)奶粉; 前處理描述:混合均勻', '乳粉', 360.657, 36.214, 0.9139, 0.3516, 51.1603, NULL, 36.635, 337.655),
(1425, '乳品類', '脫脂奶粉(即溶)', '樣品狀態:脫脂(<1.5%)奶粉; 前處理描述:混合均勻', '乳粉', 359.724, 38, 0.9629, 0.6891, 48.8371, NULL, 34.151, 435),
(1426, '乳品類', '全脂強化奶粉(纖維強化)', '樣品狀態:全脂(26-42%)強化奶粉; 前處理描述:混合均勻', '乳粉', 499.507, 25.6, 27, 20.9574, 39.5, 3.2, NULL, 313),
(1427, '乳品類', '部份脫脂強化奶粉(鈣強化)', '樣品狀態:部份脫脂(1.5-26%)強化奶粉; 前處理描述:混合均勻', '乳粉', 407.968, 25.036, 11.7819, 7.9408, 51.0339, NULL, 44.483, 331.421),
(1428, '乳品類', '部份脫脂強化奶粉(纖維&DHA強化)', '樣品狀態:部份脫脂強化奶粉(奶粉,卵磷脂,菊芋粉,啤酒酵母,DHA等); 前處理描述:混合均勻', '乳粉', 475.935, 23.169, 22.07, 15.1492, 47.2889, 5.3639, NULL, 275.94),
(1429, '乳品類', '部份脫脂強化奶粉(纖維&鈣強化)', '樣品狀態:部份脫脂(1.5-26%)強化奶粉(部份脫脂奶粉,菊芋粉等); 前處理描述:混合均勻', '乳粉', 375.003, 35.923, 3.6776, 2.5922, 48.9109, 0.8304, 30.168, 412.32),
(1430, '乳品類', '部份脫脂強化奶粉(脂肪酸調整)', '樣品狀態:部份脫脂(1.5-26%)強化奶粉; 前處理描述:混合均勻', '乳粉', 481.064, 22.722, 23.48, 10.1991, 45.9049, NULL, NULL, 284.31),
(1431, '乳品類', '脫脂強化奶粉(抗氧化)', '樣品狀態:脫脂(<1.5%)強化奶粉(脫脂奶粉); 前處理描述:混合均勻', '乳粉', 365.904, 32.343, 1.01, 0.6729, 56.5688, 0.4127, NULL, 496.39),
(1432, '乳品類', '脫脂強化奶粉(鈣&維生素A強化)', '樣品狀態:脫脂(<1.5%)強化奶粉; 前處理描述:混合均勻', '乳粉', 360.033, 38, 1.0258, 0.7257, 48.7742, NULL, 33.777, 387),
(1433, '乳品類', '脫脂強化奶粉(鈣&維生素C,E強化)', '樣品狀態:脫脂(<1.5%)強化奶粉(脫脂牛奶,碳酸鈣,維生素等); 前處理描述:混合均勻', '乳粉', 360.221, 32.781, 0.6585, 0.4612, 55.4155, NULL, 17.506, 417.029),
(1434, '乳品類', '脫脂強化奶粉(鈣&鐵強化)', '樣品狀態:脫脂(<1.5%)強化奶粉(脫脂奶粉,維生素,礦物質等); 前處理描述:混合均勻', '乳粉', 360.238, 35.6, 0.6799, 0.4713, 52.2609, NULL, 33.235, 415.9),
(1435, '乳品類', '部份脫脂調味奶粉(巧克力)', '樣品狀態:部份脫脂調味奶粉(即溶全脂牛奶,即溶脫脂牛奶,蔗糖,葡萄糖等); 前處理描述:混合均勻', '乳粉', 405.799, 14.054, 6.8704, 4.878, 71.9373, 7.5693, 49.295, 139.077),
(1436, '乳品類', '部份脫脂調味奶粉(果汁)', '樣品狀態:部份脫脂(1.5-26%)調味奶粉(奶粉,乳糖,果汁粉等); 前處理描述:混合均勻', '乳粉', 435.297, 19.8, 12.2593, 9.2307, 61.4407, NULL, 56.943, 208),
(1437, '乳品類', '脫脂稀釋發酵乳', '樣品狀態:脫脂(<0.5%)稀釋發酵乳(生乳,乳酸菌等); 前處理描述:混合均勻', '活菌乳酸飲料', 68.0919, 1.0663, 0.0535, 0.0291, 15.8363, NULL, 14.786, 21.2265),
(1438, '乳品類', '脫脂稀釋發酵乳(鈣強化)', '樣品狀態:脫脂稀釋發酵乳(生乳,脫脂乳粉,蔗糖,果糖,聚糊精,乳酸鈣等); 前處理描述:混合均勻', '活菌乳酸飲料', 72.2203, 1.015, 0.0711, 0.0193, 16.8801, NULL, 15.154, 19.66),
(1439, '乳品類', '全脂濃稠發酵乳', '樣品狀態:全脂(3.0-3.8%)濃稠發酵乳(生乳,特砂,乳製品,水等); 前處理描述:混合均勻', '優酪乳', 90.1733, 4.06, 3.1889, 2.1059, 11.3083, NULL, 11.183, 52.261),
(1440, '乳品類', '中脂濃稠發酵乳', '樣品狀態:中脂濃稠發酵乳(生乳,脫脂奶粉,蔗糖,果膠,乳製品等); 前處理描述:混合均勻', '優酪乳', 82.2568, 2.873, 2.2792, 1.5957, 12.563, 0.8835, 9.066, 38.07),
(1441, '乳品類', '中脂濃稠發酵乳(無糖&纖維強化)', '樣品狀態:中脂(1.5-3.0%)濃稠發酵乳(生乳,膳食纖維,寡糖等); 前處理描述:混合均勻', '優酪乳', 74.3746, 3.163, 2.217, 1.4918, 10.4424, 0.6194, 3.233, 36.601),
(1442, '乳品類', '中脂濃稠發酵乳(草莓)', '樣品狀態:中脂濃稠發酵乳(生乳,砂糖,草莓果粒,草莓濃縮汁,果膠,香料等); 前處理描述:混合均勻', '優酪乳', 88.5982, 3.129, 2.687, 1.7586, 12.9748, 0.486, 10.828, 45.628),
(1443, '乳品類', '低脂濃稠發酵乳', '樣品狀態:低脂(0.5-1.5%)濃稠發酵乳(生乳,乳酸菌等); 前處理描述:混合均勻', '優酪乳', 73.3448, 2.3403, 1.07, 0.6685, 13.5884, NULL, 10.151, 30.247),
(1444, '乳品類', '脫脂濃稠發酵乳', '樣品狀態:脫脂濃稠發酵乳(生乳,脫脂乳粉,蔗糖,果糖,果膠,半乳糖寡糖等); 前處理描述:混合均勻', '優酪乳', 63.6955, 2.988, 0.3931, 0.2864, 12.0514, 0.2254, 10.1615, 25.8445),
(1445, '乳品類', '脫脂濃稠發酵乳(低熱量)', '樣品狀態:脫脂濃稠發酵乳(生乳,脫脂乳粉,蔗糖,果糖,麥芽糖,寡糖,果膠等); 前處理描述:混合均勻', '優酪乳', 36.967, 2.041, 0.119, 0.0496, 6.933, NULL, 5.274, 30.653),
(1446, '乳品類', '脫脂濃稠發酵乳(草莓)', '樣品狀態:脫脂(<0.5%)濃稠發酵乳(生乳,乳酸菌等); 前處理描述:混合均勻', '優酪乳', 67.938, 2.3, 0.3876, 0.2893, 13.8124, NULL, 10.427, 49),
(1447, '乳品類', '脫脂濃稠發酵乳(啤酒酵母)', '樣品狀態:脫脂濃稠發酵乳(生乳,脫脂乳粉,蔗糖,麥芽糖,寡糖,果膠,香料等); 前處理描述:混合均勻', '優酪乳', 34.4808, 2.113, 0.0636, 0.0443, 6.3641, NULL, 4.068, 27.659),
(1448, '乳品類', '高脂凝態發酵乳(纖維強化)', '樣品狀態:高脂凝態發酵乳(生乳,脫脂奶粉,糖,鮮奶油,乳清蛋白,果膠等); 前處理描述:混合均質', '優格', 94.6955, 3.207, 3.8007, 2.5963, 11.9153, 1.71, 10.401, 42.134),
(1449, '乳品類', '全脂凝態發酵乳', '樣品狀態:全脂(3.0-3.8%)凝態發酵乳(生乳,乳酸菌等); 前處理描述:混合均質', '優格', 97.2045, 3.148, 3.3461, 2.3119, 13.6244, NULL, 12.212, 68.8405),
(1450, '乳品類', '中脂凝態發酵乳(草莓)', '樣品狀態:中脂(1.5-3.0%)凝態發酵乳(生乳,乳酸菌等); 前處理描述:混合均質', '優格', 101.967, 3.7, 2.7135, 1.9798, 15.6865, NULL, 13.865, 58),
(1451, '乳品類', '中脂凝態發酵乳(蘆薈)', '樣品狀態:中脂凝態發酵乳(生乳,奶粉,蘆薈,砂糖,澱粉,蜂蜜,果膠等); 前處理描述:混合均質', '優格', 90.0091, 1.74, 2.5227, 1.685, 15.0862, 0.4065, 13.37, 37.624),
(1452, '乳品類', '脫脂凝態發酵乳(纖維強化)', '樣品狀態:脫脂凝態發酵乳(脫脂生乳,蔗糖,果糖,寒天紅藻,明膠等); 前處理描述:混合均質', '優格', 84.0967, 4.056, 0.4535, 0.3326, 15.9478, 0.0957, 10.911, 51.488),
(1453, '乳品類', '脫脂保久稀釋發酵乳', '樣品狀態:脫脂保久稀釋發酵乳(糖,脫脂奶粉,發酵乳,果膠,檸檬酸鈉等); 前處理描述:混合均勻', '乳酸飲料', 45.7419, 0.137, 0.1247, 0, 11.0179, NULL, 11.787, 28.484),
(1454, '乳品類', '脫脂保久濃稠發酵乳(草莓&蘋果)', '樣品狀態:脫脂(<0.5%)保久濃稠發酵乳(草莓+蘋果等); 前處理描述:混合均勻', '保久優酪乳', 68.2, 3, 0.2, 0.1416, 13.6, NULL, NULL, 57),
(1455, '乳品類', '淡煉乳', '前處理描述:混合均質(乳脂肪,蛋白質,乳糖等)', '蒸發乳,奶水', 137.1, 6.5, 8.3, 5.8523, 9.1, NULL, NULL, 187),
(1456, '乳品類', '加糖部份脫脂煉乳', '樣品狀態:部份脫脂(1~8%)(生乳,乳脂,蔗糖等); 前處理描述:混合均勻', NULL, 325.201, 7.506, 7.7991, 3.9475, 56.2462, NULL, 52.373, 88.375),
(1457, '乳品類', '切片乾酪', '前處理描述:混合均勻打碎(鮮牛奶,凝乳酶等)', '起司,芝士(市售亦稱\"乳酪\")', 309.258, 18.3195, 23.6949, 17.5141, 5.8799, NULL, 1.739, 1594.27),
(1458, '乳品類', '切片乾酪(低脂)', '前處理描述:混合均勻打碎', '起司,芝士(市售亦稱\"乳酪\")', 240.69, 21.678, 12.9989, 9.3761, 8.7505, NULL, 3.461, 1598.01),
(1459, '乳品類', '刨絲乾酪', '前處理描述:混合均勻打碎', '起司,芝士(市售亦稱\"乳酪\")', 323.046, 25.143, 22.584, 15.7606, 4.4371, NULL, 0.4, 548.31),
(1460, '乳品類', '乾酪粉', '前處理描述:混合均勻(牛乳,乾酪培養物,鹽,酵素等)', '起司粉,芝士粉(市售亦稱\"乳酪粉\")', 480.489, 40.397, 34.0383, 24.2327, 3.139, NULL, 0, 1543.18),
(1461, '乳品類', '鮮奶可可', '樣品狀態:現調飲料(巧克力粉,牛奶等); 前處理描述:混合均勻', '巧克力牛奶,阿華田拿鐵', 79.6755, 2.106, 2.7451, 1.8594, 11.6364, 1.1751, 9.012, 37.684),
(1462, '乳品類', '木瓜牛奶', '樣品狀態:現調飲料(水,木瓜,牛奶,糖等); 前處理描述:混合均勻', NULL, 42.4734, 1.653, 0.5778, 0.4013, 7.6653, 0.6549, 6.412, 9.287),
(1463, '乳品類', '高脂鮮羊乳', '樣品狀態:高脂(≧3.8%)鮮羊乳; 前處理描述:混合均勻', '羊奶', 65.2527, 3.37, 3.9501, 2.8734, 4.1709, NULL, 4.031, 37.2105),
(1464, '乳品類', '中脂鮮羊乳', '樣品狀態:中脂(1.5-3.0%)鮮羊乳; 前處理描述:混合均勻', '羊奶', 47.7281, 2.697, 2.41, 2.0738, 3.8832, NULL, NULL, 33.64),
(1465, '乳品類', '保久羊乳', '樣品狀態:保久羊乳(乳脂肪≧3%); 前處理描述:混合均勻', '羊奶', 58.8631, 2.9535, 3.2627, 2.3755, 4.5407, NULL, 2.971, 46.3995),
(1466, '乳品類', '中脂調味保久羊乳(巧克力)', '樣品狀態:中脂(≧1.5%)調味保久羊乳(水,羊奶粉,糖,巧克力香料等); 前處理描述:混合均勻', '羊奶', 58.6278, 1.1, 1.461, 0.921, 10.2697, NULL, 9.74, 29.282),
(1467, '乳品類', '中脂調味保久羊乳(果汁)', '樣品狀態:中脂(≧1.5%)調味保久羊乳(羊奶,果汁等); 前處理描述:混合均勻', '羊奶', 75.2946, 2.94, 2.8338, 2.058, 9.5076, NULL, 6.654, 40.98),
(1468, '乳品類', '全脂羊奶粉', '樣品狀態:全脂(≧26%)羊奶粉; 前處理描述:混合均勻', '羊乳粉', 510.414, 26.7, 29.7568, 21.3892, 34.8432, NULL, 28.822, 232),
(1469, '乳品類', '全脂羊奶粉(即溶)', '樣品狀態:全脂(≧1.5%)羊奶粉(全脂羊奶粉,卵磷脂等); 前處理描述:混合均勻', '羊乳粉', 517.372, 25.901, 30.8219, 18.7992, 35.1033, NULL, 29.69, 225.03),
(1470, '油脂類', '牛油(未精煉)', '前處理描述:混合均勻', NULL, 642.335, 0, 71.93, 30.9986, 4.2429, NULL, NULL, NULL),
(1471, '油脂類', '牛油(精煉)', '前處理描述:混合均勻(純牛油精煉)', NULL, 885.276, 0.043, 99.1351, 48.8597, 0.5643, NULL, NULL, 2.71),
(1472, '油脂類', '豬油', '前處理描述:混合均勻(純豬油)', NULL, 889.919, 0, 99.655, 39.5786, 0, NULL, NULL, NULL),
(1473, '油脂類', '豬油(2022年取樣)', '前處理描述:混合均勻(純豬油)', NULL, 891.661, 0, 99.85, 38.172, 0, 0, 0, 1.36),
(1474, '油脂類', '高油酸豬油', '前處理描述:混合均勻(高油酸豬油)', NULL, 893, 0, 100, 25.98, 0, NULL, NULL, NULL),
(1475, '油脂類', '雞油', '前處理描述:取雞脂肪,以小火煎炸而得,混合均勻', NULL, 890.812, 0, 99.755, 32.5097, 0, NULL, NULL, NULL),
(1476, '油脂類', '奶油(固態,不加鹽)', '前處理描述:混合均質(乳脂,水,非脂乳固形物等)', '動物性奶油(CNS命名\"乳酪\")', 733.026, 0.606, 82.7195, 57.3321, 0.8615, NULL, 0.858, 5.897),
(1477, '油脂類', '奶油(固態,加鹽)', '前處理描述:混合均質(乳脂,鹽分,凝乳等)', '動物性奶油(CNS命名\"乳酪\")', 698.877, 0.6715, 77.5336, 55.2369, 3.7439, NULL, 0, 624.227),
(1478, '油脂類', '奶油(液態)', '前處理描述:混合均勻(乳脂,非乳脂固形物,食品添加物等)', '動物性奶油,鮮奶油(CNS命名\"乳油\")', 339.975, 1.998, 39.1051, 27.0764, 0, NULL, 3.225, 24.413),
(1479, '油脂類', '人造奶油(維生素強化)', '樣品狀態:全脂(60~80%)人造奶油(植物油,鹽,維生素E,胡蘿蔔素等); 前處理描述:混合均質', '植物性奶油', 725.068, 0.084, 82.0213, 52.8168, 0, NULL, 0, 804.418),
(1480, '油脂類', '人造奶油(2021年取樣)', '樣品狀態:食用油脂(棕櫚油,無水奶油,大豆油,硬質棕油),食鹽等; 前處理描述:混合均質', '乳瑪琳', 722.117, 0.086, 81.6875, 43.3987, 1.6846, 0, 0.158, 552.8),
(1481, '油脂類', '中脂人造奶油', '樣品狀態:中脂(60~80%)人造奶油(黃豆卵磷脂,氫化植物油等); 前處理描述:混合均質', '植物性奶油', 673.785, 0.01, 76.22, 43.0379, 1.3, NULL, NULL, 883.22),
(1482, '油脂類', '人造奶油(低熱量)', '前處理描述:混合均勻(玉米油,明膠,鹽,乳化劑,香料等)', NULL, 93.9692, 2.508, 10.63, 2.283, 29.5627, NULL, NULL, 475.93),
(1483, '油脂類', '大豆油', '前處理描述:混合均勻(100%大豆沙拉油)', '黃豆油,沙拉油', 883.889, 0, 99.9874, 16.1027, 0, NULL, NULL, NULL),
(1484, '油脂類', '大豆油(卵磷脂強化)', '前處理描述:混合均勻(大豆油,大豆卵磷脂)', NULL, 880.11, 0, 99.56, 15.6543, 0, NULL, NULL, NULL),
(1485, '油脂類', '大豆油(多種維生素強化)', '前處理描述:混合均勻(維生素強化大豆油)', '沙拉油', 883.116, 0, 99.9, 15.5345, 0, NULL, NULL, NULL),
(1486, '油脂類', '玉米油', '前處理描述:混合均勻(純玉米胚芽提煉)', '粟米油,玉米胚芽油', 882.562, 0.015, 99.8373, 14.7821, 0.1058, NULL, NULL, NULL),
(1487, '油脂類', '米油(秈米)', '前處理描述:混合均勻', '米糠油,玄米油,胚芽米油', 883.484, 0.076, 99.9416, 24.1024, 0, NULL, NULL, NULL),
(1488, '油脂類', '米油(粳米)', '前處理描述:混合均勻', '米糠油,玄米油,胚芽米油', 883.116, 0, 99.9, 20.0669, 0.003, NULL, NULL, NULL),
(1489, '油脂類', '亞麻仁油', '前處理描述:混合均勻(有機冷壓亞麻籽油)', NULL, 820.437, 0.171, 92.8096, 9.6977, 6.8532, NULL, NULL, NULL),
(1490, '油脂類', '白芝麻油', '前處理描述:混合均勻', NULL, 883.652, 0.09, 99.9606, 16.8714, 0, NULL, NULL, NULL),
(1491, '油脂類', '黑芝麻油', '前處理描述:混合均勻(純芝麻提煉而成)', NULL, 881.016, 0.086, 99.6625, 16.5286, 0.1765, NULL, NULL, NULL),
(1492, '油脂類', '調合芝麻油', '前處理描述:混合均勻', NULL, 883.805, 0.065, 99.9779, 16.1604, 0, NULL, NULL, NULL),
(1493, '油脂類', '花生油', '前處理描述:混合均勻(純花生油)', NULL, 883.116, 0, 99.9, 20.7792, 0, NULL, NULL, NULL),
(1494, '油脂類', '調合花生油', '前處理描述:混合均勻(花生油,芝麻油,玉米胚芽油,沙拉油等)', NULL, 883.6, 0.023, 99.9548, 19.4022, 0, NULL, NULL, NULL),
(1495, '油脂類', '油菜籽油', '前處理描述:混合均勻', NULL, 883.116, 0, 99.9, 6.3549, 0.024, NULL, NULL, NULL),
(1496, '油脂類', '芥花油', '前處理描述:混合均勻', '芥花籽油,菜籽油', 883.044, 0.0107, 99.8918, 9.7029, 0, NULL, NULL, 1.701),
(1497, '油脂類', '南瓜籽油', '前處理描述:混合均勻', NULL, 883.116, 0, 99.9, 17.9425, 0.02, NULL, NULL, NULL),
(1498, '油脂類', '紅花籽油', '前處理描述:混合均勻(純紅花籽提煉)', NULL, 883.558, 0, 99.95, 10.5973, 0, NULL, NULL, NULL),
(1499, '油脂類', '高油酸紅花籽油', '前處理描述:混合均勻', NULL, 880.166, 0.0165, 99.5663, 8.3636, 0.3872, NULL, NULL, NULL),
(1500, '油脂類', '核桃油', '前處理描述:混合均勻', NULL, 883.116, 0, 99.9, 10.3954, 0.0223, NULL, NULL, NULL),
(1501, '油脂類', '油茶油', '前處理描述:混合均勻(油茶籽提煉)', '苦茶(籽)油,山茶油,天綠果油,大果種油茶油', 883.355, 0, 99.927, 11.0595, 0, NULL, NULL, 0.759),
(1502, '油脂類', '熟油茶油', '前處理描述:混合均勻(油茶籽提煉)', '苦茶(籽)油,山茶油,天綠果油,大果種油茶油', 883.116, 0, 99.9, 20.6164, 0.02, NULL, NULL, NULL),
(1503, '油脂類', '高油酸棕櫚油', '前處理描述:混合均勻(高油酸棕櫚果實油提煉)', NULL, 883.116, 0, 99.9, 35.4245, 0, NULL, NULL, NULL),
(1504, '油脂類', '椰子油', '前處理描述:混合均勻(純椰子油精煉)', NULL, 882.762, 0, 99.86, 90.0637, 0, NULL, NULL, NULL),
(1505, '油脂類', '葵花籽油', '前處理描述:混合均勻(100%純正葵花油)', NULL, 883.579, 0, 99.9524, 11.604, 0, NULL, NULL, NULL),
(1506, '油脂類', '葵花籽油(多種維生素強化)', '前處理描述:混合均勻(維生素強化葵花籽油)', NULL, 883.028, 0, 99.89, 11.8554, 0.0134, NULL, NULL, NULL),
(1507, '油脂類', '高油酸葵花籽油', '前處理描述:混合均勻(葵花油精煉而成)', NULL, 883.116, 0, 99.9, 10.241, 0.01, NULL, NULL, NULL),
(1508, '油脂類', '葡萄籽油', '前處理描述:混合均勻(葡萄籽油精煉)', NULL, 883.767, 0, 99.9736, 11.3685, 0, NULL, NULL, NULL),
(1509, '油脂類', '橄欖油', '前處理描述:混合均勻(100%橄欖油)', NULL, 883.591, 0, 99.9537, 16.2839, 0, NULL, NULL, NULL),
(1510, '油脂類', '烤酥油', '前處理描述:混合均勻(純大豆提煉,含抗氧化劑 TBHQ等)', NULL, 882.92, 0.0195, 99.8778, 14.3145, 0, NULL, NULL, NULL),
(1511, '油脂類', '調合植物油', '前處理描述:混合均勻(米油,紅花籽油,葵花油及橄欖油混合而成)', '蔬菜油', 886.656, 0.028, 100.3, 16.9623, 0, NULL, NULL, NULL),
(1512, '油脂類', '中鏈脂肪酸油', '前處理描述:混合均勻(90%以上之中鏈脂肪酸)', NULL, 883.116, 0, 99.9, 99.8201, 0, NULL, NULL, NULL),
(1513, '糖類', '方糖', '前處理描述:混合均勻打碎(純糖)', NULL, 385.462, NULL, NULL, NULL, 99.6027, NULL, NULL, 1.67),
(1514, '糖類', '冰糖', '前處理描述:混合均勻打碎(蔗糖提煉,自然提煉)', NULL, 386.642, NULL, NULL, NULL, 99.9075, NULL, 99.91, 0.605),
(1515, '糖類', '紅砂糖', '前處理描述:混合均勻', '紅糖', 384.473, 0, 0.543, 0, 99.3471, 0, 96.298, 1.145),
(1516, '糖類', '黑砂糖', '前處理描述:混合均勻', '黑糖', 368.91, 0.519, 0.6695, 0.2583, 95.3255, 0.1547, 86.07, 10.424),
(1517, '糖類', '麥芽糖', '前處理描述:混合均勻', NULL, 325.371, NULL, NULL, NULL, 84.0753, NULL, 35.996, 0),
(1518, '糖類', '果糖', '前處理描述:混合均勻(高果糖糖漿)', '高果糖糖漿', 297.42, NULL, NULL, NULL, 76.8527, NULL, 67.368, 0),
(1519, '糖類', '果寡糖', '前處理描述:混合均勻(果寡糖,蔗糖,葡萄糖,麥芽糖,果糖等)', NULL, 299.793, NULL, NULL, NULL, 77.4659, NULL, 68.182, 0.46),
(1520, '糖類', '楓糖', '前處理描述:混合均勻', NULL, 257.841, 0.055, 0.1, NULL, 66.6257, NULL, NULL, 1.43),
(1521, '糖類', '蜂蜜(冬蜜)', '樣品狀態:冬蜜(油菜花蜜); 前處理描述:混合均勻', NULL, 315.211, 0.12, 0.11, NULL, 81.45, NULL, NULL, NULL),
(1522, '糖類', '蜂蜜(春蜜)', '樣品狀態:春蜜(龍眼花蜜,荔枝花蜜); 前處理描述:混合均勻', NULL, 308.16, 0.182, 0.2, NULL, 79.628, NULL, 61.452, NULL),
(1523, '糖類', '黑糖蜜', '樣品狀態:沖繩產黑糖(甘蔗糖蜜,麥芽糖,甘蔗原糖等); 前處理描述:混合均勻', NULL, 280.34, 0.231, 0, 0, 72.4393, 0.2009, 58.341, 2.152),
(1524, '糖類', '冬瓜糖磚', '樣品狀態:冬瓜糖(冬瓜,砂糖等); 前處理描述:混合均勻打碎', NULL, 360.254, NULL, NULL, NULL, 93.0889, 0.1911, 96.258, 17.697),
(1525, '飲料類', '西瓜汁(非原汁)', '樣品狀態:現調飲料(水,西瓜汁,糖等); 前處理描述:混合均勻', NULL, 29.91, 1.105, 0.1188, NULL, 6.1052, 0.095, 9.948, 1.201),
(1526, '飲料類', '芭樂汁(非原汁)', '樣品狀態:瓶裝; 前處理描述:混合均勻均質', NULL, 45.07, 0.15, 0.07, NULL, 10.96, 0.05, NULL, 24),
(1527, '飲料類', '柳橙汁(非原汁)', '樣品狀態:瓶裝; 前處理描述:混合均勻均質', NULL, 50.22, 0.11, 0.06, NULL, 12.31, 0.016, NULL, 22),
(1528, '飲料類', '柳橙汁(100%)', '樣品狀態:冷藏產品; 前處理描述:混合均勻均質', NULL, 47.6488, 0.571, 0.3008, 0.1851, 10.6644, 0.2973, 7.852, 7.82),
(1529, '飲料類', '烏梅汁', '樣品狀態:瓶裝(烏梅,山楂,洛神,陳皮,甘草,糖,桂花,檸檬酸等); 前處理描述:混合均勻', NULL, 57.7954, 0.259, 0.163, 0, 13.8231, 0.2189, 14.15, 9.639),
(1530, '飲料類', '黑棗茶', '樣品狀態:瓶裝(黑棗,烏梅,砂糖等); 前處理描述:混合均勻', NULL, 46.4, 0, NULL, NULL, 11.6, 0, NULL, 3.41),
(1531, '飲料類', '楊桃汁(非原汁)', '樣品狀態:瓶裝; 前處理描述:混合均勻', NULL, 48.54, 0.04, 0.06, NULL, 11.96, 0.08, NULL, 149),
(1532, '飲料類', '葡萄柚汁(非原汁)', '樣品狀態:瓶裝; 前處理描述:混合均勻', NULL, 41.33, 0.21, 0.21, NULL, 9.65, 0.49, NULL, 24),
(1533, '飲料類', '鳳梨汁(非原汁)', '樣品狀態:瓶裝; 前處理描述:混合均勻', NULL, 47.61, 0.26, 0.17, NULL, 11.26, 0.18, NULL, 33),
(1534, '飲料類', '蔓越莓汁(非原汁)', '樣品狀態:室溫產品(果汁含量12%,12%,27%,60%); 前處理描述:混合均勻', NULL, 44.8998, 0.927, 0.113, 0.0379, 10.0437, 0.0194, 10.078, 9.02),
(1535, '飲料類', '檸檬汁(非原汁)', '樣品狀態:現調飲料(水,檸檬汁,糖等); 前處理描述:混合均勻', NULL, 32.65, 0.789, 0.1372, NULL, 7.0648, 0.0627, 10.591, 0.643),
(1536, '飲料類', '蘋果汁(非原汁)', '樣品狀態:瓶裝; 前處理描述:混合均勻', NULL, 46.96, 0.06, 0.36, NULL, 10.87, 0.006, NULL, 14),
(1537, '飲料類', '蘋果汁(100%)', '樣品狀態:室溫產品; 前處理描述:混合均勻', NULL, 51.0751, 0.12, 0.2015, 0.0618, 12.1954, 0.0594, 11.139, 1.32),
(1538, '飲料類', '蕃茄汁(非原汁)', '樣品狀態:瓶裝; 前處理描述:混合均勻均質', NULL, 22.39, 0.74, 0.19, NULL, 4.43, 0.34, NULL, 98),
(1539, '飲料類', '仙草蜜', '樣品狀態:罐裝(仙草,蜂蜜等); 前處理描述:混合均質', NULL, 35.2, 0, 0, NULL, 8.8, 0.1, NULL, 48),
(1540, '飲料類', '薑母茶', '樣品狀態:罐裝(薑汁,蔗糖,食鹽等); 前處理描述:混合均質', NULL, 28.04, NULL, NULL, NULL, 7.01, 0, NULL, 26.17),
(1541, '飲料類', '蘆薈露飲料', '樣品狀態:罐裝(維生素C,蘆薈汁等); 前處理描述:混合均勻', NULL, 43.56, 0, NULL, NULL, 10.89, 0.1, NULL, 8.33),
(1542, '飲料類', '黑豆茶', '樣品狀態:罐裝(黑豆,決明子,蔗糖等); 前處理描述:混合均勻', NULL, 12.754, NULL, NULL, NULL, 3.1885, NULL, NULL, 3.23),
(1543, '飲料類', '龜苓茶', '樣品狀態:罐裝(龜苓糕粉,蜂蜜等); 前處理描述:混合均質', NULL, 33.0144, 0, 0, NULL, 8.2536, 0, NULL, 17.84),
(1544, '飲料類', '麥茶', '樣品狀態:罐裝(大麥抽出液,砂糖等); 前處理描述:混合均勻', NULL, 17.76, NULL, NULL, NULL, 4.44, NULL, NULL, 17.96),
(1545, '飲料類', '黑麥汁', '樣品狀態:罐裝(全穀黑麥,葡萄糖,酵母,糖,檸檬酸鈉,維生素C等); 前處理描述:混合均勻', NULL, 51.9318, 0.322, 0.0078, 0.002, 12.6434, 0.0515, 10.662, 5.661),
(1546, '飲料類', '果汁醋飲料(綜合)', '樣品狀態:瓶裝(梅子,蘋果,水蜜桃,葡萄柚,楊桃等健康醋等); 前處理描述:混合均勻', NULL, 37.25, NULL, NULL, NULL, 9.3125, 0, NULL, 42.38),
(1547, '飲料類', '可樂', '樣品狀態:罐裝(碳酸水.咖啡因.糖等); 前處理描述:混合圴勻', NULL, 51.36, NULL, NULL, NULL, 12.84, 0, NULL, 6.62),
(1548, '飲料類', '可樂(低熱量)', '樣品狀態:罐裝(碳酸水.咖啡因.焦糖等); 前處理描述:混合均勻', NULL, 1.32, NULL, NULL, NULL, 0.33, 0, NULL, 9.62),
(1549, '飲料類', '沙士', '樣品狀態:罐裝(碳酸水,蔗糖,檸檬酸等); 前處理描述:混合均勻', NULL, 36.68, NULL, NULL, NULL, 9.17, 0, NULL, 4.65),
(1550, '飲料類', '加鹽沙士', '樣品狀態:罐裝(碳酸水,糖,高果糖糖漿,焦糖,檸檬酸,鹽,減鈉鹽等); 前處理描述:混合均勻', NULL, 40.756, 0.834, 0, 0, 9.355, NULL, 9.48, 17.296),
(1551, '飲料類', '沙士(低糖)', '樣品狀態:罐瓶(碳酸水,高果糖糖漿,阿斯巴甜等); 前處理描述:混合均勻', NULL, 43.4148, 0, 0, NULL, 10.8537, NULL, NULL, NULL),
(1552, '飲料類', '汽水(綜合口味)', '樣品狀態:罐裝(碳酸水.糖.香料等); 前處理描述:混合均勻', NULL, 42.34, NULL, NULL, NULL, 10.585, 0, NULL, 7.99),
(1553, '飲料類', '汽水(維生素強化)', '樣品狀態:罐裝(胡蘿蔔素,維生素B2等); 前處理描述:混合均勻', NULL, 45.88, NULL, NULL, NULL, 11.47, 0, NULL, 10.01),
(1554, '飲料類', '美式咖啡(無糖)', '樣品狀態:現調飲料; 前處理描述:混合均勻', NULL, 2.3671, 0.209, 0.0587, 0.0298, 0.2507, NULL, 0, 1.689),
(1555, '飲料類', '無糖咖啡飲料', '樣品狀態:罐裝; 前處理描述:混合均勻', NULL, 3.7584, 0.226, 0.0944, 0.0486, 0.5012, 0.0362, 0, 15.62),
(1556, '飲料類', '拿鐵咖啡(無糖)', '樣品狀態:現調飲料(咖啡,牛奶等); 前處理描述:混合均勻', '咖啡牛奶', 42.9532, 2.981, 1.9528, 1.3185, 3.3635, NULL, 2.957, 28.284);
INSERT INTO `nutrition_facts` (`id`, `food_category`, `sample_name`, `content_description`, `alias`, `kcal`, `protein`, `fat`, `saturated_fat`, `carbohydrate`, `fiber`, `total_sugar`, `sodium`) VALUES
(1557, '飲料類', '咖啡(三合一)', '樣品狀態:瓶裝(咖啡,牛奶,蔗糖,乳化劑等); 前處理描述:混合均勻', '咖啡牛奶', 39.39, 0.881, 0.35, NULL, 8.179, 0, NULL, 25.13),
(1558, '飲料類', '紅茶茶湯', '前處理描述:每茶袋以約90℃自來水240mL浸泡4分鐘,取湯汁混合均勻', NULL, 0.1376, 0.057, NULL, NULL, 0, 0, NULL, NULL),
(1559, '飲料類', '紅茶(大麥)', '樣品狀態:瓶裝(紅茶,大麥,糖等); 前處理描述:混合均勻', NULL, 34.432, 0, NULL, NULL, 8.608, 0, NULL, 7.78),
(1560, '飲料類', '紅茶(蘋果)', '樣品狀態:罐裝(紅茶,砂糖等); 前處理描述:混合均勻', '水果茶', 36.68, 0, NULL, NULL, 9.17, 0, NULL, 5.49),
(1561, '飲料類', '烏龍茶茶湯', '前處理描述:每茶袋以約90℃自來水240mL浸泡四分鐘,取湯汁混合均勻', NULL, 0.0812, 0, NULL, NULL, 0.0203, 0, NULL, NULL),
(1562, '飲料類', '烏龍茶', '樣品狀態:瓶裝(烏龍茶,維生素C等); 前處理描述:混合均勻', NULL, 0.4, 0.05, NULL, NULL, 0.05, 0, NULL, 7.17),
(1563, '飲料類', '烏龍茶(去冰,微糖)', '樣品狀態:現調飲料(大杯,約700 mL); 前處理描述:混合均勻', NULL, 15.5005, 0.0708, 0.0121, NULL, 3.7771, NULL, 3.5579, NULL),
(1564, '飲料類', '烏龍茶(去冰,半糖)', '樣品狀態:現調飲料(大杯,約700 mL); 前處理描述:混合均勻', NULL, 21.0873, 0.0633, 0.0029, NULL, 5.202, NULL, 4.9109, NULL),
(1565, '飲料類', '烏龍茶(去冰,全糖)', '樣品狀態:現調飲料(大杯,約700 mL); 前處理描述:混合均勻', NULL, 35.6678, 0.0633, 0.0114, NULL, 8.828, NULL, 8.1667, NULL),
(1566, '飲料類', '綠茶茶湯', '前處理描述:每茶袋以約90℃自來水240mL浸泡4分鐘,取湯汁混合均勻', NULL, 0.3648, 0.053, NULL, NULL, 0.0382, 0, NULL, NULL),
(1567, '飲料類', '綠茶', '樣品狀態:瓶裝(綠茶,糖,維生素C等); 前處理描述:混合均勻', NULL, 21.52, 0, NULL, NULL, 5.38, 0, NULL, 8.96),
(1568, '飲料類', '鮮奶茶(無糖)', '樣品狀態:現調飲料(紅茶,牛奶等); 前處理描述:混合均勻', '紅茶拿鐵', 26.5077, 2.018, 1.4317, 0.9615, 1.3876, NULL, 1.811, 11.872),
(1569, '飲料類', '奶茶(三合一)', '樣品狀態:瓶裝(紅茶,牛奶,糖等); 前處理描述:混合均勻', NULL, 41.97, 0.458, 0.25, 0.1945, 9.472, 0, NULL, 18.04),
(1570, '飲料類', '烏龍奶茶(去冰,微糖)', '樣品狀態:現調飲料(大杯,約700 mL); 前處理描述:混合均勻', NULL, 59.3231, 0.2473, 2.8983, NULL, 8.0623, NULL, 3.7811, NULL),
(1571, '飲料類', '烏龍奶茶(去冰,半糖)', '樣品狀態:現調飲料(大杯,約700 mL); 前處理描述:混合均勻', NULL, 62.3074, 0.241, 2.5606, NULL, 9.5745, NULL, 4.7131, NULL),
(1572, '飲料類', '烏龍奶茶(去冰,全糖)', '樣品狀態:現調飲料(大杯,約700 mL); 前處理描述:混合均勻', NULL, 74.7962, 0.2348, 2.755, NULL, 12.2655, NULL, 8.5539, NULL),
(1573, '飲料類', '珍珠奶茶(去冰,微糖)', '樣品狀態:現調飲料(大杯,約700 mL); 前處理描述:混合均勻打碎,取上層澄清液分析', NULL, 75.3154, 0.2323, 2.2518, NULL, 13.53, NULL, 5.5655, NULL),
(1574, '飲料類', '珍珠奶茶(去冰,半糖)', '樣品狀態:現調飲料(大杯,約700 mL); 前處理描述:混合均勻打碎,取上層澄清液分析', NULL, 83.5089, 0.2488, 2.7301, NULL, 14.4857, NULL, 6.4453, NULL),
(1575, '飲料類', '珍珠奶茶(去冰,全糖)', '樣品狀態:現調飲料(大杯,約700 mL); 前處理描述:混合均勻打碎,取上層澄清液分析', NULL, 94.0235, 0.2423, 2.3875, NULL, 17.8917, NULL, 8.8251, NULL),
(1576, '飲料類', '奶茶沖泡包(三合一)', '樣品狀態:沖泡包(蔗糖,奶精,紅茶等); 前處理描述:混合均勻', NULL, 451.933, 1.724, 12.85, 12.4715, 82.3467, NULL, NULL, 244.55),
(1577, '飲料類', '茉莉花茶湯', '前處理描述:每茶袋以約90℃自來水240mL浸泡4分鐘,取湯汁混合均勻', '香片', 0.2524, 0.064, NULL, NULL, 0, 0, NULL, NULL),
(1578, '飲料類', '茉莉花茶', '樣品狀態:瓶裝(茉莉花,茶葉等); 前處理描述:混合均勻', NULL, 28.48, 0.056, NULL, NULL, 7.064, 0, NULL, 19.06),
(1579, '飲料類', '菊花茶', '樣品狀態:瓶裝(菊花抽取液等); 前處理描述:混合均勻', NULL, 29.64, 0, NULL, NULL, 7.41, 0, NULL, 17.17),
(1580, '飲料類', '多多綠茶(全糖)', '樣品狀態:現調飲料(綠茶,發酵乳,糖等); 前處理描述:混合均勻', NULL, 49.019, 1.059, 0.0882, NULL, 10.9973, NULL, 10.207, 10.081),
(1581, '飲料類', '冬瓜茶', '樣品狀態:罐裝(冬瓜,糖,檸檬酸等); 前處理描述:混合均勻', NULL, 33.04, 0, NULL, NULL, 8.26, 0, NULL, 15.75),
(1582, '飲料類', '乳酸飲料', '樣品狀態:瓶裝(乳酸鈣,奶粉,維生素C等); 前處理描述:混合均勻', NULL, 44.68, 0.22, 0, NULL, 10.95, 0, NULL, 19.99),
(1583, '飲料類', '維生素強化飲料(胡蘿蔔素)', '樣品狀態:瓶裝(含胡蘿蔔素,維生素E及C等); 前處理描述:混合均勻', NULL, 39.4, 0, NULL, NULL, 9.85, 0, NULL, 7.88),
(1584, '飲料類', '維生素強化飲料(綜合)', '樣品狀態:瓶裝(水,維生素等); 前處理描述:混合均勻', NULL, 54.12, 0.15, NULL, NULL, 13.38, 0, NULL, 38.37),
(1585, '飲料類', '維生素強化飲料(維生素C)', '樣品狀態:瓶裝(維生素C,B2及菸鹼酸等); 前處理描述:混合均勻', NULL, 57.04, NULL, NULL, NULL, 14.26, 0, NULL, 1.88),
(1586, '飲料類', '運動飲料', '樣品狀態:瓶裝(含維生素C及礦物質Na,K,Ca,Mg等); 前處理描述:混合均勻', NULL, 28.44, 0.08, NULL, NULL, 7.03, 0, NULL, 41.08),
(1587, '飲料類', '米醋飲料', '樣品狀態:瓶裝(純釀造米醋,人參抽出液等); 前處理描述:混合均勻', NULL, 52.16, NULL, NULL, NULL, 13.04, 0, NULL, 63.08),
(1588, '飲料類', '即溶咖啡粉', '樣品狀態:瓶裝; 前處理描述:混合均勻', NULL, 362.697, 16.612, 1.27, 0.538, 71.2048, 22.1764, NULL, 86.46),
(1589, '飲料類', '咖啡沖泡包(二合一)', '樣品狀態:沖泡包(奶精,咖啡粉,奶粉,鹽,食品添加物等); 前處理描述:混合均勻', NULL, 491.06, 6.75, 23.2925, 20.9143, 63.607, 6.6319, 9.006, 100.04),
(1590, '飲料類', '咖啡沖泡包(三合一)', '樣品狀態:沖泡包(糖,奶精,咖啡等); 前處理描述:混合均勻', NULL, 436.635, 4.843, 9.48, 9.3678, 82.9857, NULL, NULL, 43.18),
(1591, '飲料類', '紅茶沖泡包(檸檬)', '樣品狀態:沖泡包(蔗糖,紅茶等); 前處理描述:混合均勻', NULL, 397.907, NULL, NULL, NULL, 99.4767, 0.3544, NULL, 5.5),
(1592, '飲料類', '薑茶沖泡包', '樣品狀態:沖泡包(薑粉,糖等); 前處理描述:混合均勻磨碎', NULL, 398.565, 0.3, 0.29, 0.0671, 98.6888, 0, NULL, 13.84),
(1593, '飲料類', '抹茶粉', '樣品狀態:鋁箔袋裝; 前處理描述:混合均勻', '綠茶粉', 361.003, 23.422, 6.4335, 2.8664, 63.0227, 34.657, 4.624, 3.51),
(1594, '飲料類', '可可粉', '樣品狀態:罐裝; 前處理描述:混合均勻', NULL, 463.916, 20.751, 22.84, 14.6941, 43.838, 24.6694, NULL, 25.6),
(1595, '飲料類', '小麥草粉', '前處理描述:混合均勻', '小麥苗粉', 370.116, 33.992, 7.3994, 1.8317, 41.8883, 36.5569, 1.917, 7.91),
(1596, '飲料類', '椰奶', '樣品狀態:冷藏與室溫產品; 前處理描述:混合均勻', NULL, 48.9899, 0.215, 2.0791, 1.9811, 7.3545, 0.0367, 4.987, 19.02),
(1597, '調味料及香辛料類', '八角', '前處理描述:混合均勻打碎', '大茴,茴香', 359.667, 4.92, 3.86, 1.1656, 76.2375, 55.8247, NULL, 18.54),
(1598, '調味料及香辛料類', '小茴香粉', '前處理描述:混合均勻', '孜然粉', 411.488, 19.537, 25.8078, 1.4736, 36.9974, 36.6102, 1.326, 240.936),
(1599, '調味料及香辛料類', '山葵粉', '前處理描述:混合均勻(天然山葵,澱粉,芥子,色素等)', NULL, 386.588, 10.08, 6.06, 0.403, 72.9319, 13.504, NULL, 12.51),
(1600, '調味料及香辛料類', '五香粉', '前處理描述:混合均勻(丁香,大茴,桂智,小茴,甘草等)', NULL, 362.691, 8.73, 8.89, 1.4561, 68.0537, 49.6402, NULL, 98.07),
(1601, '調味料及香辛料類', '甘草粉', '前處理描述:混合均勻', NULL, 340.796, 9.22, 3.61, 1.255, 73.4421, 40.1274, NULL, 108.94),
(1602, '調味料及香辛料類', '肉桂粉', '前處理描述:混合均勻(肉桂粉,清華桂粉等)', NULL, 342.603, 4.225, 2.9148, 1.3241, 78.7529, 53.7082, 1.157, 9.611),
(1603, '調味料及香辛料類', '西洋芹菜片', '前處理描述:混合均勻打碎', NULL, 315.407, 24.354, 6.7976, 1.2753, 49.9241, 23.4119, 14.583, 90.866),
(1604, '調味料及香辛料類', '花椒粉', '前處理描述:混合均勻打碎(川花椒)', NULL, 368.885, 9.98, 9.2, 1.9328, 63.2065, 47.4753, NULL, 565.42),
(1605, '調味料及香辛料類', '洋香菜片', '前處理描述:混合均勻打碎', NULL, 312.444, 24.364, 7.4949, 1.5048, 47.661, 25.0434, 10.176, 27.91),
(1606, '調味料及香辛料類', '洋蔥粉', '前處理描述:混合均勻打碎(洋蔥,鹽等)', NULL, 377.162, 8.054, 1.8482, 0.8237, 82.078, 11.1806, 3.161, 34.24),
(1607, '調味料及香辛料類', '白胡椒粉', '前處理描述:混合均勻', NULL, 342.345, 3.73, 1.06, 0.1575, 78.7543, 26.3029, NULL, 119.84),
(1608, '調味料及香辛料類', '紅胡椒粒', '前處理描述:混合均勻磨碎', NULL, 376.485, 5.913, 13.7124, 2.9, 59.2614, 27.409, 24.16, 80.748),
(1609, '調味料及香辛料類', '黑胡椒粉', '前處理描述:混合均勻', NULL, 371.762, 11.58, 6.71, 4.0512, 67.67, 22.5295, NULL, 6.99),
(1610, '調味料及香辛料類', '綠胡椒粒', '前處理描述:混合均勻磨碎', NULL, 378.589, 11.272, 7.3148, 2.8072, 68.3661, 36.9205, NULL, 1178.84),
(1611, '調味料及香辛料類', '迷迭香粉', '前處理描述:混合均勻', NULL, 431.646, 5.864, 21.8671, 12.2784, 59.809, 47.4111, 3.268, 5.404),
(1612, '調味料及香辛料類', '荳蔻粉', '前處理描述:混合均勻', NULL, 448.246, 6.672, 26.2038, 23.0502, 50.5572, 18.9264, 0.941, 14.955),
(1613, '調味料及香辛料類', '蒜粉', '前處理描述:混合均勻', NULL, 331.504, 18.146, 0.44, 0.1267, 71.8663, 16.5894, NULL, 73.81),
(1614, '調味料及香辛料類', '辣椒粉', '前處理描述:混合均勻打碎', NULL, 387.341, 14.71, 14.13, 2.9087, 59.1109, 42.5279, NULL, 11.98),
(1615, '調味料及香辛料類', '薑黃粉', '前處理描述:混合均勻', NULL, 358.478, 14.591, 2.6745, 0.7992, 69.0108, 14.627, 3.552, 5.36),
(1616, '調味料及香辛料類', '薑粉', '前處理描述:混合均勻', NULL, 332.501, 10.392, 3.6039, 1.4322, 70.5409, 19.8009, 3.052, 2848.55),
(1617, '調味料及香辛料類', '羅勒片', '前處理描述:混合均勻打碎', NULL, 289.145, 23.265, 5.761, 2.3869, 46.1465, 35.4952, 1.463, 26.182),
(1618, '調味料及香辛料類', '花椒粒', '樣品狀態:乾貨; 前處理描述:混合均勻打碎', NULL, 358.763, 10.334, 12.5261, 2.0533, 53.5774, 45.715, 1.204, 2780.1),
(1619, '調味料及香辛料類', '七味唐辛子', '前處理描述:混合均勻打碎(紅辣椒,黑芝麻,白芝麻,桔皮,羅勒,花椒等)', NULL, 463.051, 15.82, 24.0667, 4.2381, 45.7927, 46.5076, 5.039, 39.117),
(1620, '調味料及香辛料類', '沙茶粉', '前處理描述:混合均勻打碎(扁魚,蒜頭,辣椒粉,椰子粉,鹽等)', NULL, 506.892, 14.95, 28.8, 8.689, 46.973, 15.0672, NULL, 2143.28),
(1621, '調味料及香辛料類', '豆酥', '前處理描述:混合均勻打碎(黃豆,蒜末,薑,調味料等)', NULL, 539.633, 30.098, 38.061, 6.5031, 19.1729, 13.2068, 3.696, 3128.73),
(1622, '調味料及香辛料類', '咖哩粉', '前處理描述:混合均勻(胡荽,薑黃,小茴香等)', NULL, 416.752, 13.89, 14.13, 1.1078, 58.5056, 36.3983, NULL, 552.28),
(1623, '調味料及香辛料類', '咖哩塊', '前處理描述:混合均勻打碎(咖哩粉,麵粉,油脂,鹽,糖,奶粉,調味料等)', NULL, 514.813, 5.626, 34.5255, 19.9903, 45.3948, 4.9481, 10.026, 4180.01),
(1624, '調味料及香辛料類', '油蔥酥', '前處理描述:混合均勻打碎(紅蔥頭,沙拉油等)', NULL, 517.686, 7.44, 28.82, 14.1764, 57.1364, 14.5123, NULL, 29.78),
(1625, '調味料及香辛料類', '梅子粉', '前處理描述:混合均勻(話梅,葡萄糖,防腐劑,香辛料等)', NULL, 285.787, 1.955, 3.8672, 0.6106, 60.7906, 8.9508, 37.233, 10507.4),
(1626, '調味料及香辛料類', '椰子粉', '前處理描述:混合均勻打碎', NULL, 629.239, 7.1825, 60.3325, 55.2013, 27.8118, 14.3221, 3.133, 28.7),
(1627, '調味料及香辛料類', '蒜頭酥', '前處理描述:混合均勻打碎(蒜頭,油,玉米粉等)', NULL, 451.659, 11.681, 17.7741, 8.3129, 61.242, 7.9479, 1.306, 32.477),
(1628, '調味料及香辛料類', '糖粉', '前處理描述:混合均勻(糖,澱粉等)', NULL, 398.87, 0.038, 0.1764, 0.0449, 99.2826, 0.1742, 96.332, 1.202),
(1629, '調味料及香辛料類', '椰漿', '前處理描述:混合均勻(椰漿,水,乳化劑,重亞硫酸鉀等)', NULL, 207.542, 1.065, 23.1103, 21.4452, 0, 0.284, 1.81, 23.474),
(1630, '調味料及香辛料類', '黃耆水', '前處理描述:取100g黃耆片,加去離子水1L,大火煮滾,轉小火煮30分鐘,取熬煮液分析', NULL, 14.1566, 0.889, 0.0477, 0.0118, 2.9303, 0.1173, 2.428, 1.988),
(1631, '調味料及香辛料類', '黃耆片', '樣品狀態:乾貨; 前處理描述:混合均勻打碎', NULL, 320.51, 14.93, 1.5969, 0.49, 68.725, 33.0373, 21.996, 16.289),
(1632, '調味料及香辛料類', '陳皮', '樣品狀態:乾貨; 前處理描述:混合均勻打碎', NULL, 348.588, 6.874, 2.4448, 0.8676, 74.7723, 39.5255, 15.707, 3.01),
(1633, '調味料及香辛料類', '山楂', '樣品狀態:乾貨; 前處理描述:混合均勻打碎', NULL, 344.613, 1.93, 2.4744, 1.0312, 78.6558, 36.5022, 19.029, 11.73),
(1634, '調味料及香辛料類', '岩鹽', '前處理描述:混合均勻(喜馬拉雅山岩鹽)', NULL, 2.4667, 0.035, 0.0987, 0.0378, 0.3596, NULL, 0.024, 34468.1),
(1635, '調味料及香辛料類', '低鈉鹽', '前處理描述:混合均勻(氯化鉀,氯化鈉,檸檬酸鈉,乳酸鈣,磷酸三鈣,甘草酸-銨,碘酸鉀等)', NULL, 11.45, 0.01, 0.01, NULL, 2.83, NULL, NULL, 18341.1),
(1636, '調味料及香辛料類', '味精', '前處理描述:混合均勻(L-麩酸鈉)', NULL, 250.501, 44.5, NULL, NULL, 18.1252, NULL, NULL, 11656.2),
(1637, '調味料及香辛料類', '高鮮味精', '前處理描述:混合均勻', NULL, 269.28, 45, NULL, NULL, 22.32, NULL, NULL, 11878.7),
(1638, '調味料及香辛料類', '鮮雞精', '前處理描述:混合均勻(鹽,糖,玉米澱粉,雞肉,雞油,味精,香料等)', NULL, 266.992, 10.83, 10.07, 3.6197, 33.2604, 2.899, NULL, 17521.6),
(1639, '調味料及香辛料類', '鰹魚粉', '前處理描述:混合均勻打碎(味素,食鹽,糖,乾燻鰹魚,鰹魚抽出物,酵母抽出物)', NULL, 240.079, 21.909, 1.0306, 0.5713, 35.7919, 0, 14.98, 15887.6),
(1640, '調味料及香辛料類', '高湯塊(排骨)', '前處理描述:混合均勻打碎(植物油,澱粉,鹽,調味料,豚骨粉,濃縮高湯,洋蔥粉等', NULL, 362.797, 12.507, 23.8545, 15.4386, 24.5196, 0.3742, 4.705, 14158.4),
(1641, '調味料及香辛料類', '高湯塊(雞肉)', '前處理描述:混合均勻打碎(雞肉粉,雞油,濃縮蛋白質,鹽,糖,味素,植物油,香辛料等)', NULL, 340.294, 14.71, 24.84, 13.5477, 14.4735, 0.5775, NULL, 16861.9),
(1642, '調味料及香辛料類', '高湯(豬大骨)', '前處理描述:混合均勻(豬肉,大骨濃縮汁,鹽,調味料等)', NULL, 49.1156, 4.2, 0.67, 0.1174, 6.5714, NULL, NULL, 4471.51),
(1643, '調味料及香辛料類', '低脂高湯', '前處理描述:混合均勻(豬肉原汁,鹽等)', NULL, 2.1768, 0.26, 0, NULL, 0.2842, NULL, NULL, 406.22),
(1644, '調味料及香辛料類', '素食高湯', '前處理描述:混合均勻(香菇抽出物,水,植物蛋白等)', NULL, 17.0368, 0.278, 0, NULL, 3.9812, NULL, NULL, 1285.75),
(1645, '調味料及香辛料類', '米醋', '樣品狀態:白醋; 前處理描述:混合均勻', NULL, 9.6804, NULL, NULL, NULL, 2.4201, NULL, NULL, 8.03),
(1646, '調味料及香辛料類', '糯米醋', '樣品狀態:白醋; 前處理描述:混合均勻', NULL, 16.8084, 0.12, 0, NULL, 4.0821, 0, NULL, 81.49),
(1647, '調味料及香辛料類', '高梁醋', '樣品狀態:白醋; 前處理描述:混合均勻(高梁,酒精等)', NULL, 27.24, NULL, NULL, NULL, 6.81, NULL, NULL, 2.72),
(1648, '調味料及香辛料類', '薏仁醋', '樣品狀態:白醋; 前處理描述:混合均勻', NULL, 13.0944, NULL, NULL, NULL, 3.2736, NULL, NULL, 183.35),
(1649, '調味料及香辛料類', '紅醋', '前處理描述:混合均勻(糯米,紅葡萄等)', '紅酢', 4.5325, 0.32, 0.0057, 0.0019, 0.8003, 0.1026, 0.264, 6.724),
(1650, '調味料及香辛料類', '香醋', '前處理描述:混合均勻(糖蜜,食鹽,味精等)', NULL, 2.8156, NULL, NULL, NULL, 0.7039, NULL, NULL, 103.2),
(1651, '調味料及香辛料類', '烏醋', '前處理描述:混合均勻(米醋,酒,醬油,果汁,蔬菜汁,糖,鹽等)', NULL, 36.7636, 0.49, 0, NULL, 8.7009, 0, NULL, 1571.33),
(1652, '調味料及香辛料類', '素食烏醋', '前處理描述:混合均勻(米酢,蔬菜,水果等)', NULL, 41.7664, NULL, NULL, NULL, 10.4416, NULL, NULL, 2130.83),
(1653, '調味料及香辛料類', '壽司醋', '前處理描述:混合均勻(糯米醋,糖,食鹽,調味料等)', NULL, 180.677, NULL, NULL, NULL, 45.1692, NULL, NULL, 2159.24),
(1654, '調味料及香辛料類', '醬油', '前處理描述:混合均勻(黃豆,小麥,鹽,糖,調味料等)', NULL, 90.0368, 7.785, NULL, NULL, 14.7242, NULL, NULL, 4997.46),
(1655, '調味料及香辛料類', '薏仁醬油', '前處理描述:混合均勻(黃豆,薏仁等)', NULL, 83.4616, 9.32, NULL, NULL, 11.5454, NULL, NULL, 4774.09),
(1656, '調味料及香辛料類', '黑豆醬油', '前處理描述:混合均勻(黑豆,砂糖,食鹽等)', '黑豆蔭油,蔭油', 113.748, 7.5103, 0.1533, 0.0369, 20.5818, 0.6208, 11.6035, 4076.81),
(1657, '調味料及香辛料類', '淡色醬油', '前處理描述:混合均勻(水,黃豆,小麥,鹽,糖等)', NULL, 77.7965, 7.12, 0.3621, 0.1071, 11.5144, 0.6422, 5.312, 5277.54),
(1658, '調味料及香辛料類', '薄鹽醬油(低鈉)', '前處理描述:混合均勻(黃豆,小麥,鹽 ,糖,酒料等)', '低鹽醬油', 77.3876, 7.44, NULL, NULL, 11.9069, NULL, NULL, 3508.26),
(1659, '調味料及香辛料類', '薄鹽醬油(低鈉高鉀)', '前處理描述:混合均勻(大豆,小麥等)', NULL, 56.3476, 6.47, NULL, NULL, 7.6169, NULL, NULL, 3259.87),
(1660, '調味料及香辛料類', '醬油膏', '前處理描述:混合均勻(黃豆,小麥,鹽 ,糖,澱粉,米等)', NULL, 103.38, 6.82, NULL, NULL, 19.0249, NULL, NULL, 4050),
(1661, '調味料及香辛料類', '黑豆油膏', '前處理描述:混合均勻(黑豆,糯米,鹽,糖等)', '蔭油膏', 146.287, 7.844, 0.0543, 0.0294, 28.6055, 0.3653, 23.08, 3009.91),
(1662, '調味料及香辛料類', '薄鹽黑豆醬油膏', '前處理描述:混合均勻(黑豆,砂糖,食鹽,糯米等)', NULL, 124.37, 7.62, 0.06, NULL, 23.3376, NULL, NULL, 2964.49),
(1663, '調味料及香辛料類', '味醂', '前處理描述:混合均勻(糯米,蓬萊米,米麴,釀造酢,鹽,調味料等)', '米醂,米霖', 219.843, 0.485, 0, 0, 54.4757, 0.029, 50.487, 107.67),
(1664, '調味料及香辛料類', '鮮味露', '樣品狀態:醬油(水,脫水性植物蛋白質,鹽等); 前處理描述:混合均勻', NULL, 74.6136, 20.11, 0.07, NULL, 0, 0.0574, NULL, 7803.2),
(1665, '調味料及香辛料類', '蠔油', '前處理描述:混合均勻(鮮蠔提煉,食鹽,水,糖,澱粉,醬色等)', NULL, 155.991, 6.47, 0.13, NULL, 32.2353, 0.0824, NULL, 5846.55),
(1666, '調味料及香辛料類', '魚露', '前處理描述:混合均勻', NULL, 64.2895, 10.222, 0.2259, 0.1105, 5.3421, NULL, 4.971, 8907.59),
(1667, '調味料及香辛料類', '紅辣椒油', '前處理描述:混合均勻(植物油,芝麻油,辣椒萃取物等)', NULL, 898.904, 0.028, 99.838, 16.0939, 0.0625, NULL, 0.021, 0.269),
(1668, '調味料及香辛料類', '香油', '前處理描述:混合均勻(白芝麻油及沙拉油調合而成)', NULL, 883.116, NULL, 99.9, 15.3846, 0, NULL, NULL, NULL),
(1669, '調味料及香辛料類', '蝦油', '前處理描述:混合均勻(蝦露,鹽,糖等)', NULL, 56.0529, 7.362, 0.0933, 0.0162, 6.4413, 0.4376, 2.465, 8411.39),
(1670, '調味料及香辛料類', '干貝醬', '前處理描述:混合均勻打碎(干貝,小卷燒,丁香,火腿,紅辣椒,糖,鹽,植物油,沙茶醬,乾蝦等)', 'XO醬', 557.679, 16.653, 51.0165, 8.9585, 7.9795, 1.4771, 2.223, 1108.57),
(1671, '調味料及香辛料類', '牛肉醬', '前處理描述:混合均勻打碎(牛肉,大豆油,辣椒,八角粉,五香粉,糖,檸檬酸等)', NULL, 507.086, 16.978, 38.915, 7.0631, 22.2348, 0.9989, 11.735, 989.058),
(1672, '調味料及香辛料類', '肉燥', '前處理描述:混合均勻打碎(精肉碎,醬油,蔥乾,味精等)', NULL, 397.254, 9.46, 38.05, 14.1868, 4.2411, NULL, NULL, 941.21),
(1673, '調味料及香辛料類', '素肉燥', '前處理描述:混合均勻打碎(麵粉,香菇,植物油等)', NULL, 482.725, 12.385, 42.57, 7.2472, 12.5137, 2.8527, NULL, 1055.51),
(1674, '調味料及香辛料類', '義式乳酪醬', '前處理描述:混合均勻(保久乳,乳酪,鮮奶油,麵粉,奶油,調味料,牛奶鈣等)', NULL, 215.514, 8.796, 16.9612, 12.2568, 6.9197, 3.3035, 2.794, 402.855),
(1675, '調味料及香辛料類', '炸醬', '前處理描述:混合均勻打碎(豆瓣醬,葵花油,大豆蛋白,味素,辣椒醬,麻油,豬油抽出物等)', NULL, 397.622, 14.61, 34.6976, 6.044, 6.7258, 5.7336, 0, 3545.07),
(1676, '調味料及香辛料類', '素食炸醬', '前處理描述:混合均勻打碎(豆瓣醬,葵花油,大豆蛋白,味素,辣椒醬,麻油,蠶豆醬等)', NULL, 391.192, 13.865, 35.2976, 5.4454, 4.5135, 4.5962, 0, 3474.45),
(1677, '調味料及香辛料類', '海苔醬', '前處理描述:混合均勻(海苔,海帶,醬油,鹽,糖等)', NULL, 223.02, 6.41, 0, NULL, 49.345, 2.2878, NULL, 1985.3),
(1678, '調味料及香辛料類', '麻醬', '前處理描述:混合均勻', '芝麻醬', 643.482, 20.79, 52.81, 8.6213, 21.258, 11.8431, NULL, 4),
(1679, '調味料及香辛料類', '速食乾麵麻醬包', '前處理描述:混合均勻打碎(豬油,棕櫚油,芝麻醬,紅蔥,蒜頭,醬油,花生醬,鹽,味精,糖,維生素E等)', NULL, 676.385, 13.198, 64.0362, 20.1746, 11.8168, 4.9243, 4.993, 1716.49),
(1680, '調味料及香辛料類', '白醬', '前處理描述:混合均勻(奶粉,奶油,植物油,洋蔥,鹽,糖,味精,澱粉,起司,蒜,橄欖油,胡椒等)', NULL, 61.35, 1.226, 3.2452, 1.0786, 6.8098, 1.4142, 3.85, 934.219),
(1681, '調味料及香辛料類', '青醬', '前處理描述:混合均勻(奶油,植物油,羅勒葉,鹽,糖,味精,澱粉,起司,蔬菜,橄欖油,松子泥等)', NULL, 83.0576, 0.933, 5.4092, 1.1642, 7.6607, 2.2682, 4.57, 1210.92),
(1682, '調味料及香辛料類', '蕃茄義大利麵醬', '前處理描述:混合均勻打碎(蕃茄,橄欖,橄欖油,胡蘿蔔,芹菜,羅勒,辣椒,黑胡椒,糖,鹽,味精等)', NULL, 70.3102, 3.158, 2.4642, 0.4355, 8.8751, 1.6136, 6.55, 767.842),
(1683, '調味料及香辛料類', '五味醬', '前處理描述:混合均質(番茄醬,糖,薑,蒜,調味料,澱粉,香辛料,食用醋等)', NULL, 139.933, 1.304, 0.8096, 0.2057, 31.8576, 1.0494, 27.324, 1946.77),
(1684, '調味料及香辛料類', '牛排醬', '前處理描述:混合均勻(醬油,黑糊椒,洋蔥,酒,果汁,香辛料等)', NULL, 130.28, 2.49, 0, 0, 30.08, 1.3076, NULL, 2112.82),
(1685, '調味料及香辛料類', '羊肉爐醬', '前處理描述:混合均勻(豆乳,豆瓣,糖,味噌等)', NULL, 129.689, 7.323, 7.1903, 1.2554, 8.9211, 1.0714, 5.02, 2945.1),
(1686, '調味料及香辛料類', '沙茶醬', '前處理描述:混合均質(扁魚,蝦米,黃豆油,大蒜,蔥干,辣椒等)', NULL, 728.81, 10.2, 71.81, 13.1771, 10.43, 3.6844, NULL, 420.84),
(1687, '調味料及香辛料類', '素沙茶醬', '前處理描述:混合均質(小麥胚芽,胡麻粉,薑,辣椒粉,香菇汁,沙拉油,天然香辛料等)', NULL, 670.28, 7.55, 66.04, 11.4103, 11.43, 2.839, NULL, 1990.54),
(1688, '調味料及香辛料類', '黃芥茉醬', '前處理描述:混合均勻(芥茉粉,香料等)', NULL, 74.4754, 4.134, 3.6798, 0.2298, 6.2053, 5.1178, 0.764, 1153.86),
(1689, '調味料及香辛料類', '山葵醬', '前處理描述:混合均勻(生鮮山葵,鹽,維生素E,食品添加物等)', '芥茉醬', 338.169, 1.062, 5.8973, 1.3124, 70.2113, 5.2797, 33.671, 264.66),
(1690, '調味料及香辛料類', '金桔醬', '前處理描述:混合均勻(金桔,辣椒,糖,米酒等)', NULL, 84.1054, 0.53, 0.4262, 0.1193, 19.5374, 2.1004, 15.731, 1749.68),
(1691, '調味料及香辛料類', '海鮮醬', '前處理描述:混合均勻(蕃薯,黃豆,蒜,栗粉,芝麻,辣椒,醋酸,鹽,糖等)', NULL, 228.434, 1.793, 2.2099, 0.3686, 50.3432, 1.4003, 40.61, 2270.94),
(1692, '調味料及香辛料類', '烤肉醬', '前處理描述:混合均勻(黃豆,小麥,澱粉,芝麻,醬油,辣椒醬,醋,鹽,糖,香辛料等)', NULL, 156.84, 5.21, 0.84, 0.1493, 32.11, 0.7219, NULL, 2603.87),
(1693, '調味料及香辛料類', '排骨醬', '前處理描述:混合均勻(蕃茄,黃豆,芝麻,栗粉,蒜,鹽,糖,芝麻油,米酒,醋酸,味精,香料等)', NULL, 221.087, 2.292, 4.41, 0.7691, 43.0572, 1.4114, NULL, 4195.94),
(1694, '調味料及香辛料類', '甜辣醬', '前處理描述:混合均勻(蕃茄,辣椒,糖,鹽,香菇汁等)', NULL, 116.2, 0.97, 0, NULL, 28.08, 0.5711, NULL, 1968.37),
(1695, '調味料及香辛料類', '甜麵醬', '前處理描述:混合均勻(黃豆,鹽,糖,麵粉,米,香辛料等)', NULL, 215.606, 4.48, 2.39, 0.7845, 44.0441, 1.669, NULL, 1869.61),
(1696, '調味料及香辛料類', '朝鮮醬', '前處理描述:混合均勻(白芝麻,薑,果汁,糖,醬油,香料等)', NULL, 106.064, 1.646, 2.32, 0.3704, 19.6501, 1.795, NULL, 1501.63),
(1697, '調味料及香辛料類', '黑胡椒醬', '前處理描述:混合均勻均質', NULL, 116.891, 2.517, 0.5298, 0.1633, 25.5137, 1.5024, 8.87, 1761.79),
(1698, '調味料及香辛料類', '日式照燒醬', '前處理描述:混合均勻(醬油,味醂,糖,麥芽糖,澱粉,己二烯酸鉀等)', NULL, 227.232, 2.991, 0.5299, 0.1289, 52.6247, 0.0757, 39.189, 1839.82),
(1699, '調味料及香辛料類', '蒜蓉醬', '前處理描述:混合均勻打碎(蒜,豆油,鹽,糖,果酸等)', NULL, 281.592, 4.22, 19.97, 3.1491, 21.2456, 1.2258, NULL, 816.6),
(1700, '調味料及香辛料類', '辣蒜蓉醬', '前處理描述:混合均勻打碎(蒜,辣椒,鹽,糖,香油等)', NULL, 78.456, 2.32, 4.21, 0.7687, 7.8215, 4.5173, NULL, 5043.13),
(1701, '調味料及香辛料類', '辣椒醬', '前處理描述:混合均勻打碎(紅辣椒,鹽,糖,麻油,香油,味精等)', NULL, 82.5834, 2.605, 2.895, 0.4882, 11.5271, 4.7253, NULL, 4948.41),
(1702, '調味料及香辛料類', '蔥醬', '前處理描述:混合均勻打碎(青蔥,豆醬,辣椒,蒜頭,沙拉油,白胡椒粉,糖,鹽等)', NULL, 148.658, 2.231, 6.8463, 1.3039, 19.5294, 1.8388, 13.756, 1122.02),
(1703, '調味料及香辛料類', '糖醋醬', '前處理描述:混合均勻(糖,蕃茄,蒜頭,鹽,香油,醋,澱粉,調味料,香辛料等)', NULL, 130.749, 1.86, 2.56, 0.3713, 25.0673, 0.7364, NULL, 1857.95),
(1704, '調味料及香辛料類', '蕃茄醬', '前處理描述:混合均勻(蕃茄,醋,糖,鹽,香辛料等)', NULL, 113.776, 1.61, 0.06, NULL, 26.699, 1.4297, NULL, 1116.22),
(1705, '調味料及香辛料類', '薑蓉醬', '前處理描述:混合均勻(老薑,植物油,檸檬酸等)', NULL, 64.6532, 1, 2.57, 0.4265, 9.3808, 1.7262, NULL, 645.72),
(1706, '調味料及香辛料類', '蘑菇醬', '前處理描述:混合均勻打碎(蘑菇片,蕃茄醬,鹽,肉骨醬,洋蔥等)', NULL, 58.1016, 1.49, 2.39, 0.9844, 7.6579, 1.2546, NULL, 355.357),
(1707, '調味料及香辛料類', '米豆醬', '前處理描述:混合均勻打碎(米,黃豆,糖,鹽等)', NULL, 128.47, 7.4, 3.04, 0.6287, 17.8775, 2.5093, NULL, 4354.31),
(1708, '調味料及香辛料類', '蒜味豆豉醬', '前處理描述:混合均勻打碎(豆豉,蒜頭,辣椒,植物油,糖,調味料等)', NULL, 269.582, 9.49, 16.98, 2.7585, 19.7006, 2.6658, NULL, 3150.43),
(1709, '調味料及香辛料類', '豆酥醬', '前處理描述:混合均勻打碎(黃豆,大豆油,鹽,糖,薑等)', NULL, 671.152, 12.21, 64.54, 10.9395, 10.3629, 5.6264, 6.253, 1206.64),
(1710, '調味料及香辛料類', '豆瓣醬', '前處理描述:混合均勻打碎(蠶豆,黃豆,麵粉,食鹽,麻油等)', NULL, 178.438, 14.2, 8.1, 1.3376, 12.1845, 4.1311, NULL, 5041.9),
(1711, '調味料及香辛料類', '辣豆瓣醬', '前處理描述:混合均勻打碎(辣椒,黃豆,醬油,麻油,鹽,糖,調味料等)', NULL, 100.304, 4.52, 3.32, 0.538, 13.086, 5.1553, NULL, 4379.76),
(1712, '調味料及香辛料類', '紅麴醬', '前處理描述:混合均勻打碎(天然紅麴,精選米,蔗糖,天然海鹽等)', NULL, 163.223, 4.582, 0.5339, 0.1988, 35.0225, 1.1921, 16.757, 2687.01),
(1713, '調味料及香辛料類', '韭花醬', '前處理描述:混合均勻打碎(韭菜花,薑,鹽等)', NULL, 29.0736, 2.087, 0.31, 0.0975, 4.4839, 2.7434, NULL, 5062.84),
(1714, '調味料及香辛料類', '香椿醬', '前處理描述:混合均勻打碎(香椿,香菇,糖,豆辮粒,芝麻,番茄醬,花瓜,麻油,沙拉油,胡椒粉,鹽等)', NULL, 507.219, 8.1265, 51.7333, 8.8733, 2.2783, 5.0139, 3.209, 961.734),
(1715, '調味料及香辛料類', '麻婆醬', '前處理描述:混合均勻(豆瓣,味噌,辣椒,薑,澱粉,香油,糖等)', NULL, 189.967, 2.93, 9.54, 1.446, 23.0967, 2.6012, NULL, 1752.75),
(1716, '調味料及香辛料類', '蝦醬', '前處理描述:混合均勻(發酵銀蝦,鹽等)', NULL, 99.0644, 19.59, 1.71, 1.1154, 1.3286, NULL, NULL, 10131.5),
(1717, '調味料及香辛料類', '沙拉醬', '前處理描述:混合均勻(沙拉油,雞蛋,醋,糖,鹽,香辛料等)', NULL, 644.52, 1.94, 65.68, 9.9308, 11.41, 0.1089, NULL, 979.82),
(1718, '調味料及香辛料類', '沙拉醬(2021年取樣)', '前處理描述:混合均勻(沙拉油,雞蛋,醋,糖,鹽,香辛料等)', '蛋黃醬', 629.535, 1.854, 61.67, 8.6503, 16.7722, 0, 7.38, 686.9),
(1719, '調味料及香辛料類', '無蛋沙拉醬', '前處理描述:混合均勻(植物油,大豆卵磷脂等)', NULL, 479.396, 1.774, 44.03, 6.897, 19.0076, NULL, NULL, 549.4),
(1720, '調味料及香辛料類', '無蛋沙拉醬(2021年取樣)', '前處理描述:混合均勻(沙拉油、釀造糯米醋、鹽、乳清蛋白等)', NULL, 631.315, 0.251, 59.84, 9.7312, 22.9378, 0, 19.859, 349.5),
(1721, '調味料及香辛料類', '千島沙拉醬', '前處理描述:混合均勻(沙拉油,糖,蕃茄醬,小黃瓜,蛋,洋蔥,醋,鹽,香辛料等)', NULL, 514.96, 0.956, 49.3499, 7.9059, 16.7468, 0.4056, 17.664, 631.272),
(1722, '調味料及香辛料類', '和風沙拉醬', '前處理描述:混合均勻(水,糯米酢,糖,鹽,醬油,橄欖油,果汁,食品添加物,維生素E等)', NULL, 128.626, 2.116, 1.6516, 0.2758, 26.3245, 0.2507, 25.423, 2853.12),
(1723, '調味料及香辛料類', '凱撒沙拉醬', '前處理描述:混合均勻均質(植物油,蛋,鹽,檸檬汁,白酒,醋,醬油,芝蔴,乾酪,大蒜,洋蔥,糖,銀魚等', NULL, 336.55, 1.375, 29.0755, 4.8181, 17.3426, 0.3698, 11.979, 1274.73),
(1724, '調味料及香辛料類', '味噌', '前處理描述:混合均勻(米,黃豆,鹽等)', NULL, 215.158, 10.6415, 4.4701, 1.0199, 33.0902, 4.5038, 18.046, 4153),
(1725, '調味料及香辛料類', '法式奶酥醬', '前處理描述:混合均勻(奶油,糖,奶粉,調味料等)', NULL, 596.082, 6.693, 46.5464, 19.9838, 37.5981, NULL, 34.77, 176.983),
(1726, '調味料及香辛料類', '巧克力醬(液體)', '前處理描述:混合均勻(糖,水,可可粉,鹽,磷酸三鈣,食用色素等)', NULL, 276.745, 1.953, 0.8115, 0.5109, 65.4073, 2.1304, 51.719, 67.973),
(1727, '調味料及香辛料類', '草莓果醬', '前處理描述:混合均勻打碎(草莓,糖,果膠等)', NULL, 272.195, 0.3555, 1.21, 0.8374, 64.9708, 1.6043, NULL, 21.83),
(1728, '調味料及香辛料類', '葡萄果醬', '前處理描述:混合均勻', NULL, 260.6, 0.02, 1.88, NULL, 60.9, 1.48, NULL, 51.8),
(1729, '調味料及香辛料類', '柚子果醬', '前處理描述:混合均勻均質', NULL, 267.696, 0.623, 0.78, 0.2064, 64.5461, 2.3989, 55.038, 81.45),
(1730, '調味料及香辛料類', '桑葚果醬', '前處理描述:混合均勻', NULL, 226.882, 0.889, 0.3964, 0.1756, 54.9397, 1.0944, 50.5524, 0.904),
(1731, '調味料及香辛料類', '白芝麻麵包醬', '前處理描述:混合均勻打碎(白芝麻,大豆,植物油,乳化劑等)', NULL, 684.763, 20.027, 60.3619, 12.0784, 15.3496, 10.004, 3.215, 30.369),
(1732, '調味料及香辛料類', '黑芝麻麵包醬', '前處理描述:混合均勻(黑芝麻,植物油,鹽,黑糖,葡萄糖,乳化劑,卵磷質等)', NULL, 666.745, 10.628, 57.3591, 13.336, 27.0002, 6.763, 18.559, 107.392),
(1733, '調味料及香辛料類', '花生醬', '前處理描述:混合均勻(花生,植物油等)', NULL, 656.522, 23.97, 54.325, 10.4042, 17.9293, 10.5602, NULL, 306.435),
(1734, '調味料及香辛料類', '洋蔥麵包醬', '前處理描述:混合均勻(洋蔥,植物油,蛋,奶粉,澱粉,鹽,草漿,香草,檸檬酸等)', NULL, 276.444, 0.98, 26.07, 1.8204, 9.4734, 1.9291, NULL, 535.25),
(1735, '調味料及香辛料類', '法式香蒜醬', '前處理描述:混合均勻(奶油,蒜,荷蘭芹,調味料等)', NULL, 790.918, 1.078, 85.7285, 40.4724, 3.7623, 0.5355, 0, 477.324),
(1736, '調味料及香辛料類', '無糖黑芝麻醬', '前處理描述:混合均勻(100%黑芝麻)', NULL, 612.371, 20.719, 55.9537, 8.3726, 17.7258, 12.8133, 0.519, 1.96),
(1737, '調味料及香辛料類', '液體奶精', '前處理描述:混合均勻(植物油,酪蛋白,奶粉,乳化劑,香料等)', '奶精', 262.209, 3.912, 26.28, 24.1206, 2.5102, NULL, NULL, 217.14),
(1738, '調味料及香辛料類', '液體奶精(2021年)', '前處理描述:混合均勻(精緻油(椰子油、棕櫚油)、奶油、奶粉、砂糖等)', '奶精', 242.153, 2.208, 24.0427, 15.4743, 4.2341, 0.0672, 2.433, 122.46),
(1739, '調味料及香辛料類', '奶精粉', '前處理描述:混合均勻(植物性脂肪)', '奶精,植物性奶精', 543.8, 2.2, 33, 32.2938, 59.5, NULL, NULL, 158),
(1740, '調味料及香辛料類', '奶精粉(2021年)', '前處理描述:混合均勻(葡萄糖漿、完全氫化棕櫚仁油)', '奶精', 549.676, 2.112, 34.5507, 31.3269, 57.568, 0, 8.846, 242.5),
(1741, '調味料及香辛料類', '奶精粉(低脂)', '前處理描述:混合均勻(玉米糖漿,氫化椰子油等)', '奶精,植物性奶精', 450.128, 2.092, 15.65, 9.3888, 75.2276, NULL, NULL, 98.73),
(1742, '調味料及香辛料類', '炸排粉', '前處理描述:混合均勻(麵包粉,小麥粉,澱粉,鹽,味精等)', NULL, 343.728, 11.87, 1.8, 0.7693, 70.0119, 1.8176, NULL, 2926.52),
(1743, '調味料及香辛料類', '炸雞粉', '前處理描述:混合均勻(麵粉,澱粉,糖,鹽,胡椒等)', NULL, 332.878, 8.34, 1.72, 0.6334, 71.0095, 6.2214, NULL, 3789.99),
(1744, '調味料及香辛料類', '蒸肉粉(五香)', '前處理描述:混合均勻打碎(米,花椒,八角,香辛料,鹽,糖,味素等)', NULL, 349.824, 10.28, 1.07, 0.2709, 74.7684, 2.4012, NULL, 1211.28),
(1745, '調味料及香辛料類', '熱狗粉', '前處理描述:混合均勻(奶粉,黃豆粉,麵粉,玉米粉,調味料等)', NULL, 355.038, 8.35, 0.88, 0.198, 78.4296, 1.3805, NULL, 315.13),
(1746, '調味料及香辛料類', '麵包粉', '前處理描述:混合均勻打碎(麵包粉,小麥粉,酵母,起酥油,鹽,葡萄糖,vit C等)', NULL, 369.616, 14.423, 1.5081, 0.3225, 74.5879, 2.5499, 3.176, 255.836),
(1747, '調味料及香辛料類', '酵母粉', '前處理描述:混合均勻打碎', NULL, 346.9, 46.29, 0.02, NULL, 40.39, 21.3, NULL, 140.4),
(1748, '糕餅點心類', '冷藏寧波年糕', '樣品狀態:冷藏真空包裝(蓬萊米,水,鹽等); 前處理描述:混合均勻打碎', NULL, 219.561, 3.9283, 0.5797, 0.159, 49.6575, 0.6098, 0.077, 62.0457),
(1749, '糕餅點心類', '冷藏甜年糕', '樣品狀態:冷藏真空包裝(糯米,糖等); 前處理描述:混合均勻打碎', NULL, 241.643, 2.296, 0.39, NULL, 57.2372, 0.4618, NULL, 15.11),
(1750, '糕餅點心類', '冷藏廣式芋頭粿', '樣品狀態:冷藏真空包裝(米,芋頭,豬肉,蝦米等); 前處理描述:混合均勻打碎', NULL, 108.661, 2.11, 1.6003, 0.5214, 21.4545, 0.9924, 0.658, 242.17),
(1751, '糕餅點心類', '冷藏廣式蘿蔔糕', '樣品狀態:冷藏真空包裝(米,蘿蔔,豬肉,蝦米,香菇,油,蔥,火腿等); 前處理描述:混合均勻打碎', '菜頭粿', 110.909, 2.1605, 2.3036, 0.7958, 20.3836, 0.8927, 0, 251.035),
(1752, '糕餅點心類', '包餡甜麻糬(紅豆)', '前處理描述:混合均勻打碎(糯米,糖,紅豆餡,水飴,馬鈴薯粉等)', NULL, 329.098, 10.02, 2.9224, 1.1128, 65.679, 1.9781, 27.636, 44.015),
(1753, '糕餅點心類', '鹹麻糬', '前處理描述:混合均勻打碎', NULL, 248.1, 8.7, 4.5, 2.2073, 43.2, 1.6, NULL, 272),
(1754, '糕餅點心類', '芋仔餅', '前處理描述:混合均勻打碎', NULL, 353.7, 4.6, 12.1, 5.076, 56.6, 3.3, NULL, 8),
(1755, '糕餅點心類', '月餅(棗泥)', '前處理描述:混合均勻打碎', NULL, 419.4, 6, 18.2, 5.238, 57.9, 3.4, NULL, 120),
(1756, '糕餅點心類', '綠豆凸', '前處理描述:混合均勻打碎', '綠豆椪', 393.878, 6.9, 15.8955, 6.7514, 55.8045, 3.9, 21.107, 14),
(1757, '糕餅點心類', '蕃薯餅', '前處理描述:混合均勻打碎', NULL, 330.6, 3.9, 10.6, 3.6051, 54.9, 1.6, NULL, 24),
(1758, '糕餅點心類', '車輪餅(紅豆)', '前處理描述:混合均勻打碎', NULL, 187.022, 2.057, 1.0632, 0.3169, 42.3062, 6.4764, 12.693, 107.646),
(1759, '糕餅點心類', '車輪餅(菜脯)', '前處理描述:混合均勻打碎', NULL, 183.387, 1.404, 5.688, 1.449, 31.6447, 3.9125, 7.093, 466.901),
(1760, '糕餅點心類', '太陽餅', '前處理描述:混合均勻打碎', NULL, 460.221, 5.3, 20.5243, 8.3814, 63.5757, 0.4, 18.968, 3),
(1761, '糕餅點心類', '牛舌餅', '前處理描述:混合均勻打碎', NULL, 411.316, 5.7, 13.2233, 5.1127, 67.3767, 0.2, 22.786, 66),
(1762, '糕餅點心類', '蛋黃芋頭酥', '樣品狀態:冷凍包裝(蛋黃,芋頭,澱粉等); 前處理描述:混合均勻打碎', NULL, 216.58, 3.1, 3.02, 0.7067, 44.2499, 2.2151, NULL, 33.84),
(1763, '糕餅點心類', '蛋黃酥', '前處理描述:混合均勻打碎', NULL, 461.306, 11.4, 26.4211, 12.0367, 44.4789, 2, 12.58, 196),
(1764, '糕餅點心類', '鳳梨酥', '前處理描述:混合均勻打碎', NULL, 484.189, 4.2, 24.3578, 14.3677, 62.0422, 1.7, 20.208, 59),
(1765, '糕餅點心類', '蘿蔔酥', '前處理描述:混合均勻打碎', NULL, 427.336, 7.5, 20.9071, 8.2668, 52.2929, 3.3, 18.102, 72),
(1766, '糕餅點心類', '鳳眼糕', '前處理描述:混合均勻打碎', NULL, 378.561, 3.8, 0.8323, 0.3335, 88.9677, 0.7, 48.659, 1),
(1767, '糕餅點心類', '米粩', '前處理描述:混合均勻打碎', '豬油粩', 441.54, 2.6, 13.7481, 4.0668, 76.8519, 0.5, 24.087, 34),
(1768, '糕餅點心類', '可頌', '前處理描述:混合均勻打碎', NULL, 452.496, 7.319, 26.1036, 14.0894, 47.0718, 2.0512, 6.578, 360.222),
(1769, '糕餅點心類', '泡芙(巧克力)', '前處理描述:混合均勻打碎(麵粉,雞蛋等)', NULL, 589.589, 10.3, 40.3979, 17.6351, 46.2021, 2.1, 21.58, 146),
(1770, '糕餅點心類', '蛋塔', '前處理描述:混合均勻打碎', NULL, 375.979, 4.065, 21.6938, 11.4511, 41.1186, 1.4923, 20.14, 85.423),
(1771, '糕餅點心類', '蛋塔(葡式)', '前處理描述:混合均勻打碎', NULL, 375.144, 3.682, 25.8478, 14.6542, 31.9464, 1.2234, 13.315, 119.216),
(1772, '糕餅點心類', '鬆餅', '前處理描述:混合均勻打碎', NULL, 256.673, 3.234, 2.6102, 1.0475, 55.0614, 1.4165, 20.117, 227.887),
(1773, '糕餅點心類', '冷凍馬拉糕', '樣品狀態:冷凍包裝(雞蛋,麵粉,牛奶等); 前處理描述:混合均勻打碎', NULL, 319.973, 7.05, 12.87, 2.5891, 43.9858, 1.2676, NULL, 165.72),
(1774, '糕餅點心類', '銅鑼燒', '前處理描述:混合均勻打碎(麵粉,雞蛋,糖,蜂蜜,糖,油脂,紅豆餡,香料,膨脹劑,鹽等)', NULL, 331.951, 3.394, 9.9414, 1.9473, 57.2255, 1.9324, 31.957, 123.389),
(1775, '糕餅點心類', '冷凍馬蹄條', '樣品狀態:冷凍包裝(粉類,春捲皮,花生等); 前處理描述:混合均勻打碎', NULL, 194.499, 4.217, 1.91, 0.3794, 40.1102, 4.4083, NULL, 277.19),
(1776, '糕餅點心類', '乳酪蛋糕', '前處理描述:混合均勻打碎(雞蛋,麵粉,起司,牛奶,糖,天然果汁等)', NULL, 295.689, 6.971, 21.2706, 13.2916, 19.0923, 0.7352, 13.689, 152.97),
(1777, '糕餅點心類', '海綿蛋糕(圓形)', '前處理描述:混合均勻打碎', NULL, 343.827, 5.09, 18.0767, 3.7088, 40.1942, 2.499, 20.836, 208.118),
(1778, '糕餅點心類', '提拉米蘇(圓形)', '前處理描述:混合均勻打碎', NULL, 327.795, 4.407, 25.0806, 16.2883, 21.1105, 0.6265, 10.587, 105.051),
(1779, '糕餅點心類', '蜂蜜蛋糕(原味)', '前處理描述:混合均勻打碎(蜂蜜,雞蛋,麵粉,糖等)', NULL, 346.478, 6.514, 14.5422, 3.1338, 47.3855, 0.6423, 28.978, 75.97),
(1780, '糕餅點心類', '蜂蜜蛋糕(巧克力)', '前處理描述:混合均勻打碎(雞蛋,巧克力,牛奶,麵粉,糖,植物油,調味料,膨鬆劑,乳化劑等)', NULL, 340.823, 6.912, 15.645, 3.7095, 43.0925, 1.4393, 21.262, 133.88),
(1781, '糕餅點心類', '蜂蜜蛋糕(起司)', '前處理描述:混合均勻打碎(雞蛋,麵粉,起司,植物油,香料,膨鬆劑,乳化劑等)', NULL, 352.269, 7.428, 18.122, 5.653, 39.8647, 0.6665, 21.285, 169.94),
(1782, '糕餅點心類', '黑森林蛋糕', '前處理描述:混合均勻打碎', '巧克力鮮奶油蛋糕', 276.724, 4.173, 17.7881, 11.083, 24.9849, 1.566, 17.734, 76.29),
(1783, '糕餅點心類', '土司', '前處理描述:混合均勻打碎(麵粉,乳粉,糖,鹽,油脂,酵母,乳化劑等)', NULL, 288.917, 9.532, 6.2709, 3.1296, 48.5877, 3.0078, 4.514, 443.474),
(1784, '糕餅點心類', '土司(含全穀粉)', '前處理描述:混合均勻打碎(麵粉,乳粉,糖,鹽,油脂,麩皮,酵母,小麥胚芽等)', NULL, 291.631, 9.981, 6.1193, 2.9442, 49.1583, 4.1729, 6.67, 354.922),
(1785, '糕餅點心類', '紅豆土司', '前處理描述:混合均勻打碎(土司,紅豆等)', NULL, 319.336, 9.162, 10.189, 5.879, 47.7467, 3.0336, 13.619, 289.903),
(1786, '糕餅點心類', '奶酥麵包', '前處理描述:混合均勻打碎', NULL, 376.655, 9.1, 15.651, 9.1787, 49.849, 1.1, 15.89, 215),
(1787, '糕餅點心類', '肉鬆麵包', '前處理描述:混合均勻打碎', NULL, 428.936, 8.108, 22.9082, 5.8249, 47.5826, 3.0526, 12.746, 416.622),
(1788, '糕餅點心類', '蜜糖甜甜圈(波/摩堤)', '前處理描述:混合均勻打碎', '波(摩)堤', 396.292, 1.953, 20.6722, 9.4302, 50.6076, 0.7462, 15.313, 389.339),
(1789, '糕餅點心類', '糖粒甜甜圈(油炸)', '前處理描述:混合均勻打碎', NULL, 400.997, 5.311, 19.8339, 7.1928, 50.3121, 1.9673, 13.379, 264.988),
(1790, '糕餅點心類', '菠蘿麵包', '前處理描述:混合均勻打碎', NULL, 377.921, 9.2, 15.0242, 8.7275, 51.4758, 0.9, 11.828, 204),
(1791, '糕餅點心類', '葡萄乾奶酥麵包', '前處理描述:混合均勻打碎(含葡萄乾,奶酥,杏仁片等)', NULL, 306.06, 8.359, 7.8793, 3.0403, 50.4277, 3.3056, 15.577, 250.6),
(1792, '糕餅點心類', '漢堡包', '前處理描述:混合均勻打碎(麵粉,糖,奶油,酵母,鹽,奶粉,酥油,蛋,白芝麻等)', NULL, 321.935, 9.079, 7.3538, 5.154, 54.8586, 3.0139, 4.885, 285.941),
(1793, '糕餅點心類', '餐包', '前處理描述:混合均勻打碎(麵粉,糖,奶油,酵母,鹽,鮮奶,植物油,蛋等)', NULL, 365.205, 7.185, 14.9349, 7.5118, 50.5128, 1.9938, 12.173, 205.532),
(1794, '糕餅點心類', '雙胞胎麵包', '前處理描述:混合均勻打碎', NULL, 341.196, 8.384, 7.7111, 1.3785, 59.565, 0.6101, 15.84, 34.85),
(1795, '糕餅點心類', '仙草凍', '前處理描述:混合均勻打碎(仙草,鹼粉,澱粉,水,海藻膠,糖等)', NULL, 19.3462, 0.936, 0.0734, NULL, 3.7354, 0.3566, 3.995, 70.826),
(1796, '糕餅點心類', '仙草凍(2020取樣)', '前處理描述:混合均勻打碎(仙草原汁,水,糖,樹薯澱粉,碳酸鈉)', NULL, 19.3029, 0.312, 0.1849, 0.0721, 4.0977, 0.0842, 2.649, 55.92),
(1797, '糕餅點心類', '咖啡凍', '前處理描述:混合均勻打碎(水,糖,植物膠,香料,氯化鉀,檸檬酸鈉,乳酸鈣,蒟蒻粉等)', NULL, 74.6934, 0.145, 0.1886, 0.0993, 18.104, 0.2823, 17.677, 13.099),
(1798, '糕餅點心類', '果凍', '前處理描述:混合均勻打碎(濃縮果汁,海藻抽出物,糖等)', NULL, 90.9675, NULL, 0.1971, 0, 22.2984, 0.0581, 16.63, 30.49),
(1799, '糕餅點心類', '原味愛玉凍', '前處理描述:混合均質(澱粉,愛玉天然膠質等)', '愛玉,草子仔,草枳子,天拋藤,玉枳,枳子,天拋,風不動', 1.6912, NULL, NULL, NULL, 0.4228, 0.3134, NULL, 12.6),
(1800, '糕餅點心類', '檸檬愛玉凍', '前處理描述:混合均質(砂糖,檸檬汁等)', '愛玉,草子仔,草枳子,天拋藤,玉枳,枳子,天拋,風不動', 52.5044, NULL, NULL, NULL, 13.1261, 0.0054, NULL, 28.38),
(1801, '糕餅點心類', '粉粿', '前處理描述:混合均勻打碎', NULL, 65.0955, 0.016, 0.1171, 0.0377, 15.5468, 0.7519, 0, 30.44),
(1802, '糕餅點心類', '鮮奶布丁', '前處理描述:混合均勻均質(生乳,鮮奶油,奶粉,糖,香料,乳化劑,植物膠等)', '白布丁', 110.107, 2.981, 5.0824, 3.3329, 13.1104, NULL, 17.909, 54.0663),
(1803, '糕餅點心類', '烤布丁', '前處理描述:混合均勻均質(雞蛋,牛乳,糖等)', NULL, 138.184, 4.73, 7.1268, 4.1591, 13.7808, NULL, 13.322, 63.31),
(1804, '糕餅點心類', '黃布丁', '前處理描述:混合均勻均質(乳品,雞蛋萃取物,植物油,糖漿等)', '雞蛋布丁', 109.789, 2.3, 3.4779, 2.4007, 17.3221, NULL, 16.966, 66),
(1805, '糕餅點心類', '豆花(花生)', '前處理描述:混合均勻打碎(黃豆 ,花生醬等)', NULL, 60.0585, 2.03, 0.9157, 0.1945, 10.9243, 0.7757, 12.82, 8.21),
(1806, '糕餅點心類', '傳統豆花(未加糖)', '前處理描述:混合均勻均質', NULL, 38.5209, 3.166, 1.9197, 0.3111, 2.1449, 0.5788, 0.501, 21.52),
(1807, '糕餅點心類', '羊羹', '前處理描述:混合均勻打碎', NULL, 288.651, 3, 0.6903, 0.1972, 67.6097, 3.1, 46.521, 38),
(1808, '糕餅點心類', '巧克力冰淇淋', '前處理描述:混合均質(牛奶,可可粉等)', NULL, 191.844, 4.2, 10.6088, 9.5733, 19.8912, NULL, 16.771, 80),
(1809, '糕餅點心類', '香草冰淇淋', '前處理描述:混合均質', NULL, 182.085, 2.5, 9.057, 7.9355, 22.643, NULL, 16.08, 102),
(1810, '糕餅點心類', '紅豆牛奶冰棒', '前處理描述:混合均勻均質', NULL, 154.906, 3.458, 4.8719, 3.9834, 24.3067, 1.6525, 15.727, 24.96),
(1811, '糕餅點心類', '花生仁湯', '樣品狀態:罐裝(花生仁,蔗糖等); 前處理描述:混合均勻打碎', NULL, 108.375, 2.84, 5.143, 1.027, 12.682, 1.55, 8.923, 50.58),
(1812, '糕餅點心類', '方塊酥', '前處理描述:混合均勻打碎', '恩典酥,方塊酥', 509.467, 7.1, 24.0534, 10.5275, 66.1466, 0.9, 13.974, 4),
(1813, '糕餅點心類', '夾心餅乾(草莓)', '前處理描述:混合均勻打碎', NULL, 516.895, 4.8, 27.379, 15.8932, 62.821, 1.3, 25.051, 303),
(1814, '糕餅點心類', '捲心酥', '前處理描述:混合均勻打碎', NULL, 490.155, 6.072, 19.8978, 10.6485, 71.6966, 1.5173, 39.397, 73.16),
(1815, '糕餅點心類', '蛋捲(芝麻)', '前處理描述:混合均勻打碎(麵粉.雞蛋.芝麻等)', NULL, 548.839, 6.8, 33.2877, 16.5342, 55.5123, 1.1, 28.966, 225),
(1816, '糕餅點心類', '煎餅', '前處理描述:混合均勻打碎(麵粉,糖,奶油,奶粉,蛋,植物油,大豆卵磷脂,維生素等E)', NULL, 443.608, 6.292, 11.6872, 6.5666, 78.3138, 4.1436, 34.477, 162.108),
(1817, '糕餅點心類', '營養口糧', '前處理描述:混合均勻打碎(麵粉,植物油,巧克力粉,奶油,蛋,糖,鹽,碳酸鈣,維生素B1等)', NULL, 424.25, 6.759, 8.7283, 5.0492, 79.6647, 2.7331, 18.337, 333.419),
(1818, '糕餅點心類', '蘇打餅乾(蔬菜)', '前處理描述:混合均勻打碎(麵粉,植物油,鮮奶油,豬油,青蔥,麥芽萃取物,鹽,酵母等)', NULL, 511.917, 7.843, 24.7453, 10.6538, 64.4593, 2.7989, 1.433, 388.426),
(1819, '糕餅點心類', '玉米餅乾(原味)', '前處理描述:混合均勻打碎', NULL, 504.301, 7.58, 24.3085, 3.0827, 63.8011, 5.25, 0.877, 314.34),
(1820, '糕餅點心類', '洋芋片', '前處理描述:混合均勻打碎', NULL, 552.922, 5.2, 34.3444, 12.8453, 55.7556, 2.2, 1.885, 383),
(1821, '糕餅點心類', '魚酥', '前處理描述:混合均勻打碎', NULL, 563.776, 8.3, 36.5952, 11.6082, 50.3048, 0.1, 6.491, 695),
(1822, '糕餅點心類', '零食泡麵', '前處理描述:混合均勻打碎', NULL, 483.807, 11.259, 21.5191, 10.0688, 61.2749, 3.4635, 2.571, 1872.15),
(1823, '糕餅點心類', '雪餅', '前處理描述:混合均勻打碎(米,植物油,糖,調味料,澱粉,明膠,鮮奶油,脫脂奶粉等)', NULL, 486.613, 5.752, 19.379, 6.9313, 72.2986, 0.9727, 19.35, 385.104),
(1824, '糕餅點心類', '沙其馬', '前處理描述:混合均勻打碎(麵粉,麥芽,糖,棕櫚油,鹽,奶粉,蛋,芝麻,葡萄乾等)', NULL, 486.963, 5.605, 24.8395, 11.5981, 60.2468, 1.6203, 22.784, 127.724),
(1825, '糕餅點心類', '牛奶巧克力', '前處理描述:混合均勻打碎(可可粉,奶粉等)', NULL, 546.465, 9.36, 32.5741, 21.4547, 53.9645, NULL, 51.858, 100.62),
(1826, '糕餅點心類', '花生牛奶巧克力', '前處理描述:混合均勻打碎(麥芽糖,花生,奶粉,植物油,可可粉等)', NULL, 488.662, 13.02, 23.238, 9.8841, 56.8601, 1.5789, 24.722, 49.93),
(1827, '糕餅點心類', '榛果牛奶巧克力', '前處理描述:混合均勻打碎(牛奶,巧克力,榛果仁,蔬菜油,麵粉等)', NULL, 589.941, 8.98, 40.4255, 15.081, 47.5479, 4.4463, 34.84, 45.47),
(1828, '糕餅點心類', '糖衣牛奶巧克力', '前處理描述:混合均勻打碎(牛奶,巧克力,糖,玉米澱粉,阿拉伯膠等)', NULL, 481.171, 4.81, 18.6092, 11.9702, 73.6121, 1.0029, 63.287, 61.46),
(1829, '糕餅點心類', '白巧克力風味糖', '前處理描述:混合均勻打碎(植物油,全脂奶粉,大豆磷脂等)', NULL, 561.893, 8.635, 34.6927, 23.4653, 53.7797, NULL, 49.455, 108.67),
(1830, '糕餅點心類', '黑巧克力(85%)', '前處理描述:混合均勻打碎(可可漿,可可脂,可可粉,糖,乳化劑,香料等)', NULL, 613.122, 10.862, 46.1183, 29.8307, 38.6523, 14.2465, 10.736, 5.137),
(1831, '糕餅點心類', '白芝麻糖', '前處理描述:混合均勻打碎(白芝麻,麥芽飴等)', NULL, 520.957, 8.401, 26.2, 4.0439, 62.8883, 4.5298, NULL, 4),
(1832, '糕餅點心類', '黑芝麻糖', '前處理描述:混合均勻打碎(黑芝麻,花生等)', NULL, 535.688, 8.532, 30.3888, 4.9427, 57.0153, 9.7967, 17.754, 49.8),
(1833, '糕餅點心類', '花生糖', '前處理描述:混合均勻打碎(花生,砂糖,麥芽糖等)', NULL, 562.365, 17.9, 35.3009, 8.3009, 43.2641, 3, 19.512, 182.67),
(1834, '糕餅點心類', '花生貢糖', '前處理描述:混合均勻打碎(糖,麥芽,花生等)', NULL, 511.167, 13.53, 26.3443, 5.3787, 54.987, 3.6121, 18.212, 118.44),
(1835, '糕餅點心類', '牛軋糖', '前處理描述:混合均勻打碎(果糖,花生仁,奶粉,奶油等)', NULL, 477.026, 9.678, 21.6889, 6.0793, 60.7784, 3.3005, 22.781, 316.16),
(1836, '糕餅點心類', '核棗糕', '前處理描述:混合均勻打碎(麥芽,核桃仁,粟米,蜜棗等)', NULL, 425.426, 2.478, 14.58, 2.4899, 71.0734, 1.4907, NULL, 46.55),
(1837, '糕餅點心類', '水果軟糖', '前處理描述:混合均勻打碎(糖,香料,動物膠,蘋果酸,色素等)', NULL, 411.239, 1.25, 8.4308, 6.7616, 82.5905, NULL, 58.138, 4.23),
(1838, '糕餅點心類', '水果QQ軟糖', '前處理描述:混合均勻打碎(砂糖,葡萄原汁,麥芽糖等)', NULL, 342.633, 6.83, 0.229, 0.2094, 78.3129, 0.1142, 52.361, 27.542),
(1839, '糕餅點心類', '牛奶軟糖', '前處理描述:混合均勻打碎(糖,煉乳,奶粉,奶油,植物性油,卵磷脂,動物膠等)', NULL, 423.764, 2.85, 11.13, 8.6142, 78.0484, NULL, 13.993, 100.885),
(1840, '糕餅點心類', '巧克力牛奶軟糖', '前處理描述:混合均勻打碎(糖,煉乳,可可粉,奶粉,奶油,動物膠等)', NULL, 422.157, 3.395, 11.315, 8.0215, 76.6854, NULL, NULL, 119.225),
(1841, '糕餅點心類', '太妃糖', '前處理描述:混合均勻打碎(牛奶,糖等)', NULL, 438.306, 2.67, 13.9, 10.4788, 75.6316, NULL, NULL, 211.28),
(1842, '糕餅點心類', '蓮藕糖', '前處理描述:混合均勻打碎(蔗糖,麥芽糖,葡萄糖,蜂蜜等)', NULL, 395.397, 0.2, 0.39, 0.093, 97.7717, 0.2065, NULL, 43.14),
(1843, '糕餅點心類', '枇杷糖', '前處理描述:混合均勻打碎(蔗糖,麥芽糖,葡萄糖,果糖等)', NULL, 393.72, 0.2, 0.11, NULL, 97.9825, 0, NULL, 14.3),
(1844, '糕餅點心類', '苦茶糖', '前處理描述:混合均勻打碎(青草,蜂蜜等)', NULL, 396.403, 0.07, 0.24, 0.184, 98.4907, 0, NULL, 6.59),
(1845, '糕餅點心類', '薑糖', '前處理描述:混合均勻打碎(蔗糖,麥芽糖,生薑等)', NULL, 359.405, 0.33, 2.46, 1.1368, 83.9863, 1.1299, NULL, 93.14),
(1846, '糕餅點心類', '巧克力夾心糖', '前處理描述:混合均勻打碎(水飴,奶粉,可可粉,可可脂,維生素C等)', NULL, 402.592, 0.73, 2.77, 2.555, 93.6854, NULL, NULL, 21.23),
(1847, '糕餅點心類', '維生素C口含錠(檸檬)', '前處理描述:混合均勻打碎(天然檸檬汁,維生素C,糖,檸檬酸等)', NULL, 398.679, 0.16, 0.55, NULL, 98.2722, NULL, NULL, 8.78),
(1848, '糕餅點心類', '酵母菌咀嚼錠', '前處理描述:混合均勻打碎(酵母粉,玉米粉,大麥粉,奶粉,芝麻等)', NULL, 390.598, 23.59, 5.62, 1.5853, 61.4145, 9.514, NULL, 185.59),
(1849, '糕餅點心類', '乳酸球', '前處理描述:混合均勻打碎(乳糖,奶粉,砂糖,植物油等)', NULL, 474.42, 3.76, 21.65, 20.9444, 66.1324, 11.6415, NULL, 34.57),
(1850, '糕餅點心類', '羊乳片', '前處理描述:混合均勻打碎(生羊乳等)', NULL, 410.018, 23.4, 10.0037, 6.7334, 56.5963, NULL, 47.531, 319),
(1851, '糕餅點心類', '紅豆球', '前處理描述:混合均勻打碎(紅豆,麥芽,砂糖等)', NULL, 350.78, 7.07, 0.97, NULL, 78.4426, 6.2695, NULL, 12.82),
(1852, '糕餅點心類', '綠豆球', '前處理描述:混合均勻打碎(綠豆,麥芽,砂糖等)', NULL, 345.877, 6.19, 1.06, NULL, 77.8942, 6.5434, NULL, 16.01),
(1853, '糕餅點心類', '棉花糖', '前處理描述:混合均勻打碎(砂糖,澱粉,玉米糖漿等)', NULL, 331.304, 3.22, 0.3038, 0.156, 78.9224, 0, 61.712, 16.44),
(1854, '糕餅點心類', '甘薯蜜餞', '樣品狀態:糖漬; 前處理描述:混合均勻打碎', NULL, 346.8, 0.92, 0.64, NULL, 84.34, 4.14, NULL, 163),
(1855, '糕餅點心類', '芒果青', '樣品狀態:糖漬; 前處理描述:混合均勻打碎', NULL, 222.95, 0.58, 0.422, 0.1827, 54.208, 2.9, 22.261, 149),
(1856, '糕餅點心類', '芭樂果乾', '樣品狀態:果乾(芭樂,糖,鹽); 前處理描述:混合均勻打碎', NULL, 346.941, 1.132, 0.2, 0.1262, 85.1532, 8.8512, 59.044, 368.45),
(1857, '糕餅點心類', '鳳梨果乾', '樣品狀態:果乾(鳳梨,糖,鹽); 前處理描述:混合均勻打碎', NULL, 348.494, 1.954, 0.25, 0.1338, 84.6069, 3.3912, 46.286, 181.99),
(1858, '糕餅點心類', '檸檬果乾', '樣品狀態:果乾(檸檬,糖,鹽); 前處理描述:混合均勻打碎', NULL, 343.631, 0.832, 0.21, 0.0505, 84.6033, 8.215, 57.367, 292.24),
(1859, '糕餅點心類', '豆干丁(五香)', '前處理描述:混合均勻打碎(黃豆,糖,鹽,辣椒,香辛料,調味料,己二烯酸等)', NULL, 382.564, 35.387, 18.0542, 3.4276, 19.632, 2.7897, 5.577, 987.777),
(1860, '糕餅點心類', '豆干片(沙茶)', '前處理描述:混合均勻打碎(黃豆,糖,鹽,辣椒,沙茶,香辛料,調味料,己二烯酸等)', NULL, 464.259, 16.159, 28.2205, 4.7492, 36.4095, 5.2878, 25.482, 686.459),
(1861, '糕餅點心類', '布丁粉', '前處理描述:混合均勻(海藻粉,奶粉,芋頭粉等)', NULL, 418.742, 2.675, 7.0504, 5.0258, 86.1472, NULL, 77.739, 231.37),
(1862, '糕餅點心類', '冰淇淋粉(香草)', '前處理描述:混合均勻', NULL, 430.1, 15.9, 11.7, 11.3209, 65.3, NULL, NULL, 583),
(1863, '糕餅點心類', '起酥片', '前處理描述:混合均勻打碎(麵粉,瑪琪琳,水,糖,檸檬酸等)', NULL, 403.621, 6.659, 26.8778, 16.4973, 33.7713, 1.1615, 2.719, 205.265),
(1864, '加工調理食品及其他類', '廣東粥', '前處理描述:混合均勻打碎(花枝,豬肝,油條,蛋等)', NULL, 81.361, 4.9, 2.8322, 0.8474, 9.0678, 0.2, 0, 271),
(1865, '加工調理食品及其他類', '冷凍火腿炒飯', '樣品狀態:冷凍包裝(米,火腿,蔬菜等); 前處理描述:混合均勻打碎', NULL, 189.2, 5, 5.6, 1.0853, 29.7, 2, NULL, 220),
(1866, '加工調理食品及其他類', '冷凍蝦仁炒飯', '樣品狀態:冷凍包裝(米,蝦仁,蔬菜等); 前處理描述:混合均勻打碎', NULL, 147.919, 4.7, 3.4238, 0.4881, 24.5762, 2.7, 1.323, 222),
(1867, '加工調理食品及其他類', '三角飯糰(肉鬆)', '前處理描述:混合均勻打碎(米,肉鬆,海苔,美奶滋,芝麻,食品添加物等)', NULL, 218.755, 5.769, 5.4649, 0.7641, 36.6236, 1.9219, 1.924, 224.29),
(1868, '加工調理食品及其他類', '糯米飯糰', '前處理描述:混合均勻打碎(油條,肉鬆,菜脯等)', NULL, 335.2, 5.9, 17.6, 3.8773, 38.3, 1.1, NULL, 393),
(1869, '加工調理食品及其他類', '壽司(豆皮壽司)', '前處理描述:混合均勻打碎', '稻禾壽司', 194.286, 6.283, 4.7277, 0.7004, 31.6513, 0.6547, 8.41, 275.53),
(1870, '加工調理食品及其他類', '肉粽', '前處理描述:混合均勻打碎(豬肉,香菇,鴨蛋黃,花生等)', NULL, 234.8, 8.2, 8.8, 3.2947, 30.7, 0.6, NULL, 343),
(1871, '加工調理食品及其他類', '鹼粽', '前處理描述:混合均勻打碎', NULL, 131.248, 2.12, 1.7079, 0.1683, 26.8492, 0.4896, 0, 213.56),
(1872, '加工調理食品及其他類', '冷凍筒仔米糕', '樣品狀態:冷凍包裝(糯米,香菇,豬前腿肉等); 前處理描述:混合均勻打碎', NULL, 212.086, 6.464, 5.75, 2.1643, 33.6199, 0.7449, NULL, 331.03),
(1873, '加工調理食品及其他類', '筒仔米糕', '前處理描述:混合均勻打碎', NULL, 245.8, 6.6, 8.6, 3.059, 35.5, 1.1, NULL, 299),
(1874, '加工調理食品及其他類', '豬血糕', '前處理描述:混合均勻打碎(豬血,糯米,鹽等)', '米血糕', 193.86, 8.631, 0.9153, 0.3257, 37.7745, 0.9139, 0, 414.125),
(1875, '加工調理食品及其他類', '鴨血糕', '前處理描述:混合均勻打碎(鴨血,糯米,鹽等)', '米血糕', 192.785, 6.687, 1.0621, 0.4536, 39.1194, 1.3173, 0.482, 1739.07),
(1876, '加工調理食品及其他類', '肉圓', '樣品狀態:未炸半成品(豬肉等),不加醬料; 前處理描述:混合均勻打碎', '肉丸', 136.033, 3.1, 1.6066, 0.5626, 27.2934, 0.3, 2.043, 217),
(1877, '加工調理食品及其他類', '清蒸蝦仁肉圓', '前處理描述:混合均勻打碎(豬肉,蝦仁等)', '肉丸', 151.8, 4.6, 7.4, 2.8697, 16.7, 1.3, NULL, 429),
(1878, '加工調理食品及其他類', '甜酒釀', '前處理描述:混合均勻打碎(糯米,水,酵母等)', NULL, 163.059, 4.95, 0.4429, 0.1393, 34.8183, 0.5195, 33.219, 2.084),
(1879, '加工調理食品及其他類', '紫米酒釀', '前處理描述:混合均勻打碎(糯米75%,水分25%,純米精釀等)', NULL, 154.906, 4.184, 0.4281, 0.1389, 33.5793, 0.8302, 28.599, 1.227),
(1880, '加工調理食品及其他類', '冷凍芝麻湯圓', '樣品狀態:冷凍包裝(糯米,芝麻粉等); 前處理描述:混合均勻打碎', NULL, 352.454, 4.8, 16.2509, 6.6279, 46.7491, 0.9, 9.706, 3),
(1881, '加工調理食品及其他類', '冷凍花生湯圓', '樣品狀態:冷凍包裝(糯米,花生粉等); 前處理描述:混合均勻打碎', NULL, 349.832, 5.2, 15.6463, 7.2789, 47.0537, 0.6, 9.824, 6),
(1882, '加工調理食品及其他類', '冷凍豬肉湯圓', '樣品狀態:冷凍包裝(糯米,豬前腿等); 前處理描述:混合均勻打碎', NULL, 281.398, 6.5, 12.1196, 5.0539, 36.5804, 0.4, 1.751, 210),
(1883, '加工調理食品及其他類', '免煮飯', '樣品狀態:速食白飯包; 前處理描述:混合均勻打碎', NULL, 168.121, 3.23, 0.34, 0.089, 37.05, 0.42, NULL, 15.94),
(1884, '加工調理食品及其他類', '埔里米粉', '前處理描述:混合均勻打碎(玉米,澱粉等)', NULL, 357.72, 0.534, 0.52, NULL, 87.726, 1.17, NULL, 3.4),
(1885, '加工調理食品及其他類', '細米粉', '前處理描述:混合均勻打碎(米,玉米澱粉等)', NULL, 355.283, 0.374, 0.57, NULL, 87.1643, 0.9547, NULL, 196.885),
(1886, '加工調理食品及其他類', '濁水米粉', '前處理描述:混合均勻打碎(濁水溪生產之在來1號白米等)', NULL, 357.2, 5.25, 1.32, NULL, 81.08, 0.2427, NULL, 208.66),
(1887, '加工調理食品及其他類', '米粄條', '前處理描述:混合均勻打碎(在來米,修飾澱粉,地瓜粉,鹽,沙拉油等)', '美濃粄條', 129.45, 1.05, 0.9465, 0.1942, 29.1829, 1.444, 0.176, 82.373),
(1888, '加工調理食品及其他類', '米苔目', '前處理描述:混合均勻打碎', NULL, 121.21, 0.555, 0.05, 0.0126, 29.635, 0.145, NULL, 9.5),
(1889, '加工調理食品及其他類', '粿仔條', '前處理描述:混合均勻打碎', NULL, 193.296, 0.511, 1.24, 0.1941, 45.0229, 0.3454, NULL, 14.65),
(1890, '加工調理食品及其他類', '米漿(散裝)', '樣品狀態:散裝; 前處理描述:混合均勻', NULL, 61.7, 0.6, 0.5, 0.1209, 13.7, 0.7, NULL, 2),
(1891, '加工調理食品及其他類', '保久米漿', '樣品狀態:常溫包裝(米,花生,水,砂糖等); 前處理描述:混合均質', NULL, 62.3877, 1.026, 1.4569, 0.334, 11.2929, 0.6742, 10.015, 20.6795),
(1892, '加工調理食品及其他類', '糙米漿', '樣品狀態:冷藏瓶裝(糙米,花生,水,蔗糖,芝麻,鹽,食用膠等); 前處理描述:混合均勻', NULL, 71.148, 1.2805, 2.1848, 0.4867, 11.5907, 0.8868, 8.96, 19.9675),
(1893, '穀物類', '糙秈米漿', '樣品狀態:冷藏瓶裝(糙米,花生,水,蔗糖,鹽,食用膠等); 前處理描述:混合均勻', NULL, 68.1714, 0.855, 2.1378, 0.5162, 11.3778, 0.8524, 9.282, 28.245),
(1894, '加工調理食品及其他類', '糯米漿', '樣品狀態:常溫罐裝(花生,米,糖,水等); 前處理描述:混合均勻', NULL, 50.8888, 0.76, 0.77, 0.177, 10.2297, 0.1314, NULL, 26.66),
(1895, '加工調理食品及其他類', '黑糯米漿', '樣品狀態:常溫罐裝(黑糯米等); 前處理描述:混合均勻', NULL, 50.0716, 0.399, 0.24, 0.0524, 11.5789, 0.17, NULL, 14.19),
(1896, '加工調理食品及其他類', '米漿粉', '樣品狀態:沖泡即食(花生,糖,糯米,芝麻,胚芽等); 前處理描述:混合均勻磨碎', NULL, 444.113, 9.08, 12.28, 2.5132, 74.3183, 1.9683, NULL, 2.58),
(1897, '加工調理食品及其他類', '燕麥奶', '樣品狀態:冷藏瓶裝(水,燕麥等); 前處理描述:混合均勻', NULL, 43.892, 1.029, 0.836, 0.1689, 8.063, 1.0938, 3.845, 14.011),
(1898, '加工調理食品及其他類', '玉米粒罐頭', '樣品狀態:罐頭製品(甜玉米仁,水,鹽,糖等); 前處理描述:混合均勻打碎', NULL, 89.9804, 2.3413, 1.4356, 0.3232, 16.9237, 3.6354, 4.562, 208.008),
(1899, '加工調理食品及其他類', '玉米醬罐頭', '樣品狀態:罐頭製品(甜玉米.水.澱粉.鹽等); 前處理描述:混合均勻打碎', NULL, 65.5421, 1.4045, 0.4445, 0.0941, 13.9809, 1.6905, 4.952, 275.517),
(1900, '加工調理食品及其他類', '麵筋(未調味)', '前處理描述:混合均勻打碎', NULL, 642.922, 42.5115, 53, 8.3734, 0, 1.8761, NULL, 6.875),
(1901, '加工調理食品及其他類', '麵腸(未調味)', '前處理描述:混合均勻打碎', NULL, 137.937, 20.636, 1.85, 0.3956, 9.6858, 0.5877, NULL, 47.45),
(1902, '加工調理食品及其他類', '水餃皮', '前處理描述:混合均勻打碎', NULL, 263.523, 7.7565, 0.5075, 0, 56.9823, 1.4527, NULL, 628.805),
(1903, '加工調理食品及其他類', '春捲皮', '前處理描述:混合均勻打碎', NULL, 240.809, 8.29, 0.652, 0, 50.4453, 2.0143, NULL, 544.974),
(1904, '加工調理食品及其他類', '餛飩皮', '前處理描述:混合均勻打碎', NULL, 270.959, 8.34, 0.543, 0, 58.1781, 1.5165, NULL, 500.873),
(1905, '加工調理食品及其他類', '長麵線', '前處理描述:混合均勻打碎', '壽麵線', 309.894, 10.7203, 1.073, 0.2932, 64.339, 1.9448, 3.74, 2874.32),
(1906, '加工調理食品及其他類', '紅麵線', '前處理描述:混合均勻打碎(麵粉,鹽等)', NULL, 306.98, 11.268, 1.41, 0.3049, 62.3046, 2.072, NULL, 2813.42),
(1907, '加工調理食品及其他類', '麵線', '前處理描述:混合均勻打碎(麵粉,鹽,水,澱粉等)', NULL, 349.751, 11.707, 1.4957, 0.4333, 72.3655, 2.5107, 2.222, 751.978),
(1908, '加工調理食品及其他類', '雞絲麵', '樣品狀態:不含調味包; 前處理描述:混合均勻打碎', NULL, 463.032, 9.4, 22.83, 7.1715, 54.9905, 1.202, NULL, 2450.12),
(1909, '加工調理食品及其他類', '乾麵條', '樣品狀態:乾麵條(麵粉,鹽,水,食用澱粉等); 前處理描述:混合均勻打碎', NULL, 350.001, 11.644, 1.4787, 0.4394, 72.5293, 1.627, 2.392, 362.246),
(1910, '加工調理食品及其他類', '油麵條', '樣品狀態:乾麵條(麵粉,鹽,水,純鹼,色素等); 前處理描述:混合均勻打碎', '油麵', 361.452, 11.4, 1.2055, 0.3623, 76.2505, 1.1194, 1.583, 712.149),
(1911, '加工調理食品及其他類', '紅蘿蔔麵', '樣品狀態:乾麵條(小麥粉,紅蘿蔔,澱粉等); 前處理描述:混合均勻打碎', NULL, 352.098, 12.082, 0.97, 0.2159, 73.7599, 2.4804, NULL, 368.03),
(1912, '加工調理食品及其他類', '通心麵', '樣品狀態:乾麵條(蛋,麵粉等); 前處理描述:混合均勻打碎', NULL, 358.511, 13.818, 1.43, 0.2923, 72.5922, 1.8237, NULL, 25.38),
(1913, '加工調理食品及其他類', '菠菜麵', '樣品狀態:乾麵條(小麥粉,菠菜,澱粉等); 前處理描述:混合均勻打碎', NULL, 355.587, 11.792, 1.22, 0.2727, 74.3597, 2.457, NULL, 310.13),
(1914, '加工調理食品及其他類', '鍋燒意麵', '樣品狀態:乾麵條(麵粉,雞蛋,沙拉油等); 前處理描述:混合均勻打碎', NULL, 478.951, 10, 22.77, 4.063, 58.5053, 3.0324, NULL, 990.22),
(1915, '加工調理食品及其他類', '雞蛋麵', '樣品狀態:乾麵條(蛋白質,澱粉等); 前處理描述:混合均勻打碎', NULL, 357.783, 12.511, 0.94, 0.2164, 74.8198, 2.775, NULL, 466.91),
(1916, '加工調理食品及其他類', '刀削麵', '樣品狀態:濕麵條(小麥粉等); 前處理描述:混合均勻打碎', NULL, 266.594, 8.353, 0.94, 0.3641, 56.1804, 0.9642, NULL, 225.69),
(1917, '加工調理食品及其他類', '拉麵', '樣品狀態:濕麵條(麵粉,鹽,小麥粉等); 前處理描述:混合均勻打碎', NULL, 292.284, 9.108, 0.815, NULL, 62.1292, 1.3051, NULL, 428.965),
(1918, '加工調理食品及其他類', '意麵', '樣品狀態:濕麵條(高筋麵粉,雞蛋,維生素B2等); 前處理描述:混合均勻打碎', NULL, 289.604, 10.069, 0.99, NULL, 60.1044, 4.5127, NULL, 571.98),
(1919, '加工調理食品及其他類', '衛生油麵', '樣品狀態:濕麵條(麵粉,食油,鹼粉等); 前處理描述:混合均勻打碎', NULL, 163.203, 5.465, 1.845, 0.2962, 31.1845, 0.5531, NULL, 66.965),
(1920, '加工調理食品及其他類', '金門黃麵', '樣品狀態:濕麵條; 前處理描述:混合均勻打碎', NULL, 157.997, 6.411, 0.5338, 0.139, 31.8873, 2.3313, 0, 325.611),
(1921, '加工調理食品及其他類', '冷凍烏龍麵', '樣品狀態:濕麵條(小麥粉,澱粉,鹽等),冷凍製品; 前處理描述:混合均勻打碎', NULL, 128.612, 3.4, 0.2528, 0.0812, 28.1842, 1.4528, 0.3675, 192.18),
(1922, '加工調理食品及其他類', '鍋燒麵', '樣品狀態:濕麵條; 前處理描述:混合均勻打碎', NULL, 119.78, 4.4915, 0.4, 0.1302, 24.5534, 0.5355, NULL, 41.635),
(1923, '加工調理食品及其他類', '蕎麥麵(乾)', '樣品狀態:生(小麥粉,蕎麥粉,鹽,山藥,山芋粉,兒茶素,鹽,調味料等); 前處理描述:混合均勻磨碎', NULL, 348.693, 12.6925, 1.7098, 0.4696, 70.6336, 4.0725, 1.7475, 733.396),
(1924, '加工調理食品及其他類', '蕎麥麵(濕)', '樣品狀態:生(小麥粉,蕎麥粉,樹薯澱粉,蛋白,鹽,植物油,調味料等); 前處理描述:混合均勻打碎', NULL, 153.164, 6.281, 1.5162, 0.3063, 28.5986, 2.5642, 0.209, 136.343),
(1925, '加工調理食品及其他類', '炒板條', '前處理描述:混合均勻打碎', NULL, 149.4, 4.2, 4.2, 1.1323, 23.7, 1.2, NULL, 307),
(1926, '加工調理食品及其他類', '泡麵(牛肉口味)', '前處理描述:混合均勻打碎(麵粉,調味料等)', NULL, 473.284, 9.6, 24.4969, 12.4049, 53.6031, 1.8, 1.579, 2077),
(1927, '加工調理食品及其他類', '泡麵(鮮蝦口味)', '前處理描述:混合均勻打碎(麵粉,調味料等)', NULL, 474.843, 9.6, 23.8486, 11.2757, 55.4514, 1.7, 2.723, 1889),
(1928, '加工調理食品及其他類', '擔仔麵', '樣品狀態:含肉燥,去湯; 前處理描述:混合均勻打碎', NULL, 123.7, 4.4, 6.5, 2.3348, 11.9, 2.5, NULL, 312),
(1929, '加工調理食品及其他類', '冷凍牛肉水餃', '樣品狀態:冷凍包裝(牛肉,洋蔥,麵粉等); 前處理描述:混合均勻打碎', NULL, 215.194, 8.92, 9.6763, 3.3162, 23.1069, 1.2343, 2.567, 383.48),
(1930, '加工調理食品及其他類', '冷凍豬肉水餃', '樣品狀態:冷凍包裝(麵粉,鮮肉,蔬菜等); 前處理描述:混合均勻打碎', NULL, 207.749, 8.071, 9.665, 3.381, 22.12, 0.905, NULL, 447.175),
(1931, '加工調理食品及其他類', '冷凍豬肉韭菜水餃', '樣品狀態:冷凍包裝(麵粉,鮮肉,蔬菜等); 前處理描述:混合均勻打碎', NULL, 228.924, 8.4, 11.4648, 4.1508, 23.0352, 1.8, 1.754, 439),
(1932, '加工調理食品及其他類', '冷凍豬肉蟹黃水餃', '樣品狀態:冷凍包裝(豬肉,麵粉等); 前處理描述:混合均勻打碎', NULL, 223.222, 7.771, 9.79, 3.0477, 26.0069, 1.3562, NULL, 472.08),
(1933, '加工調理食品及其他類', '冷凍香菇雞肉水餃', '樣品狀態:冷凍包裝(雞肉,香菇,豬肉等); 前處理描述:混合均勻打碎', NULL, 220.86, 9.54, 10.21, 3.5395, 22.7025, 2.2759, NULL, 350.4),
(1934, '加工調理食品及其他類', '冷凍素食水餃', '樣品狀態:冷凍包裝(麵粉,冬粉,蔬菜,腐皮等); 前處理描述:混合均勻打碎', NULL, 175.025, 8.7425, 4.1107, 1.1109, 25.7648, 2.8199, 3.202, 369.38),
(1935, '加工調理食品及其他類', '冷凍鮪魚水餃', '樣品狀態:冷凍包裝(麵粉,鮪魚,豬肉等); 前處理描述:混合均勻打碎', NULL, 195.98, 9.047, 8.5, 3.3029, 20.823, 1.2823, NULL, 274.8),
(1936, '加工調理食品及其他類', '冷凍豬肉熟水餃', '樣品狀態:冷凍包裝(豬肉,麵粉,蔬菜等); 前處理描述:混合均勻打碎', NULL, 235.244, 7.176, 10.091, 3.539, 28.9302, 2.1494, 1.027, 333.09),
(1937, '加工調理食品及其他類', '冷凍素食熟水餃', '樣品狀態:冷凍包裝(素肉,麵粉,蔬菜等); 前處理描述:混合均勻打碎', NULL, 208.608, 7.155, 5.3845, 0.8902, 32.8818, 2.3204, 2.813, 491.42),
(1938, '加工調理食品及其他類', '冷凍冬菜蝦仁餛飩', '樣品狀態:冷凍包裝(蝦仁,魚肉,蔬菜,麵粉等); 前處理描述:混合均勻打碎', '雲吞', 190.861, 9.1, 6.2523, 2.1427, 24.5477, 2.3, 1.574, 316),
(1939, '加工調理食品及其他類', '冷凍豬肉餛飩', '樣品狀態:冷凍包裝(麵粉,鮮肉,蔬菜等); 前處理描述:混合均勻打碎', '雲吞', 239.68, 11.1, 12.5759, 4.4776, 20.5241, 2.8, 1.899, 428),
(1940, '加工調理食品及其他類', '冷凍菜肉餛飩', '樣品狀態:冷凍包裝(豬腿肉,麵粉,蔬菜等); 前處理描述:混合均勻打碎', '雲吞', 236.484, 9.1, 16.3367, 5.7031, 13.2633, 4.2, 0.897, 693),
(1941, '加工調理食品及其他類', '溫州餛飩', '樣品狀態:去湯; 前處理描述:混合均勻打碎', '大餛飩', 144.876, 6.5, 7.9351, 2.7551, 11.8649, 0.6, 0.759, 381),
(1942, '加工調理食品及其他類', '豬肉鍋貼', '前處理描述:混合均勻打碎', NULL, 237.648, 7.8, 11.2895, 3.5703, 26.2105, 1.5, 1.539, 314),
(1943, '加工調理食品及其他類', '熟水餃(高麗菜水餃)', '前處理描述:混合均勻打碎', NULL, 199.324, 7.359, 10.1201, 3.538, 19.7019, 1.7998, 2.966, 300.94),
(1944, '加工調理食品及其他類', '冷凍叉燒包', '樣品狀態:冷凍包裝(豬肉,麵粉等); 前處理描述:混合均勻打碎', NULL, 266.186, 8.8, 4.7573, 1.6898, 47.0427, 1.3, 14.812, 167),
(1945, '加工調理食品及其他類', '冷凍酸菜焢肉包子', '樣品狀態:冷凍包裝(麵粉,豬肉,酸菜等); 前處理描述:混合均勻打碎', NULL, 301.012, 8.641, 13.08, 5.1853, 37.1819, 2.0519, NULL, 342.59),
(1946, '加工調理食品及其他類', '冷凍芋泥包', '樣品狀態:冷凍包裝(麵粉,芋頭等); 前處理描述:混合均勻打碎', NULL, 263.026, 6.628, 3.5519, 1.3509, 51.1366, 2.4085, 11.608, 46.29),
(1947, '加工調理食品及其他類', '冷凍豆沙包', '樣品狀態:冷凍包裝(麵粉,紅豆沙等); 前處理描述:混合均勻打碎', NULL, 246.572, 7.4, 1.0745, 0.4627, 51.8255, 1.7, 13.221, 60),
(1948, '加工調理食品及其他類', '冷凍芝麻包', '樣品狀態:冷凍包裝(麵粉,芝麻粉等); 前處理描述:混合均勻打碎', NULL, 340.774, 7.2, 11.6748, 4.3553, 51.7252, 0.6, 11.362, 24),
(1949, '加工調理食品及其他類', '冷凍蓮蓉包', '樣品狀態:冷凍包裝; 前處理描述:混合均勻打碎', NULL, 292.3, 7.9, 5.5, 2.2638, 52.8, 2.4, NULL, 82),
(1950, '加工調理食品及其他類', '冷凍叉燒包子', '樣品狀態:冷凍包裝(叉燒肉,雞蛋,麵粉等); 前處理描述:混合均勻打碎', NULL, 266.8, 7.123, 6.0523, 2.1031, 45.9593, 2.3143, 9.755, 209.68),
(1951, '加工調理食品及其他類', '冷凍牛肉包子', '樣品狀態:冷凍包裝(牛肉,麵粉,雞蛋等); 前處理描述:混合均勻打碎', NULL, 268.683, 10.822, 4.57, 2.5426, 46.0662, 1.7776, NULL, 261.07),
(1952, '加工調理食品及其他類', '冷凍豬肉包子', '樣品狀態:冷凍包裝(豬肉,麵粉,蔬菜等); 前處理描述:混合均勻打碎', NULL, 266.278, 7.6235, 9.2144, 3.5159, 38.2137, 1.4932, 6.362, 229.885),
(1953, '加工調理食品及其他類', '冷凍豬肉湯包', '樣品狀態:冷凍包裝(豬後腿肉,麵粉等); 前處理描述:混合均勻打碎', NULL, 234.531, 10.1, 14.3461, 4.9365, 16.2539, 3, 1.636, 447),
(1954, '加工調理食品及其他類', '小籠包', '前處理描述:混合均勻打碎(豬肉,麵粉等)', NULL, 241.5, 9.6, 15.5, 5.5847, 15.9, 1.2, NULL, 248),
(1955, '加工調理食品及其他類', '冷凍素菜包子', '樣品狀態:冷凍包裝(麵粉,蔬菜等); 前處理描述:混合均勻打碎', NULL, 233.979, 8.6, 3.7557, 1.3583, 41.4443, 1.1, 3.73, 244),
(1956, '加工調理食品及其他類', '竹筍包', '前處理描述:混合均勻打碎', NULL, 208.523, 6.888, 5.4873, 1.4423, 32.8962, 2.5769, 3.755, 347.744),
(1957, '加工調理食品及其他類', '冷凍白饅頭', '樣品狀態:冷凍包裝(麵粉等); 前處理描述:混合均勻打碎', NULL, 279.071, 7.412, 2.37, 1.37, 57.0233, 2.2883, NULL, 91.13),
(1958, '加工調理食品及其他類', '白饅頭', '前處理描述:混合均勻打碎', NULL, 248.4, 8.1, 1.2, NULL, 51.3, 1.1, NULL, 182),
(1959, '加工調理食品及其他類', '芋頭饅頭', '前處理描述:混合均勻打碎', NULL, 154.754, 5.726, 0.6356, 0.2129, 31.5323, 2.2225, 8.453, 70.888),
(1960, '加工調理食品及其他類', '花捲', '前處理描述:混合均勻打碎', NULL, 227.43, 5.661, 1.8777, 0.6203, 46.9716, 1.4987, 3.428, 425.189),
(1961, '加工調理食品及其他類', '冷藏堅果饅頭', '樣品狀態:冷藏包裝(麵粉,核桃,枸杞,松子,杏仁,葵花子,葡萄乾等); 前處理描述:混合均勻打碎', NULL, 306.976, 9.608, 8.82, 2.9562, 47.2909, 5.458, NULL, 118.8),
(1962, '加工調理食品及其他類', '黑糖饅頭', '前處理描述:混合均勻打碎', NULL, 234.936, 6.784, 0.8754, 0.358, 49.9804, 2.4815, 9.062, 40.678),
(1963, '加工調理食品及其他類', '冷凍銀絲卷(奶黃)', '樣品狀態:冷凍包裝(麵粉,奶黃醬等); 前處理描述:混合均勻打碎', NULL, 282.936, 8.931, 3.25, 1.6352, 54.4906, 2.1944, NULL, 10.75),
(1964, '加工調理食品及其他類', '火腿蛋三明治', '前處理描述:混合均勻打碎(土司,火腿片,蛋,小黃瓜等)', NULL, 274.912, 10.851, 13.1789, 3.6073, 28.2245, 1.253, 3.971, 425.702);
INSERT INTO `nutrition_facts` (`id`, `food_category`, `sample_name`, `content_description`, `alias`, `kcal`, `protein`, `fat`, `saturated_fat`, `carbohydrate`, `fiber`, `total_sugar`, `sodium`) VALUES
(1965, '加工調理食品及其他類', '披薩(夏威夷)', '前處理描述:混合均勻打碎', NULL, 270.074, 12.017, 8.6978, 2.8221, 35.9315, 1.9667, 3.697, 436.71),
(1966, '加工調理食品及其他類', '冷凍披薩(黑胡椒火腿)', '樣品狀態:冷凍包裝(麵粉,奶油等); 前處理描述:混合均勻打碎', NULL, 209.866, 9.323, 6.85, 3.9086, 27.7311, 2.0365, NULL, 404.9),
(1967, '加工調理食品及其他類', '蔥油餅', '前處理描述:混合均勻打碎', NULL, 304.786, 8.314, 9.3165, 1.8539, 46.9205, 2.4497, 2.342, 257.42),
(1968, '加工調理食品及其他類', '冷凍蔥油餅', '樣品狀態:冷凍包裝(麵粉,蔥,雞蛋等); 前處理描述:混合均勻打碎', '蔥油派', 257.993, 9.09, 3.0749, 1.1559, 48.4898, 1.2704, 2.354, 601.975),
(1969, '加工調理食品及其他類', '冷凍蛋餅皮', '樣品狀態:冷凍包裝(麵粉,澱粉,蔥,植物油,豬油,白芝麻,鹽,糖等); 前處理描述:混合均勻打碎', NULL, 230.927, 5.719, 3.6779, 1.4014, 43.7374, 1.3492, 4.417, 291.391),
(1970, '加工調理食品及其他類', '燒餅', '前處理描述:混合均勻打碎', NULL, 322.7, 9.1, 9.1, 1.5434, 51.1, 1.2, NULL, 458),
(1971, '加工調理食品及其他類', '韭菜盒子', '前處理描述:混合均勻打碎', NULL, 217.13, 7.5, 12.1461, 2.6673, 19.4539, 1.4, 1.158, 287),
(1972, '加工調理食品及其他類', '大餅包小餅(紅豆)', '前處理描述:混合均勻打碎', NULL, 375.7, 8.3, 16.5, 3.0476, 48.5, 0.6, NULL, 135),
(1973, '加工調理食品及其他類', '水煎包', '前處理描述:混合均勻打碎', NULL, 166.466, 4.27, 5.3821, 1.5623, 25.2368, 1.9531, 2.229, 309.825),
(1974, '加工調理食品及其他類', '牛肉餡餅', '前處理描述:混合均勻打碎', NULL, 224.978, 9.6, 10.3556, 3.297, 23.3444, 1.2, 3.011, 350),
(1975, '加工調理食品及其他類', '豬肉餡餅', '前處理描述:混合均勻打碎', NULL, 327.225, 6.218, 23.3326, 7.3225, 23.0899, 1.4941, 1.578, 289.992),
(1976, '加工調理食品及其他類', '冷凍燒賣', '樣品狀態:冷凍包裝(豬後腿肉,蔬菜等); 前處理描述:混合均勻打碎', NULL, 187.8, 9.86, 9.705, 3.4047, 15.2537, 2.2063, NULL, 383.67),
(1977, '加工調理食品及其他類', '冷凍水晶包', '樣品狀態:冷凍包裝(豬肉,蝦仁,澱粉,香菇,高麗菜等); 前處理描述:混合均勻打碎', NULL, 211.026, 4.76, 7.81, 2.9899, 30.424, 1.469, NULL, 192.5),
(1978, '加工調理食品及其他類', '冷凍,水晶餃', '樣品狀態:冷凍包裝(豬肉,沙拉油,白蘿蔔乾,油蔥,醬油,調味料等); 前處理描述:混合均勻打碎', NULL, 190.188, 2.828, 3.5061, 1.5164, 36.8302, 0.726, 0.197, 347.62),
(1979, '加工調理食品及其他類', '油條', '前處理描述:混合均勻打碎', NULL, 551.307, 10.1, 40.1815, 7.0599, 37.3185, 1.6, 0.47, 341),
(1980, '加工調理食品及其他類', '冷凍春捲', '樣品狀態:冷凍包裝(麵粉,椰菜,筍,青豆,蘑菇等); 前處理描述:混合均勻打碎', NULL, 271.778, 5.143, 13.93, 2.6598, 31.4589, 2.8142, NULL, 449.4),
(1981, '加工調理食品及其他類', '蚵仔煎', '樣品狀態:不含醬料; 前處理描述:混合均勻打碎', NULL, 192.214, 4.9, 10.4428, 4.7713, 19.6572, 0.5, 0.278, 479),
(1982, '加工調理食品及其他類', '棺材板', '前處理描述:混合均勻打碎(土司片夾胡蘿蔔,蝦仁,花枝等)', NULL, 264.3, 7, 17.5, 5.3463, 19.7, 1.5, NULL, 299),
(1983, '加工調理食品及其他類', '油豆腐粉絲(阿給)', '前處理描述:混合均勻打碎(豆腐皮,粉絲等)', '阿給', 146.2, 6.9, 6.2, 1.2177, 15.7, 1.6, NULL, 162),
(1984, '加工調理食品及其他類', '冷凍可樂餅(奶汁)', '樣品狀態:冷凍包裝(牛奶,洋蔥,火腿,玉米等); 前處理描述:混合均勻打碎', NULL, 114.302, 3.64, 2.28, 1.5169, 19.8054, 1.1288, NULL, 338.07),
(1985, '加工調理食品及其他類', '芋圓', '樣品狀態:未烹調; 前處理描述:混合均勻打碎', NULL, 213.694, 0.923, 0.16, 0.058, 52.1405, 0.8117, 2.785, 1.58),
(1986, '加工調理食品及其他類', '粉圓', '樣品狀態:未烹調; 前處理描述:混合均勻打碎', NULL, 345.968, 0.244, 0, 0, 86.2479, 0.3497, 0, 13.35),
(1987, '加工調理食品及其他類', '冷凍甘薯條', '樣品狀態:冷凍包裝; 前處理描述:混合均勻打碎', '薯條', 181.723, 1.772, 6.5214, 1.5666, 28.9855, 3.4577, 16.871, 67.17),
(1988, '加工調理食品及其他類', '冷凍馬鈴薯條', '樣品狀態:冷凍包裝; 前處理描述:混合均勻打碎', '薯條', 151.07, 2.2, 4.486, 1.2215, 25.474, 3.45, 0, 17.5),
(1989, '加工調理食品及其他類', '西谷米', '樣品狀態:未烹調; 前處理描述:混合均勻打碎', NULL, 360.292, 0.1, 0.1, NULL, 89.7479, 0.2545, NULL, 14.02),
(1990, '加工調理食品及其他類', '台式泡菜', '前處理描述:混合均勻打碎', NULL, 58.8166, 0.9, 0.2998, 0.1294, 13.1296, 0.8158, 11.16, 329.94),
(1991, '加工調理食品及其他類', '黃金泡菜', '前處理描述:混合均勻打碎', NULL, 110.929, 2.426, 5.6872, 0.9475, 12.51, 1.6735, 6.251, 496.82),
(1992, '加工調理食品及其他類', '韓式泡菜', '前處理描述:混合均勻打碎(大白菜,辣椒粉,大蒜,魚露,蔥,洋蔥,薑,胡蘿蔔,鹽,糖等)', NULL, 35.1609, 2.014, 0.4181, 0.1053, 5.8355, 2.8003, 0.678, 486.892),
(1993, '加工調理食品及其他類', '花瓜罐頭', '樣品狀態:罐頭製品(花瓜,醬油等); 前處理描述:混合均勻打碎', NULL, 88.7205, 2.9, 0.2241, 0.1359, 18.7759, 1, 14.458, 1458),
(1994, '加工調理食品及其他類', '冷凍洋蔥圈', '樣品狀態:冷凍包裝(洋蔥,麵粉,玉米粉等); 前處理描述:混合均勻打碎', NULL, 281.106, 3.977, 11.0468, 2.369, 41.4442, 2.7745, 4.011, 502.95),
(1995, '加工調理食品及其他類', '醃辣椒', '前處理描述:混合均勻打碎(辣椒,水,醬油,糖,鹽,乳酸,乳酸鈣)', '剝皮辣椒', 53.1436, 1.931, 0.316, 0.1525, 10.6439, 0.8133, 6.823, 1520.48),
(1996, '加工調理食品及其他類', '桂竹筍片', '前處理描述:混合均勻打碎(桂竹筍, 鹽, 香料等)', NULL, 19.0808, 1.011, 0.218, NULL, 3.2687, 2.4363, NULL, 815.464),
(1997, '加工調理食品及其他類', '麻竹筍干', '前處理描述:混合均勻打碎(麻竹筍, 鹽, 漂白劑等)', NULL, 400, NULL, NULL, NULL, 100, NULL, NULL, NULL),
(1998, '加工調理食品及其他類', '薤', '樣品狀態:醃漬品; 前處理描述:混合均勻打碎', '蕗蕎,薤頭,火蔥,蕎蔥,大韭(韮),露京,蕎頭,叫頭', 11.2, 0.54, 0.16, NULL, 1.9, 1.76, NULL, 2586.3),
(1999, '加工調理食品及其他類', '甘藍乾', '樣品狀態:鹽漬; 前處理描述:混合均勻打碎', '高麗菜乾', 194.4, 7.22, 1.12, NULL, 38.86, 3, NULL, 3853.7),
(2000, '加工調理食品及其他類', '酸甘藍菜', '樣品狀態:醃漬品; 前處理描述:混合均勻打碎', '酸高麗菜', 24.4303, 1.449, 0.1999, 0.0556, 4.2088, 3.3511, 0.164, 497.2),
(2001, '加工調理食品及其他類', '梅乾菜', '樣品狀態:鹽漬發酵; 前處理描述:混合均勻打碎', NULL, 115.632, 5.4865, 1.1481, NULL, 20.8382, 12.8409, NULL, 11554.9),
(2002, '加工調理食品及其他類', '榨菜', '樣品狀態:鹽漬發酵; 前處理描述:混合均勻打碎', '榨菜藺蕓苔,四川榨菜,疙瘩菜,稜角菜,筆架菜,香爐菜,瘤菜', 26.9756, 1.287, 0.3592, 0.1136, 4.6487, 2.9452, 0, 2789.96),
(2003, '加工調理食品及其他類', '酸菜', '樣品狀態:鹽漬發酵; 前處理描述:混合均勻打碎', '鹹菜,鹼菜,醃(大/鹹)酸菜,大鹹菜,鹹菜仁', 18.999, 0.8425, 0.3202, 0.0871, 3.1868, 2.3128, 0, 1447.24),
(2004, '加工調理食品及其他類', '醃漬冬瓜', '樣品狀態:醃漬品,大果; 前處理描述:混合均勻打碎', '白瓜,東瓜,枕瓜,水芝,地芝', 27.6, 2.47, 0.16, NULL, 4.07, 1.9, NULL, 3690),
(2005, '加工調理食品及其他類', '醃漬花胡瓜', '樣品狀態:醃漬品; 前處理描述:混合均勻打碎', '小黃瓜,花瓜,小胡瓜,小瓜,小刺瓜,水胡瓜', 88.95, 3, 0.51, NULL, 18.09, 2, NULL, 1603),
(2006, '加工調理食品及其他類', '醃漬越瓜', '樣品狀態:醃漬品; 前處理描述:混合均勻打碎', '醃瓜,菴瓜,梢瓜,酥瓜,甜瓜,羊角瓜,稍瓜,生瓜,白瓜,青瓜,百香胡瓜', 17.95, 1.1, 0.15, NULL, 3.05, 1.3, NULL, 873),
(2007, '加工調理食品及其他類', '銀耳罐頭', '樣品狀態:罐頭製品; 前處理描述:瀝除水分,混合均勻打碎', '白木耳,雪耳', 48.97, 0.08, 0.09, NULL, 11.96, 1.39, NULL, 7.4),
(2008, '加工調理食品及其他類', '草菇罐頭', '樣品狀態:罐頭製品; 前處理描述:瀝除水分,混合均勻打碎', '蘭花菇,美味草菇,包腳菇,中國蘑菇,稈(麻/貢)菇,南華菇,家生菇(小包腳菇)', 35.7018, 3.2895, 0.105, 0, 5.3997, 3.1692, NULL, 305.719),
(2009, '加工調理食品及其他類', '醃漬香菇', '樣品狀態:醃漬物; 前處理描述:混合均勻打碎', '冬(北/花/厚/毛)菇,椎茸,香蕈(信/椹),合蕈', 55.76, 3.04, 0.12, NULL, 10.63, 4.55, NULL, 723),
(2010, '加工調理食品及其他類', '秀珍菇罐頭', '樣品狀態:罐頭製品(秀珍菇,鹽等); 前處理描述:瀝除水分,混合均勻打碎', '平菇,小平菇,側耳平菇,蠔菇,袖珍(鮑魚)菇(側耳)', 29.9832, 1.653, 0.5, NULL, 4.7178, 5.5651, NULL, 245.255),
(2011, '加工調理食品及其他類', '金針菇罐頭', '樣品狀態:罐頭製品(金針菇,鹽,檸檬酸等); 前處理描述:瀝除水分,混合均勻打碎', '金(冬/榎/朴)菇,金絲菇,金菇菜,秋葷,樸蕈構菌,毛柄金線菇,菌子(絨柄金錢菇)', 26.9857, 1.724, 0.2225, NULL, 4.5218, 3.8117, NULL, 959.035),
(2012, '加工調理食品及其他類', '洋菇罐頭', '樣品狀態:罐頭製品; 前處理描述:瀝除水分,混合均勻打碎', '西洋蘑菇(蘑菇,雙孢蘑菇)', 31.1722, 2.912, 0.265, 0, 4.2848, 3.2732, NULL, 532.274),
(2013, '加工調理食品及其他類', '猴頭菇罐頭', '樣品狀態:罐頭製品; 前處理描述:瀝除水分,混合均勻打碎', '猴頭蘑,刺蝟菌,蝟菌,花菜菇,圓頭菇,陰陽蘑,對臉蘑', 30.7164, 0.969, 0.106, 0, 6.4716, 1.7274, NULL, 174.235),
(2014, '加工調理食品及其他類', '高纖胚芽冬粉', '前處理描述:混合均勻打碎(純綠豆,綠豆胚芽及外皮)', '粉絲', 363.631, 0.597, 0.16, NULL, 89.9508, 4.0294, NULL, 2.47),
(2015, '加工調理食品及其他類', '冬粉', '前處理描述:混合均勻打碎(綠豆,澱粉,水等)', '粉絲', 351.37, 0.143, 0.09, NULL, 87.497, 1.4209, NULL, 9.73),
(2016, '加工調理食品及其他類', '寬粉', '前處理描述:混合均勻打碎(綠豆澱粉,馬鈴薯澱粉等)', '寬條冬粉', 349.427, 0.136, 0.1265, 0.0531, 86.9362, 1.0284, 0, 4.293),
(2017, '加工調理食品及其他類', '佃煮黑豆', '前處理描述:混合均勻打碎(黑豆,糖,醬油等)', NULL, 271.451, 10.498, 6.163, 0.9161, 43.4979, 7.0552, 10.398, 250.605),
(2018, '加工調理食品及其他類', '豆干絲', '前處理描述:混合均勻打碎(黃豆,鹽,調味料等)', NULL, 170.11, 18.31, 8.63, 1.4317, 4.8, 2.55, NULL, 548.85),
(2019, '加工調理食品及其他類', '五香豆干', '前處理描述:混合均勻打碎(黃豆,鹽,調味料等)', NULL, 196.758, 19.27, 10.5596, 1.7318, 6.1604, 2.2, 0.392, 445.47),
(2020, '加工調理食品及其他類', '小方豆干', '前處理描述:混合均勻打碎(黃豆,鹽,調味料等)', NULL, 161.04, 17.4, 8.6, 1.3003, 3.51, 3.26, NULL, 115.56),
(2021, '加工調理食品及其他類', '黑豆干', '前處理描述:混合均勻打碎(黃豆,凝固劑,調味料,水等)', NULL, 197.087, 19.029, 12.5251, 2.2208, 2.0613, NULL, 0.133, 122.909),
(2022, '加工調理食品及其他類', '豆腐皮', '前處理描述:混合均勻打碎', '豆皮', 209.417, 25.29, 10.9777, 1.7236, 2.3644, 0.6314, 0, 22.56),
(2023, '加工調理食品及其他類', '日式炸豆皮', '前處理描述:混合均勻打碎', NULL, 387.958, 19.17, 32.42, 5.1495, 4.8745, 2.3363, NULL, 1.23),
(2024, '加工調理食品及其他類', '豆豉', '前處理描述:混合均勻打碎(黑豆.鹽.苯甲酸等)', '蔭豉', 236.642, 20.3763, 11.5409, 1.9129, 12.8171, 10.7516, 0, 6075.32),
(2025, '加工調理食品及其他類', '豆棗', '前處理描述:混合均勻打碎(黃豆等)', NULL, 420.323, 11.749, 19.245, 3.1788, 50.0304, 0.8118, 37.521, 854.29),
(2026, '加工調理食品及其他類', '百頁豆腐', '前處理描述:混合均勻打碎(黃豆,鹽等)', '千張豆腐', 196.424, 13.38, 13.082, 2.1289, 6.2915, 0.5147, 0.119, 425.41),
(2027, '加工調理食品及其他類', '傳統豆腐', '前處理描述:混合均勻打碎', '板豆腐', 88.41, 8.46, 3.41, 1.0387, 5.97, 0.56, NULL, 2.15),
(2028, '加工調理食品及其他類', '傳統豆腐(2022年取樣)', '前處理描述:混合均勻打碎', '板豆腐', 95.7024, 9.58, 5.5156, 0.9762, 1.9355, 1.5621, 0, 6.71),
(2029, '加工調理食品及其他類', '冷凍豆腐', '樣品狀態:冷凍包裝; 前處理描述:混合均勻打碎', '凍豆腐', 130.857, 12.919, 7.0532, 1.3088, 3.9256, 2.1743, 0.602, 8.42),
(2030, '加工調理食品及其他類', '小三角油豆腐', '前處理描述:混合均勻打碎(黃豆,油脂等)', NULL, 159.746, 12.723, 13.3423, 2.3443, 0, 0.6943, 0, 1.12),
(2031, '加工調理食品及其他類', '嫩豆腐', '前處理描述:混合均勻打碎', NULL, 53.1199, 4.93, 2.9943, 0.5185, 1.6128, 0.8135, 0.572, 32.02),
(2032, '加工調理食品及其他類', '雞蛋豆腐', '前處理描述:混合均勻打碎(黃豆,雞蛋,鹽,調味料等)', NULL, 79.3506, 6.867, 4.577, 1.3103, 2.6724, 0.3584, 0.73, 306.88),
(2033, '加工調理食品及其他類', '麻油辣腐乳', '前處理描述:混合均勻打碎(豆腐,辣椒,麻油等)', NULL, 106.985, 8.96, 5.7731, 1.022, 4.7969, 0.6527, 0.354, 3675.05),
(2034, '加工調理食品及其他類', '素肉', '樣品狀態:冷藏產品; 前處理描述:混合均勻打碎', NULL, 210.238, 23.939, 10.0575, 1.7738, 5.9912, 5.4867, 1.532, 730.73),
(2035, '加工調理食品及其他類', '冷凍素雞塊', '樣品狀態:冷凍包裝(黃豆,大豆蛋白,麵衣等); 前處理描述:混合均勻打碎', NULL, 205.83, 14.174, 8.12, 1.2682, 19.0134, 1.2432, NULL, 455.61),
(2036, '加工調理食品及其他類', '花生麵筋罐頭', '樣品狀態:罐頭製品(麵粉,花生等); 前處理描述:混合均勻打碎', NULL, 205.829, 11, 11.0858, 1.9522, 15.5142, 1.1, 8.072, 778),
(2037, '加工調理食品及其他類', '香菇麵筋罐頭', '樣品狀態:罐頭製品(麵粉,香菇等); 前處理描述:混合均勻打碎', NULL, 192.4, 10.7, 10, 1.574, 14.9, 0.5, NULL, 916),
(2038, '加工調理食品及其他類', '花豆罐頭(糖漬)', '樣品狀態:罐頭製品(花豆,糖等); 前處理描述:混合均勻打碎', '紅花豆,紅(赤)花菜豆,花仔(阿/柳)豆', 204.307, 7.572, 0, 0, 43.5047, 6.4779, NULL, 7.1812),
(2039, '加工調理食品及其他類', '紅豆罐頭(糖漬)', '樣品狀態:罐頭製品(紅豆,糖等); 前處理描述:混合均勻打碎', '小豆,赤小豆,赤豆,通常小豆,小紅豆,紅小豆', 232.539, 8.02, 0.283, 0, 49.4781, 5.4855, NULL, 7.8223),
(2040, '加工調理食品及其他類', '甘納豆', '前處理描述:混合均勻打碎(甘納豆,糖及植物油等)', NULL, 333.143, 6.636, 0.9712, 0.1809, 74.4646, 7.5526, 51.033, 183.925),
(2041, '加工調理食品及其他類', '豌豆仁罐頭', '樣品狀態:罐頭製品(青豆仁,鹽,糖等); 前處理描述:混合均勻打碎', '荷蓮豆仁,荷仁豆仁,荷蘭豆仁,花蓮豆仁,飛龍豆仁,青豆仁,胡豆仁,畢豆仁,宛豆仁,孫豆仁,丸豆仁,留', 125.532, 7.17, 0.9235, 0, 22.1351, 5.6578, NULL, 210.562),
(2042, '加工調理食品及其他類', '鹽酥蠶豆', '前處理描述:去外殼,混合均勻打碎(蠶豆,鹽,油脂,調味料等)', '蠶豆酥,蠶豆子,蠶豆花', 480.589, 26.928, 20.865, 6.3553, 46.2731, 23.051, NULL, 385.95),
(2043, '加工調理食品及其他類', '豆漿', '樣品狀態:包裝產品(黃豆,水,糖等); 前處理描述:混合均勻', '豆奶', 60.0273, 3.1637, 1.2845, 0.254, 8.953, 2.0531, 5.117, 36.4503),
(2044, '加工調理食品及其他類', '雞蛋豆漿', '樣品狀態:包裝產品(黃豆,雞蛋香精,糖等); 前處理描述:混合均勻', '雞蛋豆奶', 55.66, 1.85, 1.26, 0.2134, 9.23, 0.24, NULL, 23.68),
(2045, '加工調理食品及其他類', '鹹豆漿', '樣品狀態:散裝(含油條,菜脯等); 前處理描述:混合均勻打碎', NULL, 37, 3.5, 1.8, 0.3501, 1.7, 0.1, NULL, 198),
(2046, '加工調理食品及其他類', '豆漿優酪乳', '前處理描述:混合均勻(黃豆,砂糖,果膠,香料等)', '豆奶優酪乳', 70.2183, 1.98, 1.1679, 0.3513, 12.9468, 0.9445, 7.161, 7.961),
(2047, '加工調理食品及其他類', 'DHA豆奶', '前處理描述:混合均勻(黃豆,砂糖,牛乳)', NULL, 43.502, 1.72, 0.5, NULL, 8.0305, 0.0918, NULL, 34.3),
(2048, '加工調理食品及其他類', '豆漿粉', '前處理描述:混合均勻', '豆奶粉', 433.698, 37.39, 17.11, 2.6056, 32.5371, 12.5824, NULL, 0),
(2049, '加工調理食品及其他類', '叉燒肉', '樣品狀態:真空包裝(豬肉,鹽,糖,醬油,紅麴醬,調味料等); 前處理描述:混合均勻打碎', NULL, 252.562, 17.179, 13.0929, 4.958, 16.5024, NULL, 14.883, 840.564),
(2050, '加工調理食品及其他類', '切片火腿(牛肉)', '前處理描述:混合均勻打碎(牛肉,鹽,胡椒,黃豆蛋白,澱粉等)', '三明治火腿,火腿片', 121.047, 15.853, 2.22, 1.1191, 9.4137, NULL, NULL, 1200.2),
(2051, '加工調理食品及其他類', '切片火腿(豬肉)', '前處理描述:混合均勻打碎(豬肉,鹽,糖等)', '三明治火腿,火腿片', 146.57, 16.525, 4.9249, 1.8378, 9.0365, NULL, 2.158, 1005.78),
(2052, '加工調理食品及其他類', '切片火腿(雞肉)', '前處理描述:混合均勻打碎(雞肉,鹽,糖,胡椒等)', '三明治火腿,火腿片', 148.408, 15.264, 5.264, 1.7672, 9.9941, NULL, 3.883, 1040.44),
(2053, '加工調理食品及其他類', '條狀火腿(牛肉,黑胡椒)', '前處理描述:混合均勻打碎(牛肉,鹽,糖,黑胡椒等)', NULL, 112.89, 18.85, 2.33, 1.0217, 4.13, NULL, NULL, 1125.1),
(2054, '加工調理食品及其他類', '條狀火腿(豬肉)', '前處理描述:混合均勻打碎(豬肉,鹽,糖,澱粉,黃豆蛋白,食品添加物等)', NULL, 145.456, 16.2425, 3.8187, 1.4312, 11.5293, NULL, 3.843, 1029.12),
(2055, '加工調理食品及其他類', '醬肘子', '樣品狀態:豬肉火腿; 前處理描述:混合均勻打碎', '醬肘花,醬汁燒蹄膀', 133.985, 18.971, 6.56, 2.1934, 0, NULL, NULL, 670.87),
(2056, '加工調理食品及其他類', '培根', '樣品狀態:生(豬腰肉,鹽,糖,維生素C,黃豆蛋白等); 前處理描述:混合均勻打碎', '三層煙肉', 372.469, 13.5023, 35.6209, 13.2948, 0, NULL, 1.377, 609.537),
(2057, '加工調理食品及其他類', '臘肉(五花肉)', '樣品狀態:生(豬肉,鹽,糖,味精,食品添加物等); 前處理描述:混合均勻打碎', NULL, 524.6, 18.45, 49.0067, 18.8278, 2.435, NULL, 0, 1539.35),
(2058, '加工調理食品及其他類', '臘肉(腿肉)', '樣品狀態:生(豬肉,鹽,糖,味精,食品添加物等); 前處理描述:混合均勻打碎', NULL, 376.94, 26.74, 27.1647, 9.3668, 6.3743, NULL, 0, 3219.54),
(2059, '加工調理食品及其他類', '滷牛筋', '前處理描述:混合均勻打碎', '滷蹄筋', 119.428, 21.099, 2.7538, 0.7733, 2.562, NULL, 0, 524.391),
(2060, '加工調理食品及其他類', '滷豬腳', '前處理描述:去骨,混合均勻打碎', NULL, 237.4, 28.4, 15.4, 6.9423, 0, NULL, NULL, 187),
(2061, '加工調理食品及其他類', '醃燻豬肝', '樣品狀態:豬肝製品; 前處理描述:混合均勻打碎', NULL, 166.545, 26.825, 4.72, 1.8302, 4.1913, NULL, NULL, 904.52),
(2062, '加工調理食品及其他類', '膽肝', '樣品狀態:豬肝製品; 前處理描述:混合均勻打碎', '鹹豬肝,粉肝,柴肝', 251.5, 31.2, 7.9, 3.3765, 13.9, NULL, NULL, 3204),
(2063, '加工調理食品及其他類', '片狀肉乾(牛肉)', '樣品狀態:牛肉乾(牛肉,砂糖,果醬,醬油,食品添加物等); 前處理描述:混合均勻打碎', '牛肉干', 335.196, 30.3015, 5.196, 2.3408, 41.8066, NULL, 18.209, 1317.25),
(2064, '加工調理食品及其他類', '片狀肉乾(牛肉,辣味)', '樣品狀態:牛肉乾(牛肉,醬油,砂糖,食品添加物等); 前處理描述:混合均勻打碎', '辣味牛肉干', 334.923, 37.971, 7.0347, 3.4106, 29.9318, NULL, 24.387, 1537.36),
(2065, '加工調理食品及其他類', '片狀肉乾(豬肉)', '前處理描述:混合均勻打碎', '豬肉干', 329.198, 30.019, 5.0233, 1.8128, 40.978, NULL, 26.77, 1177.11),
(2066, '加工調理食品及其他類', '條狀肉乾(豬肉)', '樣品狀態:豬肉乾(豬肉,醬油,砂糖,食品添加物等); 前處理描述:混合均勻打碎', '豬肉乾,豬肉干', 344.567, 43.237, 7.9025, 3.2013, 25.1242, NULL, 26.108, 1324.51),
(2067, '加工調理食品及其他類', '牛肉香腸', '樣品狀態:生; 前處理描述:混合均勻打碎', NULL, 298.071, 20.656, 20.45, 8.6888, 7.8492, NULL, NULL, 792.34),
(2068, '加工調理食品及其他類', '香腸', '樣品狀態:生(豬肉,豬腸衣,鹽,糖,食品添加物等); 前處理描述:混合均勻打碎', NULL, 354.246, 16.996, 26.3308, 10.0154, 12.3213, NULL, 10.166, 1025.78),
(2069, '加工調理食品及其他類', '香腸(蒜味)', '樣品狀態:生(豬肉,豬腸衣,鹽,糖,蒜粉,食品添加物等); 前處理描述:混合均勻打碎', NULL, 387.293, 16.6335, 27.7526, 10.2491, 17.7463, NULL, 12.537, 1021.19),
(2070, '加工調理食品及其他類', '蒟蒻香腸(蒜味)', '樣品狀態:生(豬肉,豬腸衣,蒟蒻,肉精香料等); 前處理描述:混合均勻打碎', NULL, 288.736, 19.4, 14.87, 5.4617, 19.3264, NULL, NULL, 1106.41),
(2071, '加工調理食品及其他類', '小巧香腸', '樣品狀態:生(豬肉,雞肉等); 前處理描述:混合均勻打碎', '小香腸', 362.076, 15.11, 28.2189, 10.441, 11.9165, NULL, 12.465, 911.75),
(2072, '加工調理食品及其他類', '雞肉香腸(大)', '樣品狀態:生(雞肉,鹽,糖,油脂,調味料,食品添加物等); 前處理描述:混合均勻打碎', NULL, 283.232, 22.39, 16.28, 4.9062, 11.7881, NULL, NULL, 913.87),
(2073, '加工調理食品及其他類', '雞肉香腸(小)', '樣品狀態:生(雞肉,鹽,糖,油脂,調味料,食品添加物等); 前處理描述:混合均勻打碎', NULL, 458.564, 13.904, 37.72, 13.895, 15.8669, NULL, NULL, 699.43),
(2074, '加工調理食品及其他類', '熱狗', '樣品狀態:生(豬肉,鹽,糖,澱粉,黃豆蛋白,食品添加物等); 前處理描述:混合均勻打碎', NULL, 257.314, 13.285, 18.1331, 6.5717, 10.2441, NULL, 2.883, 607.45),
(2075, '加工調理食品及其他類', '德國香腸', '樣品狀態:生(豬肉,羊腸衣,鹽,糖,維生素C,天然色素(胡蘿蔔素)等); 前處理描述:混合均勻打碎', NULL, 274.7, 15.908, 21.4248, 7.9019, 4.5613, 1.4157, 1.707, 546.751),
(2076, '加工調理食品及其他類', '冷凍小香腸', '樣品狀態:冷凍包裝(豬肉,牛肉等); 前處理描述:混合均勻打碎', NULL, 248.876, 14.82, 17.76, 6.9939, 7.4389, 0.42, NULL, 722.43),
(2077, '加工調理食品及其他類', '冷凍珍珠丸', '樣品狀態:冷凍包裝(豬肉,米等); 前處理描述:混合均勻打碎', NULL, 225.444, 9.523, 11.516, 4.0438, 20.927, 0.9859, 2.142, 313.407),
(2078, '加工調理食品及其他類', '冷凍貢丸', '樣品狀態:冷凍包裝(豬後腿肉等); 前處理描述:混合均勻打碎', NULL, 244.107, 16.64, 20.2925, 7.3647, 0, NULL, 1.542, 580.295),
(2079, '加工調理食品及其他類', '冷凍雞肉丸', '樣品狀態:冷凍包裝(雞肉,澱粉等); 前處理描述:混合均勻打碎', NULL, 201.936, 10.535, 12.3, 4.3239, 12.2739, NULL, NULL, 597.14),
(2080, '加工調理食品及其他類', '冷凍牛肉漢堡肉', '樣品狀態:冷凍包裝(牛肉,禽肉,麵包粉,洋蔥,蕃茄醬,磷酸鹽類等); 前處理描述:混合均勻打碎', NULL, 249.417, 14.413, 18.515, 9.2518, 6.2825, 1.5331, 0, 301.709),
(2081, '加工調理食品及其他類', '冷凍雞塊', '樣品狀態:冷凍包裝(雞胸肉,腿肉等); 前處理描述:混合均勻打碎', NULL, 227.676, 15.3, 12.8951, 5.501, 12.6049, NULL, 2.148, 596),
(2082, '加工調理食品及其他類', '豬肉脯', '樣品狀態:豬肉鬆; 前處理描述:混合均勻打碎', '豬肉絨', 440.7, 33.4, 25.1, 9.2694, 20.3, NULL, NULL, 1518),
(2083, '加工調理食品及其他類', '豬肉酥', '樣品狀態:豬肉鬆; 前處理描述:混合均勻打碎', '豬肉鬆', 512.982, 33, 28.2764, 9.2153, 31.6236, NULL, 25.05, 1467),
(2084, '加工調理食品及其他類', '雞肉酥', '樣品狀態:雞肉鬆(雞肉,醬油等); 前處理描述:混合均勻打碎', '雞肉鬆', 450.61, 26.683, 14.56, 2.4687, 53.2094, 4.4898, NULL, 1644.33),
(2085, '加工調理食品及其他類', '肉羹', '前處理描述:混合均勻打碎(豬肉,背脂,澱粉,糖,鹽,味精,蔥酥,香辛調味料等)', NULL, 246.773, 9.718, 14.7047, 5.3187, 18.8898, 0.8867, 1.647, 511.838),
(2086, '加工調理食品及其他類', '冷凍咕咾肉', '樣品狀態:冷凍包裝(豬肉,洋蔥,青椒等); 前處理描述:混合均勻打碎', NULL, 184.3, 6.4, 9.5, 2.4691, 18.3, 1.5, NULL, 395),
(2087, '加工調理食品及其他類', '豬腳凍', '樣品狀態:不須加熱即可食用; 前處理描述:混合均勻打碎', NULL, 144.6, 16.6, 7.8, 2.6957, 2, NULL, NULL, 726),
(2088, '加工調理食品及其他類', '冷凍花枝丸', '樣品狀態:冷凍包裝(花枝肉,板油,澱粉等); 前處理描述:混合均勻打碎', NULL, 165.672, 12.728, 6.9593, 2.655, 13.0316, 1.8595, 2.615, 455.549),
(2089, '加工調理食品及其他類', '冷凍虱目魚丸', '樣品狀態:冷凍包裝(虱目魚,澱粉等); 前處理描述:混合均勻打碎', NULL, 205.776, 13.6643, 11.8872, 4.3881, 11.0335, 1.5143, 4.474, 551.103),
(2090, '加工調理食品及其他類', '冷凍文蛤丸', '樣品狀態:冷凍包裝(文蛤,虱目魚肉等); 前處理描述:混合均勻打碎', NULL, 210.619, 16.157, 9.21, 3.412, 15.7752, NULL, NULL, 565.24),
(2091, '加工調理食品及其他類', '冷凍旗魚丸', '樣品狀態:冷凍包裝(旗魚肉,澱粉等); 前處理描述:混合均勻打碎', NULL, 159.672, 12.818, 6.6966, 2.5233, 12.0327, 0.8412, 4.927, 700.047),
(2092, '加工調理食品及其他類', '冷凍鱈魚丸', '樣品狀態:冷凍包裝(鱈魚,澱粉等); 前處理描述:混合均勻打碎', NULL, 98.8567, 8.525, 2.4255, 0.9541, 10.7318, NULL, 3.862, 458.835),
(2093, '加工調理食品及其他類', '冷凍蝦丸', '樣品狀態:冷凍包裝(蝦肉,魚漿等); 前處理描述:混合均勻打碎', NULL, 122.746, 10.7615, 2.335, 0.9353, 14.6713, NULL, NULL, 779.98),
(2094, '加工調理食品及其他類', '冷凍花枝排', '樣品狀態:冷凍包裝(花枝肉,魚漿,洋蔥,麵包屑,澱粉,調味料,磷酸鹽等); 前處理描述:混合均勻打碎', NULL, 187.162, 5.491, 7.2939, 2.7275, 24.8882, 1.3152, 3.18, 648.203),
(2095, '加工調理食品及其他類', '冷凍鮪排', '樣品狀態:冷凍包裝(鮪魚,魚漿等); 前處理描述:混合均勻打碎', NULL, 143.3, 13.4, 0.9, 0.3132, 20.4, NULL, NULL, 664),
(2096, '加工調理食品及其他類', '冷凍蝦餅', '樣品狀態:冷凍包裝(蝦仁,鱈魚,馬蹄,豌豆,裹麵等); 前處理描述:混合均勻打碎', NULL, 126.5, 9.6, 2.1, 0.4675, 17.3, 1.6, NULL, 337),
(2097, '加工調理食品及其他類', '冷凍干貝酥', '樣品狀態:冷凍包裝(鱈魚肉,卵白,澱粉,干貝及抽出物等); 前處理描述:混合均勻打碎', NULL, 146.138, 8.33, 0.21, 0.0765, 27.7321, 1.0331, NULL, 802.07),
(2098, '加工調理食品及其他類', '冷凍花枝塊', '樣品狀態:冷凍包裝(花枝,魷魚,魚漿等); 前處理描述:混合均勻打碎', NULL, 180.242, 11.25, 7.45, 1.4744, 17.0479, 0.7711, NULL, 507.69),
(2099, '加工調理食品及其他類', '冷凍旗魚塊', '樣品狀態:冷凍包裝(旗魚肉,澱粉等); 前處理描述:混合均勻打碎', NULL, 177.977, 15.261, 6.48, 1.3327, 14.6533, NULL, NULL, 422.67),
(2100, '加工調理食品及其他類', '冷凍蚵捲', '樣品狀態:冷凍包裝(蚵,韭菜,豆皮等); 前處理描述:混合均勻打碎', NULL, 213.419, 6.93, 17.5431, 6.5961, 6.9528, 2.2674, 4.128, 463.18),
(2101, '加工調理食品及其他類', '冷凍魚捲', '樣品狀態:冷凍包裝(旗魚,鱈魚,馬蹄,裹麵等); 前處理描述:混合均勻打碎', NULL, 126.3, 13.8, 0.3, NULL, 17.1, 0.7, NULL, 401),
(2102, '加工調理食品及其他類', '冷凍蝦捲', '樣品狀態:冷凍包裝(魚漿,蝦,豬脂,馬蹄,紅蘿蔔,蒜頭,蔥,豆皮等); 前處理描述:混合均勻打碎', NULL, 155.935, 10.281, 5.6677, 1.986, 15.9505, 1.4472, 2.706, 666.685),
(2103, '加工調理食品及其他類', '冷凍魷魚圈', '樣品狀態:冷凍包裝(魷魚,魚漿等); 前處理描述:混合均勻打碎', NULL, 143.2, 15.7, 0.4, NULL, 19.2, NULL, NULL, 443),
(2104, '加工調理食品及其他類', '冷凍花枝餃', '樣品狀態:冷凍包裝(海饅,花枝肉,澱粉等); 前處理描述:混合均勻打碎', NULL, 176.961, 12.356, 5.6185, 2.0591, 19.2426, NULL, 2.801, 723.36),
(2105, '加工調理食品及其他類', '冷凍香菇餃', '樣品狀態:冷凍包裝(豬肉,香菇,鱈魚等); 前處理描述:混合均勻打碎', NULL, 232.83, 12.3, 15.29, 5.7116, 11.5049, 1.1241, NULL, 672.55),
(2106, '加工調理食品及其他類', '冷凍蛋餃', '樣品狀態:冷凍包裝(雞蛋,豬肉等); 前處理描述:混合均勻打碎', NULL, 183.133, 12.07, 14.0587, 5.0643, 2.0813, 0.53, 1.31, 472.36),
(2107, '加工調理食品及其他類', '冷凍雪螺餃', '樣品狀態:冷凍包裝(魚漿,雪螺,澱粉等); 前處理描述:混合均勻打碎', NULL, 203.61, 11.59, 10.03, 3.1406, 16.745, 1.0581, NULL, 788.07),
(2108, '加工調理食品及其他類', '冷凍魚餃', '樣品狀態:冷凍包裝(海鰻,豬肉,澱粉等); 前處理描述:混合均勻打碎', NULL, 277.484, 12.5485, 19.5285, 8.6234, 12.8833, NULL, 1.168, 663.36),
(2109, '加工調理食品及其他類', '冷凍蝦餃', '樣品狀態:冷凍包裝(海鰻,蝦仁,豬肉,澱粉等); 前處理描述:混合均勻打碎', NULL, 273.335, 11.3965, 19.3, 7.176, 13.5122, NULL, NULL, 621.74),
(2110, '加工調理食品及其他類', '冷凍燕餃', '樣品狀態:冷凍包裝(豬後腿肉,澱粉等); 前處理描述:混合均勻打碎', NULL, 321.498, 12.8415, 23.5713, 9.0025, 14.4976, NULL, 1.703, 603.7),
(2111, '加工調理食品及其他類', '冷凍蟹味棒', '樣品狀態:冷凍包裝(魚漿等); 前處理描述:混合均勻打碎', '蟹肉棒', 117.791, 9.3, 0.6783, 0.1697, 18.6217, NULL, 3.138, 694),
(2112, '加工調理食品及其他類', '冷凍魚卵卷', '樣品狀態:冷凍包裝(魚卵,魚漿等); 前處理描述:混合均勻打碎', NULL, 115.338, 12.903, 0.1823, 0.0557, 15.5213, NULL, 3.737, 830.105),
(2113, '加工調理食品及其他類', '魚板', '前處理描述:混合均勻打碎', NULL, 127.792, 9.986, 1.9501, 0.3914, 17.5743, 1.257, 2.903, 862.63),
(2114, '加工調理食品及其他類', '天婦羅', '樣品狀態:含魚漿,太白粉等(不含調味醬); 前處理描述:混合均勻打碎', '甜不辣', 175.895, 12.4, 4.6989, 1.2412, 21.0011, 0.2, 5.177, 684),
(2115, '加工調理食品及其他類', '冷凍花枝漿', '樣品狀態:冷凍包裝(花枝塊,調味品,澱粉等); 前處理描述:混合均勻打碎', NULL, 226.916, 11.176, 12.6246, 4.4716, 17.1476, 1.9951, 1.8, 636.644),
(2116, '加工調理食品及其他類', '冷凍花枝羹', '樣品狀態:冷凍包裝(花枝,魚漿等); 前處理描述:混合均勻打碎', NULL, 125.5, 11.4, 4.7, 1.7714, 9.4, NULL, NULL, 448),
(2117, '加工調理食品及其他類', '魚肉脯', '樣品狀態:魚製品,加鹽水煮; 前處理描述:混合均勻打碎', NULL, 103.7, 21.9, 1.7, 0.8073, 0.2, NULL, NULL, 1482),
(2118, '加工調理食品及其他類', '鯖魚肉脯', '前處理描述:去鱗,去骨刺及內臟,先蒸10分鐘 ,再炒60分鐘(不加油)', NULL, 684.566, 33.77, 60.38, 14.7025, 1.5165, NULL, NULL, 562.97),
(2119, '加工調理食品及其他類', '魚肉鬆', '樣品狀態:魚製品; 前處理描述:混合均勻打碎', '魚肉酥', 469.8, 28.2, 20.2, 6.87, 43.8, NULL, NULL, 1761),
(2120, '加工調理食品及其他類', '旗魚鬆', '樣品狀態:魚製品(旗魚肉 vit E等); 前處理描述:混合均勻打碎', NULL, 480.865, 31.319, 22.8807, 9.5313, 37.4157, NULL, 20.665, 1678.62),
(2121, '加工調理食品及其他類', '鮭魚鬆', '樣品狀態:魚製品(鮭魚肉 vit E等); 前處理描述:混合均勻打碎', NULL, 451.768, 28.972, 21.6211, 7.9054, 35.3226, NULL, 26.094, 1499.75),
(2122, '加工調理食品及其他類', '香筍鮪魚罐頭', '樣品狀態:罐頭製品(鮪魚,金筍等); 前處理描述:混合均勻打碎', NULL, 260.5, 10, 24.1, 3.844, 0.9, 1.4, NULL, 588),
(2123, '加工調理食品及其他類', '茄汁鯖魚罐頭', '樣品狀態:罐頭製品(鯖魚,番茄醬,鹽,糖等); 前處理描述:混合均勻打碎', NULL, 116.265, 17.577, 3.8423, 1.3306, 2.844, 0.7152, 3.089, 356.99),
(2124, '加工調理食品及其他類', '蒜味甘扁桃仁', '前處理描述:混合均勻打碎(杏仁,鹽,蒜粉,植物油等)', '蒜味杏仁果', 648.118, 23.349, 53.6446, 4.8136, 17.9801, 9.2955, 4.492, 203.021),
(2125, '加工調理食品及其他類', '杏仁霜', '樣品狀態:沖泡即食; 前處理描述:混合均勻', '杏仁粉,杏仁茶', 554.485, 9.675, 36.3659, 3.1762, 47.1231, 4.8326, 26.177, 172.369),
(2126, '加工調理食品及其他類', '蜜汁松子仁', '前處理描述:混合均勻打碎(松子仁,果糖,鹽等)', NULL, 697.07, 14.89, 62.39, 5.2131, 19, 4.03, NULL, 2.36),
(2127, '加工調理食品及其他類', '鹽酥夏威夷豆', '前處理描述:混合均勻打碎(夏威夷豆,鹽等)', '夏威夷火山豆', 772.563, 9.4045, 76.3138, 12.8799, 12.0302, 5.3912, 4.335, 80.097),
(2128, '加工調理食品及其他類', '甜核桃', '前處理描述:混合均勻打碎(核桃,糖,麥芽糖精等)', NULL, 723.401, 14.448, 67.4103, 6.5577, 14.7292, 6.1627, 3.706, 28.342),
(2129, '加工調理食品及其他類', '糖炒栗子', '前處理描述:以砂糖炒煮三十分鐘後去殼,混合均勻打碎', NULL, 209.05, 4.15, 0.81, 0.1575, 46.29, 5.67, NULL, 1.96),
(2130, '加工調理食品及其他類', '蜜汁腰果', '前處理描述:混合均勻打碎(腰果,蜂蜜等)', NULL, 599.62, 17.59, 43.58, 10.3639, 34.26, 1.95, NULL, 12.15),
(2131, '加工調理食品及其他類', '玉桂西瓜子', '前處理描述:去殼,混合均勻打碎(西瓜子,玉桂等)', NULL, 528.868, 31.05, 34.4, 5.9461, 23.767, 16.34, NULL, 854.1),
(2132, '加工調理食品及其他類', '醬油西瓜子', '前處理描述:去殼,混合均勻打碎(西瓜子,鹽,醬油,椰子油,香料等)', NULL, 547.032, 29.537, 37.6654, 6.8438, 22.4739, 10.9052, 1.844, 684.734),
(2133, '加工調理食品及其他類', '鹽酥帶殼花生(熟)', '前處理描述:去殼; 混合均勻打碎(花生,鹽等)', '土豆,長生果,落花生', 568.16, 28.246, 38.0657, 7.6687, 28.1462, 9.0102, 3.662, 319.48),
(2134, '加工調理食品及其他類', '醃漬花生仁', '樣品狀態:醃漬品; 前處理描述:混合均勻打碎', '土豆,長生果,落花生', 288, 10.6, 26, NULL, 2.9, NULL, NULL, NULL),
(2135, '加工調理食品及其他類', '糖漬花生仁', '前處理描述:去膜,混合均勻打碎(花生仁,糖等)', '土豆,長生果,落花生', 381.558, 14.22, 23.271, 4.8658, 28.8098, 4.0952, NULL, 37.1909),
(2136, '加工調理食品及其他類', '油炸花生仁', '前處理描述:含膜,混合均勻打碎(花生仁,鹽,植物油等)', '土豆,長生果,落花生', 623.415, 28.886, 48.4481, 10.5048, 17.9595, 7.0233, 3.702, 429.504),
(2137, '加工調理食品及其他類', '蛋酥花生仁', '前處理描述:含膜,混合均勻打碎(花生仁,蛋,糖,植物油等)', '土豆,長生果,落花生', 606.24, 21.14, 43.84, 10.9101, 31.78, 7.26, NULL, 44.81),
(2138, '加工調理食品及其他類', '鹽酥花生仁', '前處理描述:含膜,混合均勻打碎(帶膜花生仁,鹽,糖,五香等)', '土豆,長生果,落花生', 556.513, 28.824, 35.8688, 7.4611, 29.5995, 9.9064, 6.894, 454.349),
(2139, '加工調理食品及其他類', '調味南瓜子(去殼)', '前處理描述:混合均勻打碎(南瓜子,糖,鹽,水等)', '白瓜子', 606.84, 30.403, 47.8992, 9.1253, 13.5337, 8.3181, 1.39, 182.53),
(2140, '加工調理食品及其他類', '調味南瓜子(帶殼)', '前處理描述:去殼,混合均勻打碎(南瓜子,鹽等)', '白瓜子', 606.515, 25.899, 47.2299, 9.3123, 19.4624, 6.1293, 1.493, 395.371),
(2141, '加工調理食品及其他類', '甘草葵瓜子(帶殼)', '前處理描述:去殼,混合均勻打碎(葵瓜子,甘草等)', NULL, 563.64, 26.78, 39.28, 5.0219, 25.75, 19.7455, NULL, 636.76),
(2142, '加工調理食品及其他類', '鹽酥葵瓜子(帶殼)', '前處理描述:去殼,混合均勻打碎(帶殼葵瓜子,鹽,糖,香料,鮮奶等)', NULL, 618.565, 25.9435, 49.2952, 5.7133, 17.7836, 8.1121, 2.622, 667.718),
(2143, '加工調理食品及其他類', '糖漬蓮子', '樣品狀態:糖漬品(蓮子,糖等); 前處理描述:混合均勻打碎', NULL, 229.887, 5.722, 0.147, 0, 51.4191, 3.275, NULL, 10.6634),
(2144, '加工調理食品及其他類', '烤雞', '樣品狀態:全雞肉; 前處理描述:去頭尾,去骨,混合均勻打碎', '手扒雞', 232.943, 22.753, 14.16, 4.1795, 3.6227, NULL, NULL, 194.73),
(2145, '加工調理食品及其他類', '冷凍烤雞翅', '樣品狀態:冷凍包裝(雞翅,植物油等); 前處理描述:去骨,混合均勻打碎', NULL, 217.4, 18.8, 14.2, 3.9121, 3.6, NULL, NULL, 509),
(2146, '加工調理食品及其他類', '鴨賞', '前處理描述:混合均勻打碎', NULL, 304, 31.1, 17.6, 6.0245, 5.3, NULL, NULL, 2853),
(2147, '加工調理食品及其他類', '茶鵝', '樣品狀態:全茶鵝肉,以紅茶葉薰烤; 前處理描述:含皮,去頭腳,去骨及內臟,混合均勻打碎', NULL, 351.91, 15.55, 32.55, 9.0525, 0, NULL, NULL, 376.5),
(2148, '加工調理食品及其他類', '熟鵝腿肉', '樣品狀態:鵝腿部位,水煮; 前處理描述:去骨,混合均勻打碎', NULL, 284.8, 18.5, 23.6, 6.7095, 0, NULL, NULL, 43),
(2149, '加工調理食品及其他類', '鯊魚煙', '前處理描述:混合均勻打碎', NULL, 67.9732, 22.294, 0.3584, 0.1732, 0, NULL, 0, 257.65),
(2150, '加工調理食品及其他類', '日本鰻鱺魚片(蒲燒)', '前處理描述:混合均勻打碎', '白鰻,日本鰻,正鰻,白鱔,鰻鱺,土鰻(澎湖),淡水鰻(澎湖) ', 272.215, 25.031, 18.7321, 5.8495, 0.8756, NULL, 2.341, 420.708),
(2151, '加工調理食品及其他類', '鹽漬小鱗脂眼鯡(鹹馧仔)', '前處理描述:去頭尾及骨刺,混合均勻打碎', '臭肉鰮,鰮仔,圓眼仔,鰮魚,鰮仔魚,圓仔魚(幼魚),脂眼鯡,臭肉,臭肉魚/肉鰮(澎湖) ', 223.8, 17.4, 17, 3.4697, 0.3, NULL, NULL, 1511),
(2152, '加工調理食品及其他類', '鯖魚(醃製)', '前處理描述:去骨,含皮,混合均勻打碎', '鹹鯖魚', 280.8, 14.9, 24, 5.5776, 1.3, NULL, NULL, 889),
(2153, '加工調理食品及其他類', '鯖魚(醃製)(2022年取樣)', '前處理描述:去骨,含皮,混合均勻打碎', '鹹鯖魚', 296.463, 17.047, 21.0264, 5.0787, 9.7593, 0, 0, 244.55),
(2154, '加工調理食品及其他類', '毛鱗魚(柳葉魚)(裹粉未炸)', '樣品狀態:冷凍包裝; 前處理描述:混合均勻打碎', '柳葉魚', 171.318, 12.887, 4.883, 1.646, 18.9557, 0.6248, 1.631, 492.87),
(2155, '加工調理食品及其他類', '油魚卵(加工)', '樣品狀態:鹽漬品(油魚子,鹽等); 前處理描述:混合均勻打碎', '油魚子', 416.332, 46.627, 27.3048, 5.6373, 0, NULL, 0, 687.732),
(2156, '加工調理食品及其他類', '圓鱈魚卵(加工)', '樣品狀態:醃漬品(圓鱈卵,糖,鹽,檸檬酸,味精等); 前處理描述:混合均勻打碎', NULL, 84.3522, 11.221, 4.389, 1.2908, 0, NULL, NULL, 1677.1),
(2157, '加工調理食品及其他類', '鯔魚卵(加工)', '樣品狀態:鹽漬品(烏魚子); 前處理描述:混合均勻打碎', '烏魚卵,烏魚子', 297.271, 36.581, 8.4625, 2.0281, 18.6962, NULL, NULL, 1193.59),
(2158, '加工調理食品及其他類', '鯔魚卵(加工)(2022年取樣)', '樣品狀態:鹽漬品(烏魚子,7兩); 前處理描述:混合均勻打碎', '烏魚卵,烏魚子', 431.228, 38.917, 28.6567, 5.1443, 4.4123, 0, 0, 866.92),
(2159, '加工調理食品及其他類', '醃漬鮭魚卵', '樣品狀態:醃漬品(鮭魚卵,糖,鹽,醬油,味精等); 前處理描述:混合均勻打碎', NULL, 218.203, 24.938, 10.1747, 2.0888, 6.7197, 0, 3.061, 686.5),
(2160, '加工調理食品及其他類', '香魚片', '前處理描述:混合均勻打碎', NULL, 307.125, 36.101, 0.7178, 0.3107, 39.0652, NULL, 40.567, 1238.82),
(2161, '加工調理食品及其他類', '龍蝦卵(調味)', '樣品狀態:醃漬品(龍蝦卵,糖,鹽,檸檬酸,味精等); 前處理描述:混合均勻分裝', NULL, 63.8752, 6.716, 1.806, 0.4538, 5.1893, NULL, NULL, 2868.08),
(2162, '加工調理食品及其他類', '蠑螺(加工)', '樣品狀態:罐頭食品; 前處理描述:混合均勻打碎', NULL, 105, 14.8, 0.2, 0.0548, 11, NULL, NULL, 1035),
(2163, '加工調理食品及其他類', '鹹小卷', '樣品狀態:鹽漬品; 前處理描述:混合均勻打碎', '鹹鎖管,鹽漬小卷', 99.7, 20.1, 1.3, 0.474, 1.9, NULL, NULL, 4254),
(2164, '加工調理食品及其他類', '沖泡濃湯(海鮮)', '樣品狀態:鋁袋包裝; 前處理描述:混合均勻磨碎', NULL, 354.699, 11.2, 6.8599, 4.878, 62.0401, 4.7, 11.626, 6118),
(2165, '加工調理食品及其他類', '玉米濃湯調理包', '前處理描述:混合均勻打碎(澱粉,玉米,糖,鹽,蔬菜粉,植物油,酵母粉,紅蘿蔔,馬鈴薯,維生素等)', NULL, 369.289, 4.363, 5.903, 2.8843, 74.6776, 2.7626, 25.101, 4170.66),
(2166, '加工調理食品及其他類', '麥片沖泡包(三合一)', '樣品狀態:沖泡包; 前處理描述:混合均勻打碎', NULL, 408.7, 11, 7.5, 6.771, 74.3, 2.1, NULL, 313),
(2167, '加工調理食品及其他類', '三合一麥片(野菜蘑菇)', '前處理描述:混合均勻打碎', NULL, 399.212, 6.804, 9.0124, 6.8235, 72.7211, 5.5647, 13.378, 1050.46),
(2168, '加工調理食品及其他類', '糙米麩', '樣品狀態:沖泡即食(糙米,白糖等); 前處理描述:混合均勻', NULL, 386.94, 7.8195, 3.3229, 0.6405, 81.4389, 2.8627, 0, 6.9475),
(2169, '加工調理食品及其他類', '麵茶粉', '樣品狀態:沖泡即食(麵粉,芝麻,糖,植物油,DHA,鈣,大豆卵磷脂等); 前處理描述:混合均勻', NULL, 423.093, 7.196, 6.9869, 2.1882, 82.8567, 2.7222, 27.888, 50.566),
(2170, '加工調理食品及其他類', '植物燕麥奶粉(營養強化)', '樣品狀態:沖泡產品(燕麥、燕麥麩皮、大豆蛋白、鈣、綜合維生素等); 前處理描述:混合均勻', NULL, 436.838, 11.95, 13.2298, 4.5948, 67.4925, 3.2411, 15.528, 125.28),
(2171, '加工調理食品及其他類', '杏仁茶沖泡包', '樣品狀態:沖泡包(杏仁,核桃,穀類粉等); 前處理描述:混合均勻打碎', '綜合堅果穀粉', 399.27, 3.53, 5.15, 1.1904, 84.7, 0.68, NULL, 92.92),
(2172, '加工調理食品及其他類', '芝麻糊沖泡包', '樣品狀態:沖泡包(黑芝麻粉,麥粉,糯米粉等); 前處理描述:混合均勻打碎', NULL, 458.34, 9.31, 15.38, 2.4329, 70.67, 4.16, NULL, 78.31),
(2173, '加工調理食品及其他類', '綜合堅果穀物沖泡包', '樣品狀態:沖泡包(多種堅果及穀物,糖,營養添加劑等); 前處理描述:混合均勻打碎', NULL, 453.099, 13.29, 15.3563, 5.4857, 65.4331, 8.3905, 24.056, 41.655),
(2174, '加工調理食品及其他類', '寒天脆藻', '前處理描述:混合均勻打碎(寒天,水,昆布萃取物等)', '水晶脆藻', 10.6166, 0.042, 0.0486, 0.0144, 2.5028, 1.1398, 0, 12.038),
(2175, '加工調理食品及其他類', '生啤酒', '前處理描述:混合均勻', NULL, 49.5288, 0.389, 0, NULL, 8.2432, NULL, NULL, 2.3),
(2176, '加工調理食品及其他類', '啤酒', '前處理描述:混合均勻(大麥芽,蓬萊米,啤酒花等)', NULL, 49.0056, NULL, 0, NULL, 8.8764, NULL, NULL, 2.55),
(2177, '加工調理食品及其他類', '陳年紹興酒', '前處理描述:混合均勻(糯米,蓬萊米,小麥等)', NULL, 133.078, 1.84, 0, NULL, 19.0544, NULL, NULL, 2.55),
(2178, '加工調理食品及其他類', '白葡萄酒', '前處理描述:混合均勻(葡萄,糖等)', NULL, 90.3096, 0.143, 0, NULL, 14.1844, NULL, NULL, 3.28),
(2179, '加工調理食品及其他類', '紅葡萄酒', '前處理描述:混合均勻(紅葡萄,糖等)', NULL, 92.5664, 0.103, 0, NULL, 14.7886, NULL, NULL, 2.6),
(2180, '加工調理食品及其他類', '雞精', '樣品狀態:瓶裝; 前處理描述:混合均質', NULL, 34.126, 8.581, 0, NULL, 0, NULL, NULL, 86.37);

-- --------------------------------------------------------

--
-- 表的结构 `recipe`
--
-- 创建时间： 2025-07-13 15:11:08
--

DROP TABLE IF EXISTS `recipe`;
CREATE TABLE `recipe` (
  `RecipeId` int(11) NOT NULL,
  `rName` varchar(50) NOT NULL,
  `cooktime` int(11) DEFAULT NULL,
  `DifficultyLevel` varchar(20) DEFAULT NULL,
  `Description` text DEFAULT NULL,
  `uId` int(11) NOT NULL,
  `UploadDate` timestamp NOT NULL DEFAULT current_timestamp(),
  `CoverImage` varchar(255) DEFAULT NULL,
  `ViewCount` int(11) NOT NULL DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 插入之前先把表清空（truncate） `recipe`
--

TRUNCATE TABLE `recipe`;
--
-- 转存表中的数据 `recipe`
--

INSERT INTO `recipe` (`RecipeId`, `rName`, `cooktime`, `DifficultyLevel`, `Description`, `uId`, `UploadDate`, `CoverImage`, `ViewCount`) VALUES
(6, '營養餐點2', 45, '中等', '營養的料理，趕快試試', 2, '2025-03-25 12:58:57', 'Img/image2.jpg', 0),
(8, '香濃牛肉湯', 60, '困難', '慢燉牛肉湯，濃郁美味。', 2, '2025-03-25 12:58:57', 'Img/image4.jpg', 0),
(22, '日式雞肉咖哩飯', 60, '中等', '雞肉咖哩飯', 4, '2025-06-04 06:25:22', 'uploads/10_ChickenCurry_recipe.jpg', 6),
(23, '日式炸豬排咖哩飯', 40, '中等', '炸豬排咖哩飯', 4, '2025-06-04 06:35:20', 'uploads/1748493184_curry.jpg', 4),
(24, '蛋包飯', 30, '中等', '蛋包飯', 4, '2025-06-04 06:42:27', 'uploads/1748500756_images.jpg', 1),
(25, '蝦仁炒飯', 20, '簡單', '炒飯', 4, '2025-06-04 06:51:54', 'Uploads/240506-12480-5-jAmY0.jpg', 0),
(26, '蒙古烤肉', 25, '中等', '來自蒙古的烤肉', 4, '2025-06-04 07:12:56', 'uploads/cc713049f0a0eb10.jpg', 18),
(27, '炒麵', 25, '簡單', '炒麵', 4, '2025-06-04 09:02:02', 'Uploads/33cda7b1f07faebf.jpg', 1),
(28, '玉子燒', 15, '中等', '燒', 4, '2025-06-04 09:08:12', 'Uploads/1716788745758599161.jpg', 0),
(29, '起司蛋糕', 90, '中等', '好吃蛋糕', 4, '2025-06-04 09:20:14', 'Uploads/19-OM-141.jpg', 2),
(30, '牛肉丼飯', 25, '簡單', '牛肉', 4, '2025-06-04 09:30:24', 'Uploads/1200px-Gyuu-don_001.jpg', 1),
(31, '安息雞（Pullum Frontonianum）', 75, '困難', '本身料理並不難，而是食材取得較難。', 4, '2025-06-04 09:53:47', 'Uploads/chicken-fronto2.jpg', 7),
(32, '桂格超大麵包', 800, '困難', '桂格超大麵包', 5, '2025-06-04 14:17:38', '0', 7),
(33, '馬鈴薯燉肉', 25, '簡單', '000', 1, '2025-06-04 15:17:25', 'Uploads/1749695804_1748500756_images.jpg', 4);

-- --------------------------------------------------------

--
-- 表的结构 `recipeingredient`
--
-- 创建时间： 2025-07-13 15:11:08
--

DROP TABLE IF EXISTS `recipeingredient`;
CREATE TABLE `recipeingredient` (
  `RecipeId` int(11) NOT NULL,
  `IngredientName` varchar(100) NOT NULL,
  `Quantity` int(11) DEFAULT NULL,
  `Unit` varchar(50) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 插入之前先把表清空（truncate） `recipeingredient`
--

TRUNCATE TABLE `recipeingredient`;
--
-- 转存表中的数据 `recipeingredient`
--

INSERT INTO `recipeingredient` (`RecipeId`, `IngredientName`, `Quantity`, `Unit`) VALUES
(6, '沙拉醬', 2, '湯匙'),
(6, '燻雞', 200, '克'),
(6, '生菜', 100, '克'),
(6, '番茄', 1, '個'),
(8, '洋蔥', 1, '個'),
(8, '牛排', 300, '克'),
(8, '牛肉高湯', 500, '毫升'),
(8, '胡蘿蔔', 1, '根'),
(8, '馬鈴薯', 2, '個'),
(8, '鹽', 1, '茶匙'),
(8, '黑胡椒', 1, '茶匙'),
(22, '咖哩粉', 30, '克'),
(22, '奶油', 30, '克'),
(22, '水', 400, '毫升'),
(22, '沙拉油', 15, '毫升'),
(22, '洋蔥', 1, '個'),
(22, '番茄罐頭', 200, '毫升'),
(22, '胡蘿蔔', 1, '個'),
(22, '蒜頭', 10, '克'),
(22, '薑', 20, '克'),
(22, '蘋果', 1, '個'),
(22, '雞湯塊', 2, '個'),
(22, '雞腿肉', 300, '克'),
(22, '馬鈴薯', 2, '個'),
(22, '鹽', 1, '克'),
(22, '麵粉', 25, '克'),
(22, '黑胡椒粉', 1, '克'),
(23, '咖哩', 1, '包'),
(23, '洋蔥', 1, '個'),
(23, '紅蘿蔔', 1, '個'),
(23, '豬里肌肉', 150, '克'),
(23, '雞蛋', 1, '個'),
(23, '馬鈴薯', 1, '個'),
(23, '鹽', 2, '克'),
(23, '麵包粉', 100, '克'),
(23, '麵粉', 50, '克'),
(23, '黑胡椒粉', 1, '克'),
(24, '洋蔥', 1, '個'),
(24, '玉米粒罐頭', 50, '克'),
(24, '番茄醬', 15, '毫升'),
(24, '醬油', 15, '毫升'),
(24, '雞胸肉', 150, '克'),
(24, '雞蛋', 2, '個'),
(24, '鮮奶', 30, '毫升'),
(24, '鹽', 1, '克'),
(24, '黑胡椒', 1, '克'),
(25, '洋蔥', 1, '個'),
(25, '蝦仁', 120, '克'),
(25, '醬油', 15, '毫升'),
(25, '雞蛋', 2, '個'),
(25, '青蔥', 1, '個'),
(25, '鹽', 1, '克'),
(25, '黑胡椒', 1, '克'),
(26, '味醂', 15, '毫升'),
(26, '洋蔥', 1, '個'),
(26, '牛肉片', 200, '克'),
(26, '紅蘿蔔', 1, '個'),
(26, '蒜頭', 10, '克'),
(26, '醬油', 30, '毫升'),
(26, '青蔥', 1, '個'),
(26, '高麗菜', 150, '克'),
(26, '黑胡椒', 1, '克'),
(27, '味醂', 15, '毫升'),
(27, '洋蔥', 1, '個'),
(27, '紅蘿蔔', 50, '克'),
(27, '胡椒粉', 1, '毫升'),
(27, '豬肉片', 150, '克'),
(27, '醬油', 30, '毫升'),
(27, '高麗菜', 150, '克'),
(27, '麵條', 300, '克'),
(28, '味醂', 5, '毫升'),
(28, '砂糖', 12, '克'),
(28, '醬油', 5, '毫升'),
(28, '雞蛋', 4, '個'),
(28, '高湯', 30, '毫升'),
(29, '低筋麵粉', 20, '克'),
(29, '奶油乳酪', 250, '克'),
(29, '檸檬汁', 10, '毫升'),
(29, '消化餅乾', 100, '克'),
(29, '無鹽奶油', 40, '克'),
(29, '砂糖', 80, '克'),
(29, '雞蛋', 2, '個'),
(29, '鮮奶油', 100, '毫升'),
(30, '味醂', 30, '毫升'),
(30, '洋蔥', 1, '個'),
(30, '清酒', 30, '毫升'),
(30, '牛肉片', 200, '克'),
(30, '生食雞蛋(非必要)', 1, '個'),
(30, '砂糖', 10, '毫升'),
(30, '醬油', 30, '毫升'),
(30, '高湯', 100, '毫升'),
(31, '全雞', 1, '個'),
(31, '大蒜', 3, '個'),
(31, '奧勒岡粉', 5, '克'),
(31, '孜然粉', 5, '克'),
(31, '橄欖油', 45, '克'),
(31, '檸檬汁', 50, '克'),
(31, '白酒', 250, '克'),
(31, '百里香粉', 5, '克'),
(31, '香菜或巴西里(特殊單位:枝)', 4, ''),
(31, '鹽', 10, '克'),
(31, '黑胡椒粉', 5, '克'),
(32, '大麥片', 88, '個'),
(32, '小麥', 3, '個'),
(33, '小米', 5, '公斤');

-- --------------------------------------------------------

--
-- 表的结构 `recipesteps`
--
-- 创建时间： 2025-07-13 15:11:08
--

DROP TABLE IF EXISTS `recipesteps`;
CREATE TABLE `recipesteps` (
  `RecipeId` int(11) NOT NULL,
  `StepOrder` int(11) NOT NULL,
  `StepDescription` text NOT NULL,
  `StepImage` varchar(255) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 插入之前先把表清空（truncate） `recipesteps`
--

TRUNCATE TABLE `recipesteps`;
--
-- 转存表中的数据 `recipesteps`
--

INSERT INTO `recipesteps` (`RecipeId`, `StepOrder`, `StepDescription`, `StepImage`) VALUES
(6, 1, '準備食材：雞蛋3個、菠菜1把洗淨、番茄1個切丁、火腿2片切小塊、全麥吐司2片、牛奶100毫升、奶油1湯匙、鹽和黑胡椒適量。', 'uploads/test.png'),
(6, 2, '熱鍋加入奶油，小火融化後放入菠菜炒軟，約3分鐘，盛出備用。', 'uploads/test.png'),
(6, 3, '同一鍋中加入火腿塊，炒至微焦，約2分鐘，加入番茄丁炒1分鐘。', 'uploads/test.png'),
(6, 4, '將雞蛋打入碗中，加入牛奶、少許鹽和黑胡椒，攪拌均勻。', 'uploads/test.png'),
(6, 5, '將蛋液倒入鍋中，加入炒好的菠菜，小火慢炒至蛋液凝固，約5分鐘。', 'uploads/test.png'),
(6, 6, '同時用烤箱或平底鍋將全麥吐司烤至金黃，約5分鐘。', 'uploads/test.png'),
(6, 7, '將炒蛋放在吐司上，撒上少許黑胡椒，搭配一杯溫牛奶即可享用，總計約45分鐘。', 'uploads/test.png'),
(22, 1, '雞腿肉切塊後，拌入麵粉（25 克）、咖哩粉（15 克）、鹽和胡椒粉，靜置醃 10 分鐘', ''),
(22, 2, '馬鈴薯、紅蘿蔔、洋蔥切塊；蘋果、薑、蒜頭磨成泥；紅辣椒去籽後切末（如使用）。', ''),
(22, 3, '鍋中加沙拉油（15 毫升），中火將雞肉煎至微焦後取出備用。', ''),
(22, 4, '同鍋加入洋蔥、蒜泥、薑泥與紅辣椒炒至洋蔥變透明。', ''),
(22, 5, '加入馬鈴薯、紅蘿蔔、番茄罐頭（200 毫升）、水（400 毫升）、雞湯塊煮滾。', ''),
(22, 6, '蓋鍋燉煮約 20 分鐘至蔬菜熟軟。', ''),
(22, 7, '加入剩餘咖哩粉（15 克）、蘋果泥、奶油（30 克），略煮至湯汁濃稠。', ''),
(22, 8, '白飯舖底，淋上咖哩即可享用。', ''),
(23, 1, '洋蔥切絲，馬鈴薯與紅蘿蔔切小塊。', ''),
(23, 2, '鍋中加 15 毫升沙拉油，炒香洋蔥至變軟。', ''),
(23, 3, '加入馬鈴薯與紅蘿蔔翻炒 2 分鐘。', ''),
(23, 4, '加入 300 毫升水，煮沸後轉中小火煮 10 分鐘。', ''),
(23, 5, '將咖哩塊加入，攪拌至完全溶化，再煮 5 分鐘使醬汁濃稠。', ''),
(23, 6, '里肌肉片兩面灑上鹽與胡椒', ''),
(23, 7, '依序裹上麵粉 → 蛋液（打散的蛋）→ 麵包粉。', ''),
(23, 8, '鍋中倒入約 500 毫升油，熱至約 170°C。', ''),
(23, 9, '下豬排炸約 3～4 分鐘/面，炸至金黃色，撈起瀝油，靜置 2 分鐘後切片。', ''),
(23, 10, '白飯舖底，放上豬排，淋上咖哩即可享用。', ''),
(24, 1, '雞胸肉切小丁，洋蔥切末。', NULL),
(24, 2, '熱鍋後炒雞肉至變白，加入洋蔥拌炒至透明。', NULL),
(24, 3, '加入玉米粒與白飯（此處不列），翻炒均勻。', NULL),
(24, 4, '加入番茄醬、醬油與黑胡椒，繼續翻炒至收汁，盛出備用。', NULL),
(24, 5, '雞蛋打入碗中，加入鮮奶與鹽，攪拌均勻。', NULL),
(24, 6, '平底鍋加熱後倒入一半蛋液，小火煎成圓形薄蛋皮，略熟但仍柔軟即可。', NULL),
(24, 7, '將炒飯置於蛋皮中央，對折包住，輕輕將蛋包移至盤中，輕壓定型。', NULL),
(25, 1, '蝦仁去腸泥後洗淨瀝乾，洋蔥切丁，青蔥切末，雞蛋打散備用。', NULL),
(25, 2, '熱鍋後將蛋液炒至半熟，盛起備用。', NULL),
(25, 3, '同鍋炒洋蔥至透明，加入蝦仁炒至轉紅。', NULL),
(25, 4, '加入白飯炒散，再加入炒蛋混合均勻。', NULL),
(25, 5, '加入醬油、鹽與黑胡椒調味。', NULL),
(25, 6, '最後撒入青蔥快炒數秒，即可盛盤。', NULL),
(26, 1, '牛肉片切短段，洋蔥、高麗菜、紅蘿蔔切絲，青蔥切段，蒜頭切末備用。', NULL),
(26, 2, '熱鍋後下牛肉片快炒至半熟，撈出備用。', NULL),
(26, 3, '原鍋炒洋蔥、紅蘿蔔與高麗菜至微軟。', NULL),
(26, 4, '加入蒜末與青蔥炒香，再放回牛肉。', NULL),
(26, 5, '淋入醬油與味醂，加黑胡椒，大火快炒約 1 分鐘讓醬汁收乾。', NULL),
(26, 6, '盛盤後可搭配白飯食用。', NULL),
(27, 1, '將高麗菜、紅蘿蔔、洋蔥切絲，豬肉片切小段。', NULL),
(27, 2, '熱鍋炒豬肉片至變色，加入洋蔥炒香。', NULL),
(27, 3, '加入紅蘿蔔和高麗菜拌炒至稍軟。', NULL),
(27, 4, '放入麵條翻炒均勻。', NULL),
(27, 5, '加入醬油、味醂、胡椒粉調味，拌炒至收汁即可。', NULL),
(28, 1, '將雞蛋打入碗中，加入砂糖、醬油、味醂與高湯，攪拌均勻。', NULL),
(28, 2, '平底鍋加熱並抹上一層油，倒入一層薄蛋液，稍微凝固時從一端開始捲起。', NULL),
(28, 3, '將蛋捲推到鍋邊，再倒入蛋液讓它接續在蛋捲旁邊。', NULL),
(28, 4, '重複上述動作，直到蛋液用完並捲成玉子燒。', NULL),
(28, 5, '稍微放涼後切片即可。', NULL),
(29, 1, '將消化餅乾壓碎，與無鹽奶油（40克）混合，鋪在烤模底部壓實，放入冰箱冷藏備用。', NULL),
(29, 2, '奶油乳酪放室溫回軟，加入砂糖（80克）攪拌至滑順無顆粒。', NULL),
(29, 3, '依序加入雞蛋、鮮奶油、低筋麵粉（20克）、檸檬汁（10毫升），攪拌均勻成蛋糕糊。', NULL),
(29, 4, '將蛋糕糊倒入冷藏後的模具中，震出氣泡。', NULL),
(29, 5, '放入預熱至 160°C 的烤箱中烘烤約 50 分鐘，表面上色後可關火悶烤 10 分鐘。', NULL),
(29, 6, '烤好後取出放涼，冷藏至少 4 小時以上再切片食用風味更佳。', NULL),
(30, 1, '洋蔥切絲，牛肉切段（若已為薄片可省略處理）。', NULL),
(30, 2, '在鍋中加入高湯、醬油、味醂、清酒與砂糖，加熱至砂糖完全溶解。', NULL),
(30, 3, '加入洋蔥煮至透明柔軟。', NULL),
(30, 4, '加入牛肉煮熟，撈除浮沫，煮至湯汁略收。', NULL),
(30, 5, '盛入熱白飯上，可加上一顆生蛋或溫泉蛋，依喜好撒上蔥花或七味粉。', NULL),
(31, 1, '將雞肉放入鍋中，加入橄欖油（45 克）、白酒（250 毫升）、香菜（4 枝）、切碎的大蒜（3 個）、鹽（2 克）、黑胡椒、奧勒岡、孜然、百里香（共約 4 克）與檸檬汁（50 毫升）。', NULL),
(31, 2, '混合均勻後，放入預熱至 180°C 的烤箱中，烘烤約 1 小時，直到雞肉熟透。', NULL),
(31, 3, '最後轉成上火烘烤（Broil），再烤約 5 分鐘，讓表皮上色酥脆。', NULL),
(31, 4, '完成後取出，稍微冷卻後即可享用。可搭配蒸豆、熟蔬菜等一同食用。', NULL),
(32, 1, '把小麥放到合成台上', NULL),
(32, 2, '吃掉他', NULL),
(33, 1, '12', NULL);

-- --------------------------------------------------------

--
-- 表的结构 `recipetags`
--
-- 创建时间： 2025-07-13 15:11:09
--

DROP TABLE IF EXISTS `recipetags`;
CREATE TABLE `recipetags` (
  `id` int(11) NOT NULL,
  `RecipeId` int(11) NOT NULL,
  `Tag` varchar(50) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 插入之前先把表清空（truncate） `recipetags`
--

TRUNCATE TABLE `recipetags`;
--
-- 转存表中的数据 `recipetags`
--

INSERT INTO `recipetags` (`id`, `RecipeId`, `Tag`) VALUES
(9, 22, '[{\"value\":\"日式料理\"}]'),
(10, 23, '[{\"value\":\"日式料理\"}]'),
(13, 31, '[{\"value\":\"古代料理\"}]'),
(15, 32, '[{\"value\":\"奇怪的料理\"}]');

-- --------------------------------------------------------

--
-- 表的结构 `recipe_favorites`
--
-- 创建时间： 2025-07-13 15:11:09
--

DROP TABLE IF EXISTS `recipe_favorites`;
CREATE TABLE `recipe_favorites` (
  `id` int(11) NOT NULL,
  `UserId` int(11) NOT NULL,
  `RecipeId` int(11) NOT NULL,
  `FavoriteDate` datetime DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 插入之前先把表清空（truncate） `recipe_favorites`
--

TRUNCATE TABLE `recipe_favorites`;
-- --------------------------------------------------------

--
-- 表的结构 `recipe_likes`
--
-- 创建时间： 2025-07-13 15:11:09
--

DROP TABLE IF EXISTS `recipe_likes`;
CREATE TABLE `recipe_likes` (
  `LikeId` int(11) NOT NULL,
  `RecipeId` int(11) NOT NULL,
  `UserId` int(11) NOT NULL,
  `LikedAt` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 插入之前先把表清空（truncate） `recipe_likes`
--

TRUNCATE TABLE `recipe_likes`;
--
-- 转存表中的数据 `recipe_likes`
--

INSERT INTO `recipe_likes` (`LikeId`, `RecipeId`, `UserId`, `LikedAt`) VALUES
(8, 8, 1, '2025-05-28 03:25:08'),
(18, 6, 1, '2025-05-30 07:22:37');

-- --------------------------------------------------------

--
-- 表的结构 `reviews`
--
-- 创建时间： 2025-07-13 15:11:09
--

DROP TABLE IF EXISTS `reviews`;
CREATE TABLE `reviews` (
  `ReviewId` int(11) NOT NULL,
  `RecipeId` int(11) NOT NULL,
  `UserId` int(11) NOT NULL,
  `Rating` int(11) NOT NULL,
  `Comment` text DEFAULT NULL,
  `CreatedAt` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 插入之前先把表清空（truncate） `reviews`
--

TRUNCATE TABLE `reviews`;
-- --------------------------------------------------------

--
-- 表的结构 `shoppingitem`
--
-- 创建时间： 2025-07-13 15:11:09
--

DROP TABLE IF EXISTS `shoppingitem`;
CREATE TABLE `shoppingitem` (
  `ItemId` int(11) NOT NULL,
  `ShoppingId` int(11) NOT NULL,
  `Quantity` int(11) DEFAULT NULL,
  `Price` int(11) DEFAULT NULL,
  `Unit` varchar(20) DEFAULT NULL,
  `IngredientName` varchar(100) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 插入之前先把表清空（truncate） `shoppingitem`
--

TRUNCATE TABLE `shoppingitem`;
--
-- 转存表中的数据 `shoppingitem`
--

INSERT INTO `shoppingitem` (`ItemId`, `ShoppingId`, `Quantity`, `Price`, `Unit`, `IngredientName`) VALUES
(25, 17, 12, 6, '顆', '雞蛋'),
(26, 17, 2, 55, '瓶', '牛奶'),
(27, 17, 1, 45, '顆', '高麗菜'),
(28, 17, 2, 90, '包', '雞胸肉'),
(29, 17, 3, 10, '根', '紅蘿蔔'),
(30, 17, 2, 20, '顆', '洋蔥'),
(31, 17, 1, 120, '包', '白米'),
(32, 17, 1, 60, '瓶', '醬油'),
(33, 17, 5, 2, '瓣', '蒜頭'),
(34, 17, 2, 25, '盒', '豆腐'),
(35, 18, 21, 213, '個', 'hgj');

-- --------------------------------------------------------

--
-- 表的结构 `shoppinglist`
--
-- 创建时间： 2025-07-13 15:11:09
--

DROP TABLE IF EXISTS `shoppinglist`;
CREATE TABLE `shoppinglist` (
  `ShoppingId` int(11) NOT NULL,
  `uId` int(11) NOT NULL,
  `CreateDate` date NOT NULL DEFAULT curdate(),
  `IsCompleted` tinyint(1) DEFAULT 0 COMMENT '是否完成購物',
  `ListName` varchar(100) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 插入之前先把表清空（truncate） `shoppinglist`
--

TRUNCATE TABLE `shoppinglist`;
--
-- 转存表中的数据 `shoppinglist`
--

INSERT INTO `shoppinglist` (`ShoppingId`, `uId`, `CreateDate`, `IsCompleted`, `ListName`) VALUES
(17, 1, '2025-06-04', 0, '購物清單展示'),
(18, 6, '2025-07-03', 0, 'ghjh');

-- --------------------------------------------------------

--
-- 表的结构 `user`
--
-- 创建时间： 2025-07-13 15:11:06
--

DROP TABLE IF EXISTS `user`;
CREATE TABLE `user` (
  `uId` int(11) NOT NULL,
  `uName` varchar(50) NOT NULL,
  `Password` varchar(255) NOT NULL,
  `Email` varchar(50) NOT NULL,
  `Language` varchar(50) DEFAULT NULL,
  `uImage` varchar(255) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 插入之前先把表清空（truncate） `user`
--

TRUNCATE TABLE `user`;
--
-- 转存表中的数据 `user`
--

INSERT INTO `user` (`uId`, `uName`, `Password`, `Email`, `Language`, `uImage`) VALUES
(1, 'admin', '$2y$10$F/B3o2q7dHKDIWeVQV4Knec.ywEnw3OW0VsgsHA7MxWnWrXPSjm3i', 'abc@nutc.edu.tw', '', 'uploads/1_avatar.png'),
(2, 'admin2', '$2y$10$HMh7glCIGPEkzdUYXUt7BuhlTfHMJ0DRrw9RaZXnKOTbxYSq7GWK6', 'def@nutc.edu.tw', '', 'uploads/2_avatar.jpg'),
(4, '官方食譜', '$2y$10$/oSWSN82PcpTQY.M4d.Roe31PMKKPHg1wAB6SqHraqUoClZI52pR.', 'office@gmail.com', '', 'uploads/user-placeholder.jpg'),
(5, 'Ferzbow', '$2y$10$aLCFFPklJ1RgDC3LCrccWOoYJ/WMQvZrSyGoJumYPG1exrwiP.1JK', 'TsaiYoung@gmail.com', '', 'uploads/user-placeholder.jpg'),
(6, 'a123', '$2y$10$uW.L4A6k5GYbfuejxjNHouZhiFC3zU3SDl/JMElgV1KQvPME3nbwy', 'a123@gmail.com', '', 'uploads/user-placeholder.jpg');

-- --------------------------------------------------------

--
-- 表的结构 `user_calorie_goal`
--
-- 创建时间： 2025-07-13 15:11:10
-- 最后更新： 2025-08-03 12:32:44
--

DROP TABLE IF EXISTS `user_calorie_goal`;
CREATE TABLE `user_calorie_goal` (
  `id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `calorie_goal` int(11) NOT NULL,
  `gender` enum('male','female','other') DEFAULT NULL,
  `age` int(11) DEFAULT NULL,
  `height` int(11) DEFAULT NULL,
  `weight` int(11) DEFAULT NULL,
  `updated_at` datetime DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 插入之前先把表清空（truncate） `user_calorie_goal`
--

TRUNCATE TABLE `user_calorie_goal`;
--
-- 转存表中的数据 `user_calorie_goal`
--

INSERT INTO `user_calorie_goal` (`id`, `user_id`, `calorie_goal`, `gender`, `age`, `height`, `weight`, `updated_at`) VALUES
(1, 1, 2575, 'male', 25, 175, 78, '2025-07-14 22:47:15'),
(2, 1, 2614, 'male', 25, 175, 80, '2025-08-02 14:10:08'),
(3, 1, 2575, 'male', 25, 175, 78, '2025-08-02 14:10:23'),
(4, 1, 2575, 'male', 25, 175, 78, '2025-08-02 14:12:25'),
(5, 1, 2575, 'male', 25, 175, 78, '2025-08-03 18:00:48'),
(6, 1, 2575, 'male', 25, 175, 78, '2025-08-03 20:28:40'),
(7, 1, 2575, 'male', 25, 175, 78, '2025-08-03 20:29:09'),
(8, 1, 2575, 'male', 25, 175, 78, '2025-08-03 20:32:10'),
(9, 1, 2575, 'male', 25, 175, 78, '2025-08-03 20:32:27'),
(10, 1, 2575, 'male', 25, 175, 78, '2025-08-03 20:32:37'),
(11, 1, 2575, 'male', 25, 175, 78, '2025-08-03 20:32:44');

-- --------------------------------------------------------

--
-- 表的结构 `user_nutrition_goal`
--
-- 创建时间： 2025-08-03 10:26:21
-- 最后更新： 2025-08-03 12:32:44
--

DROP TABLE IF EXISTS `user_nutrition_goal`;
CREATE TABLE `user_nutrition_goal` (
  `id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `protein_goal` float DEFAULT 0,
  `fat_goal` float DEFAULT 0,
  `carb_goal` float DEFAULT 0,
  `fiber_goal` float DEFAULT 0,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 插入之前先把表清空（truncate） `user_nutrition_goal`
--

TRUNCATE TABLE `user_nutrition_goal`;
--
-- 转存表中的数据 `user_nutrition_goal`
--

INSERT INTO `user_nutrition_goal` (`id`, `user_id`, `protein_goal`, `fat_goal`, `carb_goal`, `fiber_goal`, `created_at`, `updated_at`) VALUES
(1, 1, 120.6, 80.4, 301.4, 33.8, '2025-08-03 12:28:40', '2025-08-03 12:32:44');

-- --------------------------------------------------------

--
-- 表的结构 `user_roles`
--
-- 创建时间： 2025-07-13 15:11:10
--

DROP TABLE IF EXISTS `user_roles`;
CREATE TABLE `user_roles` (
  `id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `role_name` varchar(50) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 插入之前先把表清空（truncate） `user_roles`
--

TRUNCATE TABLE `user_roles`;
--
-- 转存表中的数据 `user_roles`
--

INSERT INTO `user_roles` (`id`, `user_id`, `role_name`) VALUES
(1, 1, '爸爸'),
(4, 1, '媽媽'),
(5, 1, '弟弟'),
(6, 6, '弟弟');

--
-- 转储表的索引
--

--
-- 表的索引 `calorie_records`
--
ALTER TABLE `calorie_records`
  ADD PRIMARY KEY (`id`),
  ADD KEY `user_id` (`user_id`);

--
-- 表的索引 `family`
--
ALTER TABLE `family`
  ADD PRIMARY KEY (`familyId`),
  ADD KEY `createdBy` (`createdBy`);

--
-- 表的索引 `family_member`
--
ALTER TABLE `family_member`
  ADD PRIMARY KEY (`id`),
  ADD KEY `uId` (`uId`),
  ADD KEY `familyId` (`familyId`),
  ADD KEY `role` (`role`);

--
-- 表的索引 `family_roles`
--
ALTER TABLE `family_roles`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `role_name` (`role_name`);

--
-- 表的索引 `ingredient`
--
ALTER TABLE `ingredient`
  ADD PRIMARY KEY (`IngredientId`),
  ADD KEY `uId` (`uId`);

--
-- 表的索引 `ingredientusage`
--
ALTER TABLE `ingredientusage`
  ADD PRIMARY KEY (`UsageId`),
  ADD KEY `IngredientId` (`IngredientId`),
  ADD KEY `uId` (`uId`);

--
-- 表的索引 `notifications`
--
ALTER TABLE `notifications`
  ADD PRIMARY KEY (`id`),
  ADD KEY `user_id` (`user_id`);

--
-- 表的索引 `nutrition_facts`
--
ALTER TABLE `nutrition_facts`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `recipe`
--
ALTER TABLE `recipe`
  ADD PRIMARY KEY (`RecipeId`),
  ADD KEY `uId` (`uId`);

--
-- 表的索引 `recipeingredient`
--
ALTER TABLE `recipeingredient`
  ADD PRIMARY KEY (`RecipeId`,`IngredientName`);

--
-- 表的索引 `recipesteps`
--
ALTER TABLE `recipesteps`
  ADD PRIMARY KEY (`RecipeId`,`StepOrder`);

--
-- 表的索引 `recipetags`
--
ALTER TABLE `recipetags`
  ADD PRIMARY KEY (`id`),
  ADD KEY `RecipeId` (`RecipeId`);

--
-- 表的索引 `recipe_favorites`
--
ALTER TABLE `recipe_favorites`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `unique_favorite` (`UserId`,`RecipeId`),
  ADD KEY `RecipeId` (`RecipeId`);

--
-- 表的索引 `recipe_likes`
--
ALTER TABLE `recipe_likes`
  ADD PRIMARY KEY (`LikeId`),
  ADD UNIQUE KEY `unique_like` (`RecipeId`,`UserId`),
  ADD KEY `UserId` (`UserId`);

--
-- 表的索引 `reviews`
--
ALTER TABLE `reviews`
  ADD PRIMARY KEY (`ReviewId`),
  ADD KEY `RecipeId` (`RecipeId`),
  ADD KEY `UserId` (`UserId`);

--
-- 表的索引 `shoppingitem`
--
ALTER TABLE `shoppingitem`
  ADD PRIMARY KEY (`ItemId`),
  ADD KEY `ShoppingId` (`ShoppingId`);

--
-- 表的索引 `shoppinglist`
--
ALTER TABLE `shoppinglist`
  ADD PRIMARY KEY (`ShoppingId`),
  ADD KEY `uId` (`uId`);

--
-- 表的索引 `user`
--
ALTER TABLE `user`
  ADD PRIMARY KEY (`uId`);

--
-- 表的索引 `user_calorie_goal`
--
ALTER TABLE `user_calorie_goal`
  ADD PRIMARY KEY (`id`),
  ADD KEY `user_id` (`user_id`);

--
-- 表的索引 `user_nutrition_goal`
--
ALTER TABLE `user_nutrition_goal`
  ADD PRIMARY KEY (`id`),
  ADD KEY `user_id` (`user_id`);

--
-- 表的索引 `user_roles`
--
ALTER TABLE `user_roles`
  ADD PRIMARY KEY (`id`),
  ADD KEY `user_id` (`user_id`);

--
-- 在导出的表使用AUTO_INCREMENT
--

--
-- 使用表AUTO_INCREMENT `calorie_records`
--
ALTER TABLE `calorie_records`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=94;

--
-- 使用表AUTO_INCREMENT `family`
--
ALTER TABLE `family`
  MODIFY `familyId` int(11) NOT NULL AUTO_INCREMENT;

--
-- 使用表AUTO_INCREMENT `family_member`
--
ALTER TABLE `family_member`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- 使用表AUTO_INCREMENT `family_roles`
--
ALTER TABLE `family_roles`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=11;

--
-- 使用表AUTO_INCREMENT `ingredient`
--
ALTER TABLE `ingredient`
  MODIFY `IngredientId` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=34;

--
-- 使用表AUTO_INCREMENT `ingredientusage`
--
ALTER TABLE `ingredientusage`
  MODIFY `UsageId` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- 使用表AUTO_INCREMENT `notifications`
--
ALTER TABLE `notifications`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- 使用表AUTO_INCREMENT `nutrition_facts`
--
ALTER TABLE `nutrition_facts`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2181;

--
-- 使用表AUTO_INCREMENT `recipe`
--
ALTER TABLE `recipe`
  MODIFY `RecipeId` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=35;

--
-- 使用表AUTO_INCREMENT `recipetags`
--
ALTER TABLE `recipetags`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=16;

--
-- 使用表AUTO_INCREMENT `recipe_favorites`
--
ALTER TABLE `recipe_favorites`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=17;

--
-- 使用表AUTO_INCREMENT `recipe_likes`
--
ALTER TABLE `recipe_likes`
  MODIFY `LikeId` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=21;

--
-- 使用表AUTO_INCREMENT `reviews`
--
ALTER TABLE `reviews`
  MODIFY `ReviewId` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=8;

--
-- 使用表AUTO_INCREMENT `shoppingitem`
--
ALTER TABLE `shoppingitem`
  MODIFY `ItemId` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=36;

--
-- 使用表AUTO_INCREMENT `shoppinglist`
--
ALTER TABLE `shoppinglist`
  MODIFY `ShoppingId` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=19;

--
-- 使用表AUTO_INCREMENT `user`
--
ALTER TABLE `user`
  MODIFY `uId` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- 使用表AUTO_INCREMENT `user_calorie_goal`
--
ALTER TABLE `user_calorie_goal`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=12;

--
-- 使用表AUTO_INCREMENT `user_nutrition_goal`
--
ALTER TABLE `user_nutrition_goal`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- 使用表AUTO_INCREMENT `user_roles`
--
ALTER TABLE `user_roles`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- 限制导出的表
--

--
-- 限制表 `calorie_records`
--
ALTER TABLE `calorie_records`
  ADD CONSTRAINT `calorie_records_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `user` (`uId`) ON DELETE CASCADE;

--
-- 限制表 `family`
--
ALTER TABLE `family`
  ADD CONSTRAINT `family_ibfk_1` FOREIGN KEY (`createdBy`) REFERENCES `user` (`uId`);

--
-- 限制表 `family_member`
--
ALTER TABLE `family_member`
  ADD CONSTRAINT `family_member_ibfk_1` FOREIGN KEY (`uId`) REFERENCES `user` (`uId`),
  ADD CONSTRAINT `family_member_ibfk_2` FOREIGN KEY (`familyId`) REFERENCES `family` (`familyId`),
  ADD CONSTRAINT `family_member_ibfk_3` FOREIGN KEY (`role`) REFERENCES `family_roles` (`role_name`);

--
-- 限制表 `ingredient`
--
ALTER TABLE `ingredient`
  ADD CONSTRAINT `ingredient_ibfk_1` FOREIGN KEY (`uId`) REFERENCES `user` (`uId`);

--
-- 限制表 `ingredientusage`
--
ALTER TABLE `ingredientusage`
  ADD CONSTRAINT `ingredientusage_ibfk_1` FOREIGN KEY (`IngredientId`) REFERENCES `ingredient` (`IngredientId`),
  ADD CONSTRAINT `ingredientusage_ibfk_2` FOREIGN KEY (`uId`) REFERENCES `user` (`uId`);

--
-- 限制表 `notifications`
--
ALTER TABLE `notifications`
  ADD CONSTRAINT `notifications_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `user` (`uId`) ON DELETE CASCADE;

--
-- 限制表 `recipe`
--
ALTER TABLE `recipe`
  ADD CONSTRAINT `recipe_ibfk_1` FOREIGN KEY (`uId`) REFERENCES `user` (`uId`);

--
-- 限制表 `recipeingredient`
--
ALTER TABLE `recipeingredient`
  ADD CONSTRAINT `recipeingredient_ibfk_1` FOREIGN KEY (`RecipeId`) REFERENCES `recipe` (`RecipeId`);

--
-- 限制表 `recipesteps`
--
ALTER TABLE `recipesteps`
  ADD CONSTRAINT `recipesteps_ibfk_1` FOREIGN KEY (`RecipeId`) REFERENCES `recipe` (`RecipeId`) ON DELETE CASCADE;

--
-- 限制表 `recipetags`
--
ALTER TABLE `recipetags`
  ADD CONSTRAINT `recipetags_ibfk_1` FOREIGN KEY (`RecipeId`) REFERENCES `recipe` (`RecipeId`) ON DELETE CASCADE;

--
-- 限制表 `recipe_favorites`
--
ALTER TABLE `recipe_favorites`
  ADD CONSTRAINT `recipe_favorites_ibfk_1` FOREIGN KEY (`UserId`) REFERENCES `user` (`uId`) ON DELETE CASCADE,
  ADD CONSTRAINT `recipe_favorites_ibfk_2` FOREIGN KEY (`RecipeId`) REFERENCES `recipe` (`RecipeId`) ON DELETE CASCADE;

--
-- 限制表 `recipe_likes`
--
ALTER TABLE `recipe_likes`
  ADD CONSTRAINT `recipe_likes_ibfk_1` FOREIGN KEY (`RecipeId`) REFERENCES `recipe` (`RecipeId`) ON DELETE CASCADE,
  ADD CONSTRAINT `recipe_likes_ibfk_2` FOREIGN KEY (`UserId`) REFERENCES `user` (`uId`) ON DELETE CASCADE;

--
-- 限制表 `reviews`
--
ALTER TABLE `reviews`
  ADD CONSTRAINT `reviews_ibfk_1` FOREIGN KEY (`RecipeId`) REFERENCES `recipe` (`RecipeId`),
  ADD CONSTRAINT `reviews_ibfk_2` FOREIGN KEY (`UserId`) REFERENCES `user` (`uId`);

--
-- 限制表 `shoppingitem`
--
ALTER TABLE `shoppingitem`
  ADD CONSTRAINT `shoppingitem_ibfk_1` FOREIGN KEY (`ShoppingId`) REFERENCES `shoppinglist` (`ShoppingId`);

--
-- 限制表 `shoppinglist`
--
ALTER TABLE `shoppinglist`
  ADD CONSTRAINT `shoppinglist_ibfk_1` FOREIGN KEY (`uId`) REFERENCES `user` (`uId`);

--
-- 限制表 `user_calorie_goal`
--
ALTER TABLE `user_calorie_goal`
  ADD CONSTRAINT `user_calorie_goal_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `user` (`uId`) ON DELETE CASCADE;

--
-- 限制表 `user_nutrition_goal`
--
ALTER TABLE `user_nutrition_goal`
  ADD CONSTRAINT `user_nutrition_goal_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `user` (`uId`) ON DELETE CASCADE;

--
-- 限制表 `user_roles`
--
ALTER TABLE `user_roles`
  ADD CONSTRAINT `user_roles_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `user` (`uId`) ON DELETE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
